[{"route":"/","markdown":"\n<div class=\"container-fluid\" id=\"home\">\n\n<div class=\"row\">\n\n<div class=\"col-12 col-md-6\">\n\nHelping Everyone Access Linked Systems (Illinois HEALS) is a multi-year initiative to address child and youth victimization.\n\nIllinois HEALS will enlist experts, service providers, community groups, and other relevant stakeholders to:\n\n- Complete a 15-month strategic planning process resulting in a detailed statewide plan (Phase 1).\n\n- Implement a multisystem statewide effort to improve outcomes for children, youth, and their families (Phase 2).\n\n## Project Objectives\n\n- Identify and promote healing for victims of crime.\n\n- Provide or coordinate prevention and intervention services to youth and families experiencing trauma and victimization.\n\n- Build capacity within communities to meet the needs of youth exposed to violence.\n\n</div>\n\n<div class=\"col-12 col-md-6\">\n\n<h2 style=\"margin-top: -8px;\">Background</h2>\n\nIn October 2017, Illinois was awarded a Linking Systems of Care for Children and Youth grant from the Office for Victims of Crime (OVC), Office of Justice Programs, U.S. Department of Justice. Illinois is one of only four states designated as a demonstration site for planning and implementing the multi-year grant. The Illinois Criminal Justice Information Authority (ICJIA) is the coordinating entity for this project in Illinois.\n\nThrough this demonstration project, OVC wants to learn what is needed to bring healthcare, child welfare, justice, and other systems together at a statewide level to coordinate and align efforts to ensure a timely and seamless response to young victims, their families, and caregivers, no matter the system of entry.\n\n</div>\n\n</div>\n\n</div>\n","title":"Illinois HEALS","menuTitle":"Home","createdAt":"2020-11-03","html":"<div class=\"container-fluid\" id=\"home\">\n<div class=\"row\">\n<div class=\"col-12 col-md-6\">\n<p>Helping Everyone Access Linked Systems (Illinois HEALS) is a multi-year initiative to address child and youth victimization.</p>\n<p>Illinois HEALS will enlist experts, service providers, community groups, and other relevant stakeholders to:</p>\n<ul>\n<li>\n<p>Complete a 15-month strategic planning process resulting in a detailed statewide plan (Phase 1).</p>\n</li>\n<li>\n<p>Implement a multisystem statewide effort to improve outcomes for children, youth, and their families (Phase 2).</p>\n</li>\n</ul>\n<h2 id=\"project-objectives\">Project Objectives</h2>\n<ul>\n<li>\n<p>Identify and promote healing for victims of crime.</p>\n</li>\n<li>\n<p>Provide or coordinate prevention and intervention services to youth and families experiencing trauma and victimization.</p>\n</li>\n<li>\n<p>Build capacity within communities to meet the needs of youth exposed to violence.</p>\n</li>\n</ul>\n</div>\n<div class=\"col-12 col-md-6\">\n<h2 style=\"margin-top: -8px;\">Background</h2>\n<p>In October 2017, Illinois was awarded a Linking Systems of Care for Children and Youth grant from the Office for Victims of Crime (OVC), Office of Justice Programs, U.S. Department of Justice. Illinois is one of only four states designated as a demonstration site for planning and implementing the multi-year grant. The Illinois Criminal Justice Information Authority (ICJIA) is the coordinating entity for this project in Illinois.</p>\n<p>Through this demonstration project, OVC wants to learn what is needed to bring healthcare, child welfare, justice, and other systems together at a statewide level to coordinate and align efforts to ensure a timely and seamless response to young victims, their families, and caregivers, no matter the system of entry.</p>\n</div>\n</div>\n</div>\n","toc":[{"content":"Project Objectives","slug":"project-objectives","lvl":2,"i":0,"seen":0}],"description":"Helping Everyone Access Linked Systems (Illinois HEALS) is multi-year initiative to address child and youth victimization.","url":"https://ilheals.com/"},{"route":"/news/icjia-receives-federal-award/","markdown":"\n**CHICAGO - October 26, 2017** | Illinois Criminal Justice Information Authority (ICJIA) Executive Director John Maki today announced the agency received a \\$500,000 federal award to help children and youth suffering from trauma.\n\nThe U.S. Department of Justice Office for Victims of Crime’s (OVC) Vision 21 Award\nwill be used to develop a coordinated statewide plan to serve children and youth who\nhave been directly victimized or exposed to violence in their homes, schools, or\ncommunities.\n\n“As one of just two states that received the Vision 21 award, we are honored that the\nOffice for Victims of Crime chose to invest in Illinois,” said Executive Director Maki.\nUnaddressed trauma can contribute to mental, physical, and developmental consequences\nfor children and adolescents. While a host of systems exist to respond to these issues,\nstates are challenged to effectively communicate and collaborate.\n\nThis award will bring together a coalition of government agencies, victim service\nproviders, law enforcement personnel, health services practitioners, educators, and\ncriminal and juvenile justice stakeholders who will work to strengthen early trauma\nidentification practices and enhance system responsiveness through a 15-month strategic\nplanning process.\n\nThe group will identify areas ripe for improvement and set goals for the agencies and\nservice providers. Particular emphasis will be placed on strengthening communication\nand collaboration, expanding service practices that are trauma- and evidence-informed,\nand creating a single trauma screening tool for use by service providers across Illinois.\n\n“This award reflects the decades of work that stakeholders inside and outside of\ngovernment have done to establish a trauma-informed work force and outcome-driven\nsystem for children and youth impacted by trauma and victimization,” said Dr. Colleen\nCicchetti, Clinical Director of the Illinois Childhood Trauma Coalition.\n\n“The Vision 21 Award will help the State of Illinois and its providers ensure that\nvictimized children and youth don’t fall in the cracks that often exists among disparate\nsystems of care,” said Billie Larkin, Executive Director of the Children Advocacy\nCenters of Illinois.\n\nSubsequent annual grants of \\$500,000 over five years will be available to Illinois from\nOVC to support its statewide implementation of the plan.\n\nICJIA is dedicated to improving the administration of criminal justice through work in\nthe areas of grants administration, research, analysis, policy and planning, and\ninformation systems and technology. Visit https://www.icjia.state.il.us.\n\nDownload the press release here: [Illinois Awarded OVC Grant](https://archive.icjia-api.cloud/files/icjia/pdf/NewsReleases/ICJIA_OVC_trauma_award_102617.pdf)\n","title":"ICJIA Receives Federal Award to Improve Illinois Service Collaboration for Child and Youth Victims of Violence","html":"<p><strong>CHICAGO - October 26, 2017</strong> | Illinois Criminal Justice Information Authority (ICJIA) Executive Director John Maki today announced the agency received a $500,000 federal award to help children and youth suffering from trauma.</p>\n<p>The U.S. Department of Justice Office for Victims of Crime’s (OVC) Vision 21 Award\nwill be used to develop a coordinated statewide plan to serve children and youth who\nhave been directly victimized or exposed to violence in their homes, schools, or\ncommunities.</p>\n<p>“As one of just two states that received the Vision 21 award, we are honored that the\nOffice for Victims of Crime chose to invest in Illinois,” said Executive Director Maki.\nUnaddressed trauma can contribute to mental, physical, and developmental consequences\nfor children and adolescents. While a host of systems exist to respond to these issues,\nstates are challenged to effectively communicate and collaborate.</p>\n<p>This award will bring together a coalition of government agencies, victim service\nproviders, law enforcement personnel, health services practitioners, educators, and\ncriminal and juvenile justice stakeholders who will work to strengthen early trauma\nidentification practices and enhance system responsiveness through a 15-month strategic\nplanning process.</p>\n<p>The group will identify areas ripe for improvement and set goals for the agencies and\nservice providers. Particular emphasis will be placed on strengthening communication\nand collaboration, expanding service practices that are trauma- and evidence-informed,\nand creating a single trauma screening tool for use by service providers across Illinois.</p>\n<p>“This award reflects the decades of work that stakeholders inside and outside of\ngovernment have done to establish a trauma-informed work force and outcome-driven\nsystem for children and youth impacted by trauma and victimization,” said Dr. Colleen\nCicchetti, Clinical Director of the Illinois Childhood Trauma Coalition.</p>\n<p>“The Vision 21 Award will help the State of Illinois and its providers ensure that\nvictimized children and youth don’t fall in the cracks that often exists among disparate\nsystems of care,” said Billie Larkin, Executive Director of the Children Advocacy\nCenters of Illinois.</p>\n<p>Subsequent annual grants of $500,000 over five years will be available to Illinois from\nOVC to support its statewide implementation of the plan.</p>\n<p>ICJIA is dedicated to improving the administration of criminal justice through work in\nthe areas of grants administration, research, analysis, policy and planning, and\ninformation systems and technology. Visit <a href=\"https://www.icjia.state.il.us\">https://www.icjia.state.il.us</a>.</p>\n<p>Download the press release here: <a href=\"https://archive.icjia-api.cloud/files/icjia/pdf/NewsReleases/ICJIA_OVC_trauma_award_102617.pdf\">Illinois Awarded OVC Grant</a></p>\n","toc":[],"description":"CHICAGO - October 26, 2017 | Illinois Criminal Justice Information Authority (ICJIA) Executive Director John Maki today announced the agency received a $500,000 federal award to help children and youth suffering from trauma.","url":"https://ilheals.com/news/icjia-receives-federal-award/"},{"route":"/news/il-heals-action-plan/","markdown":"\nICJIA was awarded a U.S. Office of Victims of Crime grant to implement the Illinois Helping Everyone Access Linked Systems (Illinois HEALS) initiative, a six-year project that seeks to improve the identification, connection, and service engagement of those impacted by violence. Informed by a 15-month planning process, the Illinois HEALS Action Plan encourages cross-system collaboration to strengthen community capacity for recognizing when victimization has occurred and connecting and engaging young victims and families in needed services.\n\nRead the full summary on [ICJIA's Research Hub](https://icjia.illinois.gov/researchhub) here: [Illinois Helping Everyone Access Linked Systems Action Plan](https://icjia.illinois.gov/researchhub/articles/illinois-helping-everyone-access-linked-systems-action-plan)\n","title":"Illinois Helping Everyone Access Linked Systems Action Plan","html":"<p>ICJIA was awarded a U.S. Office of Victims of Crime grant to implement the Illinois Helping Everyone Access Linked Systems (Illinois HEALS) initiative, a six-year project that seeks to improve the identification, connection, and service engagement of those impacted by violence. Informed by a 15-month planning process, the Illinois HEALS Action Plan encourages cross-system collaboration to strengthen community capacity for recognizing when victimization has occurred and connecting and engaging young victims and families in needed services.</p>\n<p>Read the full summary on <a href=\"https://icjia.illinois.gov/researchhub\">ICJIA's Research Hub</a> here: <a href=\"https://icjia.illinois.gov/researchhub/articles/illinois-helping-everyone-access-linked-systems-action-plan\">Illinois Helping Everyone Access Linked Systems Action Plan</a></p>\n","toc":[],"description":"ICJIA was awarded a U.S. Office of Victims of Crime grant to implement the Illinois Helping Everyone Access Linked Systems (Illinois HEALS) initiative, a six-year project that seeks to improve the identification, connection, and service engagement of those impacted by violence. ","url":"https://ilheals.com/news/il-heals-action-plan/"},{"route":"/news-and-updates/","markdown":"\n<NewsList></NewsList>\n","title":"News","menuTitle":"News","createdAt":"2020-11-03","html":"<p><NewsList></NewsList></p>\n","toc":[],"description":"Helping Everyone Access Linked Systems (Illinois HEALS) is multi-year initiative to address child and youth victimization.","url":"https://ilheals.com/news-and-updates/"},{"route":"/process-and-partners/","markdown":"\n<style>\n\nh2 {\n  margin-left: 10px;\n}\n\nh2 ~ p{\n  margin-left: 10px;\n}\n\nh3 {\n  margin-left: 15px;\n}\n\nh3 ~ p {\n    margin-left: 25px;\n}\na{font-weight: bold;}\n\n#process-links {\n  margin-left: 35px;\n}\n</style>\n\n## Guiding Principles\n\nIllinois HEALS incorporates the Guiding Principles articulated by the Office for Victims of Crime. These principles include:\n\n- **Healing Individuals, Families, and Communities**\n\n  Individuals and families who experience or have been exposed to violence deserve support for healing. Healing includes safety, justice, the opportunity to make positive social-emotional connections, and self-determination. Opportunities for healing occur at all points of contact; healing interventions are accessible, trauma-informed, strength-based, individualized, and gender- and culturally responsive.\n\n- **Linked Systems of Care**\n\n  All systems of care are connected and aspire to maximize collective impact through communication, collaboration, and coordination.\n\n- **Informed Decision Making**\n\n  Linked Systems of Care provide as much information as possible to families and practitioners so that the most targeted, holistic, safe, and effective interventions are available.\n\n## Planning\n\nThe strategic planning process—the first phase of the project—began shortly after the funds were awarded. On April 5th, 2018 the Illinois Criminal Justice Information Authority (ICJIA) convened a Leadership Network meeting of senior-level policy makers and subject matter experts in discussions to inform the planning process.\n\nThroughout the spring and summer of 2018, members of the Leadership Network, project staff, and other concerned leaders will document how children and youth victims are identified and their needs addressed. The project will initially explore six domains that represent frequent points of entry for children needing supportive services following an incident of victimization:\n\n<graphic img-file=\"process-domain.png\" img-alt=\"Process Domain image\"></graphic>\n\nIllinois HEALS also conducted a web-based survey from May 1st through June 8th, 2018 to learn about the scope of services available to victims of crime across the state. Analysis of the information will inform recommendations for enhancing the healing process for children, youth and families impacted by crime.\n\nBeginning in May 2018, the Center for Victim Studies at ICJIA will conduct a research project to better understand victims' experiences of harm and contact with providers. The research project received institutional review board (IRB) approval in April and the study will continue throughout the summer and fall. The goal is to identify the needs of child/youth victims and family members/caregivers of young victims. This study will also explore the capacity of systems of care to meet those needs from the perspectives of adults with childhood victimization histories and family members/caregivers of child victims. If you are interested in being a study participant, please complete the brief survey to see if you qualify: Young Victims Study survey\n\nThroughout the summer and fall of 2018, members of the Leadership Network and other stakeholders will review information that is collected and analyses that are conducted to produce an action plan for the state. The action plan, which will be complete in early 2019, will inform an OVC-supported implementation that will occur over the subsequent five years.\n\n<graphic img-file=\"process-timeline.png\" img-alt=\"Process timeline image\"></graphic>\n\n## Action Plan\n\nIllinois HEALS will support community-driven pilot projects that incorporate the guiding principles and are committed to creating systems of care for children, youth, and their families who have experienced or been exposed to violence. Projects will vary based on community needs and resources, though each project will incorporate important aspects shown to improve outcomes for individuals, families, and communities.\n\n**Training and support** for members of the community and professionals. Training includes information about the impact of violence on child and adolescent development and the way that trauma can impact adults. Everyone who interacts with youth in a professional capacity—from school and medical staff to faith leaders and police officers—is in a position to put training into practice and intervene with youth in a positive way.\n\n**Multi-Disciplinary Teams** that coordinate services for the community and identify resources that may benefit children, youth, and their families. These groups use system of care principles to increase access to services. There is also a mechanism in place for service providers to work closely to provide comprehensive, holistic support to families with complex needs beyond what the system has the capacity to address.\n\n**Enhanced services**. Most communities in Illinois have some strong service providers who are able to meet many needs in the communities. Many communities also have service gaps because there are insufficient resources to support more providers or retain quality workers. There are also barriers—like transportation issues, hours of operation, or wait lists—to access services that result in less engagement in support for children, youth, and families. Projects will identify ways to address gaps and barriers to increase services available to those impacted by violence.\n\n## Illinois Stakeholders\n\n### Illinois Criminal Justice Information Authority\n\nThe Illinois Criminal Justice Information Authority (ICJIA) was formed in 1983 as a state agency committed to improving the administration of criminal justice. The ICJIA brings together leaders from the justice system and the public to assist in the identification of challenges or barriers that are present within the justice system in Illinois, in an effort to improve efficiency and outcomes for the public. The ICJIA works in several categories to improve aspects of the criminal justice system: Grants Administration, Research and Analysis, Policy and Planning, and Information Systems and Technology. The 25-member board, comprised of state and local officials, as well as members of the public, sets agency priorities, tracks progress of ongoing programs, and monitors the agency’s budget. Learn more about the ICJIA at http://www.icjia.state.il.us/.\n\n### Leadership Network\n\nICJIA is grateful to individuals from the following organizations and agencies in Illinois who are contributing leadership, expertise, and energy to this project:\n\n<div class=\"container-fluid\" id=\"process-links\">\n\n<div class=\"row\">\n\n<div class=\"col-12 col-md-6\">\n\n- [Administrative Office of Illinois Courts](http://illinoiscourts.gov/Administrative/Director.asp)\n\n- [Center for Child Trauma Assess and Service Planning at Northwestern University](http://cctasi.northwestern.edu/)\n\n- [Chapin Hall](http://www.chapinhall.org/)\n\n- [Chicago Beyond](https://www.chicagobeyond.org/)\n\n- [Chicago CRED](https://www.chicagocred.org/)\n\n- [Chicago Department of Public Health](https://www.cityofchicago.org/city/en/depts/cdph.html)\n\n- [Chicago Police Department](https://home.chicagopolice.org/)\n\n- [Chicago Public Schools](http://cps.edu/)\n\n- [Chicago Survivors](http://www.chicagosurvivors.org/)\n\n- [Child Advocacy Center of Illinois](http://www.childrensadvocacycentersofillinois.org/)\n\n- [Children’s Home and Aid](https://www.childrenshomeandaid.org/)\n\n- [Cook County Circuit Court Domestic Violence Division](http://www.cookcountycourt.org/ABOUTTHECOURT/CountyDepartment/DomesticViolence.aspx)\n\n- [Cook County Circuit Court Child Protection Division](http://www.cookcountyclerkofcourt.org/NewWebsite/Departments/Child-Protection-Division.aspx#)\n\n- [Cook County Juvenile Probation](http://www.cookcountycourt.org/ABOUTTHECOURT/OfficeoftheChiefJudge/ProbationDepartments/ProbationForJuveniles/ProgramsandServices.aspx)\n\n- [Cook County Public Defender](https://www.cookcountyil.gov/agency/public-defender-1)\n\n- [Cook County State’s Attorney’s Office](https://www.cookcountystatesattorney.org/)\n\n- [Division of Mental Health Illinois Department of Human Services](http://www.dhs.state.il.us/page.aspx?item=29735)\n\n- [Family Defense Center](http://www.familydefensecenter.net/)\n\n- [Health & Medicine Policy Research Group and ACES Collaborative](http://www.hmprg.org/Programs/IL+ACE+Response+Collaborative)\n\n- [Heartland Alliance](https://www.heartlandalliance.org/)\n\n- [Helping Hurt People-Chicago](http://healinghurtpeoplechicago.org/)\n\n- [Illinois Association of Chiefs of Police](http://www.ilchiefs.org/)\n\n- [Illinois Assocition for Court Appointed Special Advocates](https://www.illinoiscasa.org/)\n\n</div>\n\n<div class=\"col-12 col-md-6\">\n\n- [Illinois Childhood Trauma Coalition at Center for Childhood Resilience](https://childhoodresilience.org/advocacy/)\n\n- [Illinois Children’s Healthcare Foundation](https://ilchf.org/)\n\n- [Illinois Children’s Mental Health Partnership](http://icmhp.org/)\n\n- [Illinois Coalition Against Domestic Violence](http://www.ilcadv.org/)\n\n- [Illinois Coalition Against Sexual Assault](http://www.icasa.org/)\n\n- [Illinois Collaboration on Youth](http://www.icoyouth.org/)\n\n- [Illinois Department of Child and Family Services](https://www.illinois.gov/dcfs)\n\n- [Illinois Department of Health and Family Services](https://www.illinois.gov/hfs/)\n\n- [Illinois Department of Human Services](http://www.dhs.state.il.us/)\n\n- [Illinois Department of Juvenile Justice](https://www.illinois.gov/idjj)\n\n- [Illinois Department of Public Health](http://www.dph.illinois.gov)\n\n- [Illinois Justice Project](https://www.iljp.org/)\n\n- [Illinois Juvenile Justice Commission](http://ijjc.illinois.gov/)\n\n- [Illinois State Board of Education](https://www.isbe.net/)\n\n- [Institute on Public Safety and Social Justice](https://www.adler.edu/page/community-engagement/institute-on-public-safety-and-social-justice)\n\n- [Irving Harris Foundation](https://www.irvingharrisfdn.org/)\n\n- [Land of Lincoln Legal Services](http://lollaf.org/)\n\n- [Loyola University](https://www.luc.edu/)\n\n- [Office of the Attorney General](http://www.illinoisattorneygeneral.gov/)\n\n- [Office of Violence Prevention and Behavioral Health](https://www.cityofchicago.org/city/en/depts/cdph/provdrs/violence_prev.html)\n\n- [Project Oz](https://www.projectoz.org/about/)\n\n- [Strengthening Chicago’s Youth](http://www.scy-chicago.org/)\n\n- [University of Chicago](https://www.uchicago.edu/)\n\n</div>\n\n</div>\n\n</div>\n\n## National Partners\n\n### ICF\n\nICF partners with diverse clients to deliver research, programmatic support, technology services, and other assistance in a number of markets, including criminal justice. The ICF team has worked with the National Institute of Justice and the Office for Victims of Crime on other victim-centered research and has been involved in other studies of systems of care approaches. ICF is conducting a national study of this project to provide critical information back to the project partners and for future replication efforts. As part of the study, ICF will be working with the grantees and their partners to collect data about project activities and outcomes. Learn more about ICF at: www.icf.com.\n\n### The National Council of Juvenile and Family Court Judges\n\nThe National Council of Juvenile and Family Court Judges (NCJFCJ) aims to provide communities with knowledge and skills to improve the lives of families and children who seek justice. The NCJFCJ provides training and technical assistance which contributes to the development and implementation of national policy, standards, and procedures regarding children and families and upholding the rights of victims and all family members and the safety of the community. The NCJFCJ provides training and technical assistance to demonstration sites through tools, resources, balanced approaches, and data-driven strategies, to strengthen demonstration sites’ ability to identify, intervene, and provide coordinated and effective services to youth and child victims and to identify lessons learned and develop materials to support future replication. Learn more about the NCJFCJ at www.ncjfcj.org.\n\n### The National Institute of Justice\n\nThe National Institute of Justice (NIJ) is the research, development, and evaluation agency of the U.S. Department of Justice. NIJ is dedicated to improving knowledge and understanding of crime and justice issues through science. NIJ provides objective and independent knowledge and tools to reduce crime and promote justice, particularly at the state and local levels.\n\nNIJ is overseeing ICF, International in the conduct of the national study of this project. The national study is designed to provide critical information and data about project activities and outcomes in order to guide future replication efforts. This project falls under NIJ’s program of research on Children Exposed to Violence: http://nij.gov/topics/crime/children-exposed-to-violence/Pages/welcome.aspx. Learn more about NIJ at www.nij.gov.\n\n### Office for Victims of Crime\n\nThe Office for Victims of Crime (OVC) is committed to enhancing the Nation’s capacity to assist crime victims and to providing leadership in changing attitudes, policies, and practices to promote justice and healing for all victims of crime. OVC distributes federal program funds, offers trainings, supports national projects, and hosts programs to help raise awareness about victims’ rights and services to the public. Learn more about OVC at www.ovc.gov/about/index.html.\n\n### State Demonstration Sites\n\nFour states–including Illinois–are are designated as demonstration sites for this discretionary grant. The states are in two cohorts, grouped by the year of their awards. Receiving awards in 2017, Illinois and Ohio are part of the second cohort. The first cohort is comprised of Montana and Virginia, who received awards in 2015 and are implementing aspects of their respective plans.\n\n### Montana Board of Crime Control\n\nMontana Board of Crime Control (MBCC) is the designated state agency that administers millions of grant dollars dedicated to preventing and addressing crime statewide. MBCC is headed by an 18-member board appointed by the Governor and represents law enforcement, criminal and juvenile justice system stakeholders, and citizens, including the first Montanans, our state’s Native Americans. The mission of MBCC is to proactively contribute to public safety, crime prevention, and victim assistance through planning, policy development, and coordination of the justice system in partnership with citizens, government, and communities. Learn more about MBCC at mbcc.mt.gov.\n\n### The Ohio Attorney General’s Office\n\nThe Ohio Attorney General’s Office (OAG) consists of nearly 30 distinct sections that advocate for consumers and victims of violent crime, assist the criminal justice community, provide legal counsel for state offices and agencies, and enforce certain state laws. The Crime Victim Services Section, specifically, will be overseeing the work of this project and provides training, outreach, and funding (among other services) to first responders and other crime victim service providers throughout Ohio. The OAG offers services to protect all Ohioans, including children, families, consumers, the elderly, victims of violent crime, and veterans. Learn more about the OAG at http://www.ohioattorneygeneral.gov/.\n\n### Virginia Department of Social Services\n\nThe Virginia Department of Social Services (VDSS) is one of the largest agencies in the Commonwealth of Virginia. It partners with 120 local departments of social services, along with faith-based and nonprofit organizations, 1,650 (state) and 8,500 (local) human services professionals to promote the well-being of children and families statewide and ensure that thousands of Virginia’s most vulnerable citizens have access to the best services and benefits available to them. The agency’s mission is to help people shape strong futures for themselves, their families, and communities, through the delivery of essential services that help them triumph over poverty, abuse and neglect. Learn more about VDSS Linking Systems of Care project at: http://linkingsystemsofcarevirginia.com/.\n","title":"Process and Partners","menuTitle":"Process & Partners","createdAt":"2020-11-03","html":"<style>\n\nh2 {\n  margin-left: 10px;\n}\n\nh2 ~ p{\n  margin-left: 10px;\n}\n\nh3 {\n  margin-left: 15px;\n}\n\nh3 ~ p {\n    margin-left: 25px;\n}\na{font-weight: bold;}\n\n#process-links {\n  margin-left: 35px;\n}\n</style>\n<h2 id=\"guiding-principles\">Guiding Principles</h2>\n<p>Illinois HEALS incorporates the Guiding Principles articulated by the Office for Victims of Crime. These principles include:</p>\n<ul>\n<li>\n<p><strong>Healing Individuals, Families, and Communities</strong></p>\n<p>Individuals and families who experience or have been exposed to violence deserve support for healing. Healing includes safety, justice, the opportunity to make positive social-emotional connections, and self-determination. Opportunities for healing occur at all points of contact; healing interventions are accessible, trauma-informed, strength-based, individualized, and gender- and culturally responsive.</p>\n</li>\n<li>\n<p><strong>Linked Systems of Care</strong></p>\n<p>All systems of care are connected and aspire to maximize collective impact through communication, collaboration, and coordination.</p>\n</li>\n<li>\n<p><strong>Informed Decision Making</strong></p>\n<p>Linked Systems of Care provide as much information as possible to families and practitioners so that the most targeted, holistic, safe, and effective interventions are available.</p>\n</li>\n</ul>\n<h2 id=\"planning\">Planning</h2>\n<p>The strategic planning process—the first phase of the project—began shortly after the funds were awarded. On April 5th, 2018 the Illinois Criminal Justice Information Authority (ICJIA) convened a Leadership Network meeting of senior-level policy makers and subject matter experts in discussions to inform the planning process.</p>\n<p>Throughout the spring and summer of 2018, members of the Leadership Network, project staff, and other concerned leaders will document how children and youth victims are identified and their needs addressed. The project will initially explore six domains that represent frequent points of entry for children needing supportive services following an incident of victimization:</p>\n<p><graphic img-file=\"process-domain.png\" img-alt=\"Process Domain image\"></graphic></p>\n<p>Illinois HEALS also conducted a web-based survey from May 1st through June 8th, 2018 to learn about the scope of services available to victims of crime across the state. Analysis of the information will inform recommendations for enhancing the healing process for children, youth and families impacted by crime.</p>\n<p>Beginning in May 2018, the Center for Victim Studies at ICJIA will conduct a research project to better understand victims' experiences of harm and contact with providers. The research project received institutional review board (IRB) approval in April and the study will continue throughout the summer and fall. The goal is to identify the needs of child/youth victims and family members/caregivers of young victims. This study will also explore the capacity of systems of care to meet those needs from the perspectives of adults with childhood victimization histories and family members/caregivers of child victims. If you are interested in being a study participant, please complete the brief survey to see if you qualify: Young Victims Study survey</p>\n<p>Throughout the summer and fall of 2018, members of the Leadership Network and other stakeholders will review information that is collected and analyses that are conducted to produce an action plan for the state. The action plan, which will be complete in early 2019, will inform an OVC-supported implementation that will occur over the subsequent five years.</p>\n<p><graphic img-file=\"process-timeline.png\" img-alt=\"Process timeline image\"></graphic></p>\n<h2 id=\"action-plan\">Action Plan</h2>\n<p>Illinois HEALS will support community-driven pilot projects that incorporate the guiding principles and are committed to creating systems of care for children, youth, and their families who have experienced or been exposed to violence. Projects will vary based on community needs and resources, though each project will incorporate important aspects shown to improve outcomes for individuals, families, and communities.</p>\n<p><strong>Training and support</strong> for members of the community and professionals. Training includes information about the impact of violence on child and adolescent development and the way that trauma can impact adults. Everyone who interacts with youth in a professional capacity—from school and medical staff to faith leaders and police officers—is in a position to put training into practice and intervene with youth in a positive way.</p>\n<p><strong>Multi-Disciplinary Teams</strong> that coordinate services for the community and identify resources that may benefit children, youth, and their families. These groups use system of care principles to increase access to services. There is also a mechanism in place for service providers to work closely to provide comprehensive, holistic support to families with complex needs beyond what the system has the capacity to address.</p>\n<p><strong>Enhanced services</strong>. Most communities in Illinois have some strong service providers who are able to meet many needs in the communities. Many communities also have service gaps because there are insufficient resources to support more providers or retain quality workers. There are also barriers—like transportation issues, hours of operation, or wait lists—to access services that result in less engagement in support for children, youth, and families. Projects will identify ways to address gaps and barriers to increase services available to those impacted by violence.</p>\n<h2 id=\"illinois-stakeholders\">Illinois Stakeholders</h2>\n<h3 id=\"illinois-criminal-justice-information-authority\">Illinois Criminal Justice Information Authority</h3>\n<p>The Illinois Criminal Justice Information Authority (ICJIA) was formed in 1983 as a state agency committed to improving the administration of criminal justice. The ICJIA brings together leaders from the justice system and the public to assist in the identification of challenges or barriers that are present within the justice system in Illinois, in an effort to improve efficiency and outcomes for the public. The ICJIA works in several categories to improve aspects of the criminal justice system: Grants Administration, Research and Analysis, Policy and Planning, and Information Systems and Technology. The 25-member board, comprised of state and local officials, as well as members of the public, sets agency priorities, tracks progress of ongoing programs, and monitors the agency’s budget. Learn more about the ICJIA at <a href=\"http://www.icjia.state.il.us/\">http://www.icjia.state.il.us/</a>.</p>\n<h3 id=\"leadership-network\">Leadership Network</h3>\n<p>ICJIA is grateful to individuals from the following organizations and agencies in Illinois who are contributing leadership, expertise, and energy to this project:</p>\n<div class=\"container-fluid\" id=\"process-links\">\n<div class=\"row\">\n<div class=\"col-12 col-md-6\">\n<ul>\n<li>\n<p><a href=\"http://illinoiscourts.gov/Administrative/Director.asp\">Administrative Office of Illinois Courts</a></p>\n</li>\n<li>\n<p><a href=\"http://cctasi.northwestern.edu/\">Center for Child Trauma Assess and Service Planning at Northwestern University</a></p>\n</li>\n<li>\n<p><a href=\"http://www.chapinhall.org/\">Chapin Hall</a></p>\n</li>\n<li>\n<p><a href=\"https://www.chicagobeyond.org/\">Chicago Beyond</a></p>\n</li>\n<li>\n<p><a href=\"https://www.chicagocred.org/\">Chicago CRED</a></p>\n</li>\n<li>\n<p><a href=\"https://www.cityofchicago.org/city/en/depts/cdph.html\">Chicago Department of Public Health</a></p>\n</li>\n<li>\n<p><a href=\"https://home.chicagopolice.org/\">Chicago Police Department</a></p>\n</li>\n<li>\n<p><a href=\"http://cps.edu/\">Chicago Public Schools</a></p>\n</li>\n<li>\n<p><a href=\"http://www.chicagosurvivors.org/\">Chicago Survivors</a></p>\n</li>\n<li>\n<p><a href=\"http://www.childrensadvocacycentersofillinois.org/\">Child Advocacy Center of Illinois</a></p>\n</li>\n<li>\n<p><a href=\"https://www.childrenshomeandaid.org/\">Children’s Home and Aid</a></p>\n</li>\n<li>\n<p><a href=\"http://www.cookcountycourt.org/ABOUTTHECOURT/CountyDepartment/DomesticViolence.aspx\">Cook County Circuit Court Domestic Violence Division</a></p>\n</li>\n<li>\n<p><a href=\"http://www.cookcountyclerkofcourt.org/NewWebsite/Departments/Child-Protection-Division.aspx#\">Cook County Circuit Court Child Protection Division</a></p>\n</li>\n<li>\n<p><a href=\"http://www.cookcountycourt.org/ABOUTTHECOURT/OfficeoftheChiefJudge/ProbationDepartments/ProbationForJuveniles/ProgramsandServices.aspx\">Cook County Juvenile Probation</a></p>\n</li>\n<li>\n<p><a href=\"https://www.cookcountyil.gov/agency/public-defender-1\">Cook County Public Defender</a></p>\n</li>\n<li>\n<p><a href=\"https://www.cookcountystatesattorney.org/\">Cook County State’s Attorney’s Office</a></p>\n</li>\n<li>\n<p><a href=\"http://www.dhs.state.il.us/page.aspx?item=29735\">Division of Mental Health Illinois Department of Human Services</a></p>\n</li>\n<li>\n<p><a href=\"http://www.familydefensecenter.net/\">Family Defense Center</a></p>\n</li>\n<li>\n<p><a href=\"http://www.hmprg.org/Programs/IL+ACE+Response+Collaborative\">Health &amp; Medicine Policy Research Group and ACES Collaborative</a></p>\n</li>\n<li>\n<p><a href=\"https://www.heartlandalliance.org/\">Heartland Alliance</a></p>\n</li>\n<li>\n<p><a href=\"http://healinghurtpeoplechicago.org/\">Helping Hurt People-Chicago</a></p>\n</li>\n<li>\n<p><a href=\"http://www.ilchiefs.org/\">Illinois Association of Chiefs of Police</a></p>\n</li>\n<li>\n<p><a href=\"https://www.illinoiscasa.org/\">Illinois Assocition for Court Appointed Special Advocates</a></p>\n</li>\n</ul>\n</div>\n<div class=\"col-12 col-md-6\">\n<ul>\n<li>\n<p><a href=\"https://childhoodresilience.org/advocacy/\">Illinois Childhood Trauma Coalition at Center for Childhood Resilience</a></p>\n</li>\n<li>\n<p><a href=\"https://ilchf.org/\">Illinois Children’s Healthcare Foundation</a></p>\n</li>\n<li>\n<p><a href=\"http://icmhp.org/\">Illinois Children’s Mental Health Partnership</a></p>\n</li>\n<li>\n<p><a href=\"http://www.ilcadv.org/\">Illinois Coalition Against Domestic Violence</a></p>\n</li>\n<li>\n<p><a href=\"http://www.icasa.org/\">Illinois Coalition Against Sexual Assault</a></p>\n</li>\n<li>\n<p><a href=\"http://www.icoyouth.org/\">Illinois Collaboration on Youth</a></p>\n</li>\n<li>\n<p><a href=\"https://www.illinois.gov/dcfs\">Illinois Department of Child and Family Services</a></p>\n</li>\n<li>\n<p><a href=\"https://www.illinois.gov/hfs/\">Illinois Department of Health and Family Services</a></p>\n</li>\n<li>\n<p><a href=\"http://www.dhs.state.il.us/\">Illinois Department of Human Services</a></p>\n</li>\n<li>\n<p><a href=\"https://www.illinois.gov/idjj\">Illinois Department of Juvenile Justice</a></p>\n</li>\n<li>\n<p><a href=\"http://www.dph.illinois.gov\">Illinois Department of Public Health</a></p>\n</li>\n<li>\n<p><a href=\"https://www.iljp.org/\">Illinois Justice Project</a></p>\n</li>\n<li>\n<p><a href=\"http://ijjc.illinois.gov/\">Illinois Juvenile Justice Commission</a></p>\n</li>\n<li>\n<p><a href=\"https://www.isbe.net/\">Illinois State Board of Education</a></p>\n</li>\n<li>\n<p><a href=\"https://www.adler.edu/page/community-engagement/institute-on-public-safety-and-social-justice\">Institute on Public Safety and Social Justice</a></p>\n</li>\n<li>\n<p><a href=\"https://www.irvingharrisfdn.org/\">Irving Harris Foundation</a></p>\n</li>\n<li>\n<p><a href=\"http://lollaf.org/\">Land of Lincoln Legal Services</a></p>\n</li>\n<li>\n<p><a href=\"https://www.luc.edu/\">Loyola University</a></p>\n</li>\n<li>\n<p><a href=\"http://www.illinoisattorneygeneral.gov/\">Office of the Attorney General</a></p>\n</li>\n<li>\n<p><a href=\"https://www.cityofchicago.org/city/en/depts/cdph/provdrs/violence_prev.html\">Office of Violence Prevention and Behavioral Health</a></p>\n</li>\n<li>\n<p><a href=\"https://www.projectoz.org/about/\">Project Oz</a></p>\n</li>\n<li>\n<p><a href=\"http://www.scy-chicago.org/\">Strengthening Chicago’s Youth</a></p>\n</li>\n<li>\n<p><a href=\"https://www.uchicago.edu/\">University of Chicago</a></p>\n</li>\n</ul>\n</div>\n</div>\n</div>\n<h2 id=\"national-partners\">National Partners</h2>\n<h3 id=\"icf\">ICF</h3>\n<p>ICF partners with diverse clients to deliver research, programmatic support, technology services, and other assistance in a number of markets, including criminal justice. The ICF team has worked with the National Institute of Justice and the Office for Victims of Crime on other victim-centered research and has been involved in other studies of systems of care approaches. ICF is conducting a national study of this project to provide critical information back to the project partners and for future replication efforts. As part of the study, ICF will be working with the grantees and their partners to collect data about project activities and outcomes. Learn more about ICF at: <a href=\"http://www.icf.com\">www.icf.com</a>.</p>\n<h3 id=\"the-national-council-of-juvenile-and-family-court-judges\">The National Council of Juvenile and Family Court Judges</h3>\n<p>The National Council of Juvenile and Family Court Judges (NCJFCJ) aims to provide communities with knowledge and skills to improve the lives of families and children who seek justice. The NCJFCJ provides training and technical assistance which contributes to the development and implementation of national policy, standards, and procedures regarding children and families and upholding the rights of victims and all family members and the safety of the community. The NCJFCJ provides training and technical assistance to demonstration sites through tools, resources, balanced approaches, and data-driven strategies, to strengthen demonstration sites’ ability to identify, intervene, and provide coordinated and effective services to youth and child victims and to identify lessons learned and develop materials to support future replication. Learn more about the NCJFCJ at <a href=\"http://www.ncjfcj.org\">www.ncjfcj.org</a>.</p>\n<h3 id=\"the-national-institute-of-justice\">The National Institute of Justice</h3>\n<p>The National Institute of Justice (NIJ) is the research, development, and evaluation agency of the U.S. Department of Justice. NIJ is dedicated to improving knowledge and understanding of crime and justice issues through science. NIJ provides objective and independent knowledge and tools to reduce crime and promote justice, particularly at the state and local levels.</p>\n<p>NIJ is overseeing ICF, International in the conduct of the national study of this project. The national study is designed to provide critical information and data about project activities and outcomes in order to guide future replication efforts. This project falls under NIJ’s program of research on Children Exposed to Violence: <a href=\"http://nij.gov/topics/crime/children-exposed-to-violence/Pages/welcome.aspx\">http://nij.gov/topics/crime/children-exposed-to-violence/Pages/welcome.aspx</a>. Learn more about NIJ at <a href=\"http://www.nij.gov\">www.nij.gov</a>.</p>\n<h3 id=\"office-for-victims-of-crime\">Office for Victims of Crime</h3>\n<p>The Office for Victims of Crime (OVC) is committed to enhancing the Nation’s capacity to assist crime victims and to providing leadership in changing attitudes, policies, and practices to promote justice and healing for all victims of crime. OVC distributes federal program funds, offers trainings, supports national projects, and hosts programs to help raise awareness about victims’ rights and services to the public. Learn more about OVC at <a href=\"http://www.ovc.gov/about/index.html\">www.ovc.gov/about/index.html</a>.</p>\n<h3 id=\"state-demonstration-sites\">State Demonstration Sites</h3>\n<p>Four states–including Illinois–are are designated as demonstration sites for this discretionary grant. The states are in two cohorts, grouped by the year of their awards. Receiving awards in 2017, Illinois and Ohio are part of the second cohort. The first cohort is comprised of Montana and Virginia, who received awards in 2015 and are implementing aspects of their respective plans.</p>\n<h3 id=\"montana-board-of-crime-control\">Montana Board of Crime Control</h3>\n<p>Montana Board of Crime Control (MBCC) is the designated state agency that administers millions of grant dollars dedicated to preventing and addressing crime statewide. MBCC is headed by an 18-member board appointed by the Governor and represents law enforcement, criminal and juvenile justice system stakeholders, and citizens, including the first Montanans, our state’s Native Americans. The mission of MBCC is to proactively contribute to public safety, crime prevention, and victim assistance through planning, policy development, and coordination of the justice system in partnership with citizens, government, and communities. Learn more about MBCC at <a href=\"http://mbcc.mt.gov\">mbcc.mt.gov</a>.</p>\n<h3 id=\"the-ohio-attorney-generals-office\">The Ohio Attorney General’s Office</h3>\n<p>The Ohio Attorney General’s Office (OAG) consists of nearly 30 distinct sections that advocate for consumers and victims of violent crime, assist the criminal justice community, provide legal counsel for state offices and agencies, and enforce certain state laws. The Crime Victim Services Section, specifically, will be overseeing the work of this project and provides training, outreach, and funding (among other services) to first responders and other crime victim service providers throughout Ohio. The OAG offers services to protect all Ohioans, including children, families, consumers, the elderly, victims of violent crime, and veterans. Learn more about the OAG at <a href=\"http://www.ohioattorneygeneral.gov/\">http://www.ohioattorneygeneral.gov/</a>.</p>\n<h3 id=\"virginia-department-of-social-services\">Virginia Department of Social Services</h3>\n<p>The Virginia Department of Social Services (VDSS) is one of the largest agencies in the Commonwealth of Virginia. It partners with 120 local departments of social services, along with faith-based and nonprofit organizations, 1,650 (state) and 8,500 (local) human services professionals to promote the well-being of children and families statewide and ensure that thousands of Virginia’s most vulnerable citizens have access to the best services and benefits available to them. The agency’s mission is to help people shape strong futures for themselves, their families, and communities, through the delivery of essential services that help them triumph over poverty, abuse and neglect. Learn more about VDSS Linking Systems of Care project at: <a href=\"http://linkingsystemsofcarevirginia.com/\">http://linkingsystemsofcarevirginia.com/</a>.</p>\n","toc":[{"content":"Guiding Principles","slug":"guiding-principles","lvl":2,"i":0,"seen":0},{"content":"Planning","slug":"planning","lvl":2,"i":1,"seen":0},{"content":"Action Plan","slug":"action-plan","lvl":2,"i":2,"seen":0},{"content":"Illinois Stakeholders","slug":"illinois-stakeholders","lvl":2,"i":3,"seen":0},{"content":"Illinois Criminal Justice Information Authority","slug":"illinois-criminal-justice-information-authority","lvl":3,"i":4,"seen":0},{"content":"Leadership Network","slug":"leadership-network","lvl":3,"i":5,"seen":0},{"content":"National Partners","slug":"national-partners","lvl":2,"i":6,"seen":0},{"content":"ICF","slug":"icf","lvl":3,"i":7,"seen":0},{"content":"The National Council of Juvenile and Family Court Judges","slug":"the-national-council-of-juvenile-and-family-court-judges","lvl":3,"i":8,"seen":0},{"content":"The National Institute of Justice","slug":"the-national-institute-of-justice","lvl":3,"i":9,"seen":0},{"content":"Office for Victims of Crime","slug":"office-for-victims-of-crime","lvl":3,"i":10,"seen":0},{"content":"State Demonstration Sites","slug":"state-demonstration-sites","lvl":3,"i":11,"seen":0},{"content":"Montana Board of Crime Control","slug":"montana-board-of-crime-control","lvl":3,"i":12,"seen":0},{"content":"The Ohio Attorney General’s Office","slug":"the-ohio-attorney-generals-office","lvl":3,"i":13,"seen":0},{"content":"Virginia Department of Social Services","slug":"virginia-department-of-social-services","lvl":3,"i":14,"seen":0}],"description":"Helping Everyone Access Linked Systems (Illinois HEALS) is multi-year initiative to address child and youth victimization.","url":"https://ilheals.com/process-and-partners/"},{"route":"/publications/icjia-publications/","markdown":"\n<style>\n\nh2 {\n  margin-left: 10px;\n  margin-top: 40px !important;\n  \n}\nh2 + p {\n  margin-left: 25px;\n}\n\n\na{font-weight: bold; font-size: 16px;}\n</style>\n\nThe Illinois Criminal Justice Information Authority is the home of Illinois’ Statistical Analysis Center, which is responsible for objectively collecting, analyzing, and disseminating justice data. The Center for Victim Studies, a part of ICJIA’s Research & Analysis Unit, designs and conducts research examining the nature and scope of victimization in Illinois and evaluates programs that address victim needs. These are recent publications that are relevant to the Illinois HEALS demonstration project.\n\n## Provider-Reported Challenges & Opportunities in Supporting Young Victims of Crime: Findings from Illinois HEALS\n\nIllinois HEALS researchers analyzed documents and artifacts from a series of 29 meetings for the Illinois HEALS initiative with representatives from several service domains. Findings suggest that providers throughout the state are facing challenges in recognizing victimization experiences of children and youth, connecting young persons to appropriate and accessible resources, and engaging them in meaningful services. This article presents recommendations that explore strategies to build capacity in recognizing signs of victimization, broadening screening and assessment practices, support the well-being of staff, and fostering collaborations. [View article&nbsp&raquo;](https://icjia.illinois.gov/researchhub/articles/provider-reported-challenges-and-opportunities-in-supporting-young-victims-of-crime)\n\n## How Illinois Service Providers Support Young Victims of Crime: Findings from an Illinois HEALS Survey\n\nIllinois HEALS research staff analyzed survey data from 184 unique agencies serving children, youth, and families impacted by violence in Illinois. Survey findings point to recommendations for how agencies can improve their response to young victims and families through increased harm recognition, service connections, and service engagement. [View article&nbsp&raquo;](https://icjia.illinois.gov/researchhub/articles/how-illinois-service-providers-support-young-victims-of-crime-findings-from-an-illinois-heals-survey)\n\n## Webinar: Victim Informed Strategies for Responding to Young Victims and Families\n\nAs part of a 15-month planning process, Illinois HEALS researchers interviewed young adults and caregivers of children and youth impacted by violence to better understand their experiences with service providers and their recommendations for improving responses to facilitate healing. Presenters provide an overview of critical activities during the planning phase, interview findings, and the action plan, all of which can inform researchers and practitioners seeking to develop similar partnerships and those working to strengthen their response to young victims and their families. [Watch webinar&nbsp&raquo;](https://www.youtube.com/watch?v=O87SVzBFbk8)\n\n<div class=\"text-center mt-5 mb-5 embed\" >\n   <div class=\"videoWrapper\">\n           <iframe height=\"315\" width=\"560\" src=\"https://www.youtube.com/embed/O87SVzBFbk8\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen>\n           </iframe>\n   </div>\n</div>\n\n\n## Victim Service Delivery: Illinois Providers’ Perspectives on Victim Service Barriers and Agency Capacity\\*\n\n[Download PDF&nbsp&raquo;](https://archive.icjia-api.cloud/files/icjia/researchhub/Illinois_Victim_Service_Delivery_Capacity_020618-191011T20093509.pdf)\n\n## Ad Hoc Victim Services Committee Research Report\\*\n\n[Download PDF&nbsp&raquo;](https://archive.icjia-api.cloud/files/icjia/articles/ICJIA_FINAL_AdHocReport_VictimServices_012717.pdf)\n\n## 2016 Victim Needs Assessment\\*\n\n[Download PDF&nbsp&raquo;](https://archive.icjia-api.cloud/files/icjia/articles/2016_ICJIA_Victim_Needs_Assessment_Summary_Report.pdf)\n\n## Child and Youth Exposure to Violence in Illinois\n\nA large number of children and youth in the United States experience multiple forms of violence in their homes, schools, and community. These experiences can impact a child’s personality development, mental health, academic success, and interpersonal relationships. This article presents data on the prevalence of childhood victimization and exposure to violence in Illinois. Also discussed are the impacts of those experiences and their implications for policy and practice. [View article&nbsp&raquo;](https://icjia.illinois.gov/researchhub/articles/child-and-youth-exposure-to-violence-in-illinois)\n\n## Illinois Helping Everyone Access Linked Systems Action Plan\n\nThe Illinois HEALS Action Plan will guide the future work of the project to implement policies, practices, and programs that strengthen the capacity of Illinois’ communities to recognize when victimization has occurred, connect young victims and their families with resources, and engage them in needed services. [View article&nbsp&raquo;](https://icjia.illinois.gov/researchhub/articles/illinois-helping-everyone-access-linked-systems-action-plan)\n\n\\* These publications and the research discussed in them were not funded under Illinois HEALS.\n","title":"ICJIA Publications","html":"<style>\n\nh2 {\n  margin-left: 10px;\n  margin-top: 40px !important;\n  \n}\nh2 + p {\n  margin-left: 25px;\n}\n\n\na{font-weight: bold; font-size: 16px;}\n</style>\n<p>The Illinois Criminal Justice Information Authority is the home of Illinois’ Statistical Analysis Center, which is responsible for objectively collecting, analyzing, and disseminating justice data. The Center for Victim Studies, a part of ICJIA’s Research &amp; Analysis Unit, designs and conducts research examining the nature and scope of victimization in Illinois and evaluates programs that address victim needs. These are recent publications that are relevant to the Illinois HEALS demonstration project.</p>\n<h2 id=\"provider-reported-challenges-opportunities-in-supporting-young-victims-of-crime-findings-from-illinois-heals\">Provider-Reported Challenges &amp; Opportunities in Supporting Young Victims of Crime: Findings from Illinois HEALS</h2>\n<p>Illinois HEALS researchers analyzed documents and artifacts from a series of 29 meetings for the Illinois HEALS initiative with representatives from several service domains. Findings suggest that providers throughout the state are facing challenges in recognizing victimization experiences of children and youth, connecting young persons to appropriate and accessible resources, and engaging them in meaningful services. This article presents recommendations that explore strategies to build capacity in recognizing signs of victimization, broadening screening and assessment practices, support the well-being of staff, and fostering collaborations. <a href=\"https://icjia.illinois.gov/researchhub/articles/provider-reported-challenges-and-opportunities-in-supporting-young-victims-of-crime\">View article&amp;nbsp»</a></p>\n<h2 id=\"how-illinois-service-providers-support-young-victims-of-crime-findings-from-an-illinois-heals-survey\">How Illinois Service Providers Support Young Victims of Crime: Findings from an Illinois HEALS Survey</h2>\n<p>Illinois HEALS research staff analyzed survey data from 184 unique agencies serving children, youth, and families impacted by violence in Illinois. Survey findings point to recommendations for how agencies can improve their response to young victims and families through increased harm recognition, service connections, and service engagement. <a href=\"https://icjia.illinois.gov/researchhub/articles/how-illinois-service-providers-support-young-victims-of-crime-findings-from-an-illinois-heals-survey\">View article&amp;nbsp»</a></p>\n<h2 id=\"webinar-victim-informed-strategies-for-responding-to-young-victims-and-families\">Webinar: Victim Informed Strategies for Responding to Young Victims and Families</h2>\n<p>As part of a 15-month planning process, Illinois HEALS researchers interviewed young adults and caregivers of children and youth impacted by violence to better understand their experiences with service providers and their recommendations for improving responses to facilitate healing. Presenters provide an overview of critical activities during the planning phase, interview findings, and the action plan, all of which can inform researchers and practitioners seeking to develop similar partnerships and those working to strengthen their response to young victims and their families. <a href=\"https://www.youtube.com/watch?v=O87SVzBFbk8\">Watch webinar&amp;nbsp»</a></p>\n<div class=\"text-center mt-5 mb-5 embed\" >\n   <div class=\"videoWrapper\">\n           <iframe height=\"315\" width=\"560\" src=\"https://www.youtube.com/embed/O87SVzBFbk8\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen>\n           </iframe>\n   </div>\n</div>\n<h2 id=\"victim-service-delivery-illinois-providers-perspectives-on-victim-service-barriers-and-agency-capacity\">Victim Service Delivery: Illinois Providers’ Perspectives on Victim Service Barriers and Agency Capacity*</h2>\n<p><a href=\"https://archive.icjia-api.cloud/files/icjia/researchhub/Illinois_Victim_Service_Delivery_Capacity_020618-191011T20093509.pdf\">Download PDF&amp;nbsp»</a></p>\n<h2 id=\"ad-hoc-victim-services-committee-research-report\">Ad Hoc Victim Services Committee Research Report*</h2>\n<p><a href=\"https://archive.icjia-api.cloud/files/icjia/articles/ICJIA_FINAL_AdHocReport_VictimServices_012717.pdf\">Download PDF&amp;nbsp»</a></p>\n<h2 id=\"2016-victim-needs-assessment\">2016 Victim Needs Assessment*</h2>\n<p><a href=\"https://archive.icjia-api.cloud/files/icjia/articles/2016_ICJIA_Victim_Needs_Assessment_Summary_Report.pdf\">Download PDF&amp;nbsp»</a></p>\n<h2 id=\"child-and-youth-exposure-to-violence-in-illinois\">Child and Youth Exposure to Violence in Illinois</h2>\n<p>A large number of children and youth in the United States experience multiple forms of violence in their homes, schools, and community. These experiences can impact a child’s personality development, mental health, academic success, and interpersonal relationships. This article presents data on the prevalence of childhood victimization and exposure to violence in Illinois. Also discussed are the impacts of those experiences and their implications for policy and practice. <a href=\"https://icjia.illinois.gov/researchhub/articles/child-and-youth-exposure-to-violence-in-illinois\">View article&amp;nbsp»</a></p>\n<h2 id=\"illinois-helping-everyone-access-linked-systems-action-plan\">Illinois Helping Everyone Access Linked Systems Action Plan</h2>\n<p>The Illinois HEALS Action Plan will guide the future work of the project to implement policies, practices, and programs that strengthen the capacity of Illinois’ communities to recognize when victimization has occurred, connect young victims and their families with resources, and engage them in needed services. <a href=\"https://icjia.illinois.gov/researchhub/articles/illinois-helping-everyone-access-linked-systems-action-plan\">View article&amp;nbsp»</a></p>\n<p>* These publications and the research discussed in them were not funded under Illinois HEALS.</p>\n","toc":[{"content":"Provider-Reported Challenges & Opportunities in Supporting Young Victims of Crime: Findings from Illinois HEALS","slug":"provider-reported-challenges--opportunities-in-supporting-young-victims-of-crime-findings-from-illinois-heals","lvl":2,"i":0,"seen":0},{"content":"How Illinois Service Providers Support Young Victims of Crime: Findings from an Illinois HEALS Survey","slug":"how-illinois-service-providers-support-young-victims-of-crime-findings-from-an-illinois-heals-survey","lvl":2,"i":1,"seen":0},{"content":"Webinar: Victim Informed Strategies for Responding to Young Victims and Families","slug":"webinar-victim-informed-strategies-for-responding-to-young-victims-and-families","lvl":2,"i":2,"seen":0},{"content":"Victim Service Delivery: Illinois Providers’ Perspectives on Victim Service Barriers and Agency Capacity\\*","slug":"victim-service-delivery-illinois-providers-perspectives-on-victim-service-barriers-and-agency-capacity","lvl":2,"i":3,"seen":0},{"content":"Ad Hoc Victim Services Committee Research Report\\*","slug":"ad-hoc-victim-services-committee-research-report","lvl":2,"i":4,"seen":0},{"content":"2016 Victim Needs Assessment\\*","slug":"2016-victim-needs-assessment","lvl":2,"i":5,"seen":0},{"content":"Child and Youth Exposure to Violence in Illinois","slug":"child-and-youth-exposure-to-violence-in-illinois","lvl":2,"i":6,"seen":0},{"content":"Illinois Helping Everyone Access Linked Systems Action Plan","slug":"illinois-helping-everyone-access-linked-systems-action-plan","lvl":2,"i":7,"seen":0}],"description":"The Illinois Criminal Justice Information Authority is the home of Illinois’ Statistical Analysis Center, which is responsible for objectively collecting, analyzing, and disseminating justice data. The Center for Victim Studies, a part of ICJIA’s Research & Analysis Unit, designs and conducts research examining the nature and scope of victimization in Illinois and evaluates programs that address victim needs. These are recent publications that are relevant to the Illinois HEALS demonstration project.","url":"https://ilheals.com/publications/icjia-publications/"},{"route":"/publications/issue-01-heals-connect/","markdown":"\nWelcome to the Illinois HEALS CONNECT Newsletter! The issue features an overview of the Illinois HEALS program, an innovative approach to service delivery, and a program demonstration project update.\n\n## ILLINOIS HEALS OVERVIEW\n\nIllinois Helping Everyone Access Linked Systems (Illinois HEALS) is a six-year [Illinois Criminal Justice Information Authority](https://icjia.illinois.gov) initiative supported by the U.S. Office for Victims of Crime bringing together experts, service providers, community groups, young people and their families, and other stakeholders to implement strategies to identify children, youth, and families impacted by violence in Illinois and connect and engage them with services to facilitate healing.\n\n[Illinois HEALS](/) strives to alleviate the burden of finding services to address victimization by ensuring appropriate care and services are made available to all victims no matter whose door they first enter, whether it is their doctor's office, their school, or the local police station or sheriff's office.\n\n## PROGRAM GOALS\n\nThe project will meet the following goals that, together, address the needs of child and youth victims and their families:\n\n- Build a local System of Care (SOC) that meets the needs of individuals, families, and communities by convening local coordinating bodies, securing appropriate funding, and developing policies and practices that further the work.\n\n- Strengthen the abilities of systems within the community to recognize child and youth victims by fostering community awareness and encouraging appropriate screening practices.\n\n- Shore up how systems and the community at large connect young victims and their families to appropriate resources and services through a multidisciplinary team that supports care coordination and facilitates effective referral processes.\n\n- Promote practices that engage young persons who have experienced victimization and their family members in an array of services that are culturally specific and humble, accessible, and relevant by developing the professional workforce and enhancing service capacity and quality.\n\n- Establish a feedback loop between Illinois HEALS staff and SOC and multidisciplinary team members through research activities that explore community needs, inform best-practices, monitor progress and processes, and assess the fidelity of project implementation.\n\n- Improve the statewide response to victimization of children and youth by raising awareness of the impact of victimization and influencing the policies and practices of agencies and organizations that work with children, youth, and their families.\n\n## WHAT IS A SYSTEM OF CARE?\n\nA System of Care (SOC) offers a unique framework that connects youth and their families, patient advocates, and child-serving agencies at the local and state levels into a single coordinated system. SOCs coordinate care for children and youth who are involved in multiple systems and provide them with a broad array of services and supports. This coordination reduces the burden on the family, ensures non-duplication of services and facilitates engagement in services.\n\nThe U.S. Substance Abuse and Mental Health Services Administration supports development of SOCs that focus on a variety of mental health and substance abuse issues.\\* System of Care guiding principles include:\\*\\*\n\n- Youth-guided and family-driven.\n\n- Home and community-based.\n\n- Strengths-based and individualized\n\n- Culturally and linguistically competent.\n\n- Coordinated across systems and services.\n\n- Connected to a natural helping network\n\n- Data-driven and outcome-oriented.\n\nThe proven Systems of Care model has been replicated around the county at:\n\n- [New Jersey Children's System of Care](http://www.performcarenj.org/index.aspx)\n\n- [Wraparound Milwaukee](http://wraparoundmke.com/)\n\n- [MassHealth's Children's Behavioral Health Initiative](https://www.mass.gov/service-details/learn-about-cbhi)\n\n## ILLINOIS HEALS DEMONSTRATION SITE\n\nIllinois HEALS Action Plan implementation will be tested and documented in a demonstration site. Criteria include, but are not limited to, high levels of victimization; ability to convene and maintain engagement of a broad array of community stakeholders, practitioners and survivors; experience implementing large community-wide planning processes; and experience managing grant funds.\n\nThe first Illinois HEALS demonstration site, housed within [Egyptian Public & Mental Health Department (EHD)](https://egyptian.org/) in Eldorado, will serve Franklin, Gallatin, Saline, White, and Williamson counties. EHD offers Project Connect 2.0, an existing SOC serving children with serious emotional disturbances. The demonstration project will expand services to children, youth, and families who have experienced violence and broaden the program's current service area, enhancing and linking systems of care. EHD's SOC is a national model of coordinated care reflecting the Illinois HEALS guiding principles.\n\nICJIA and Illinois HEALS staff will provide the technical assistance and research support necessary to achieve the project goals and document lessons learned throughout the process. ICJIA and Illinois HEALS staff will gather information on the SOC model and develop a competitive solicitation to bring SoCs to other Illinois communities.\n\n_Register for the ICJIA's e-mail list, [CJ Dispatch](https://visitor.r20.constantcontact.com/manage/optin?v=001MqUcqqvjwLCJXlLMSWbTe3zHHmEQgFeBuHvBcJWTbwgrxFbDSGx4HSUPpI6DJWMUPgbljtLxffqIcGFTgCnr-auak88ybvRxpoJlTMGPtZs%3D), to receive all ICJIA notices of funding opportunity._\n\n## UPCOMING WEBINAR\n\nThe [Office for Victims of Crime Center for Victim Research](https://victimresearch.org/) will host a webinar, \"[Intimate Partner Violence Experienced by Lesbian, Gay, and Bisexual Individuals: A Look at National Data,](https://mailchi.mp/ncvc/cvr-webinar-showcase-799873?e=39af4785c7)\" Tuesday, April 30, from 3:00 p.m. to 4:00 p.m. CST.\n\n## OTHER MATERIALS OF INTEREST\n\nThe Ohio Domestic Violence Network created a trauma-informed, self-support guide for domestic violence victims entitled [Just Breathe](https://www.odvn.org/resource-center/). This collection of wellness and recovery resources was developed with the help of survivors in five domestic violence programs across Ohio, advocates and staff from the Ohio Domestic Violence Network, researchers from The Ohio State University, and funding from The Office for Victims of Crime.\n\n[Moving from the Mainstream to the Margins: Lessons in Culture and Power](https://www.researchgate.net/publication/327355473_Moving_from_the_Mainstream_to_the_Margins_Lessons_in_Culture_and_Power), by Ruby White Staff, provides a great overview of ways in which dominate systems and its players can reflect on past practices and commit to racial equity.\n\nThis article, [When Students Are Traumatized, Teachers Are Too](https://www.edutopia.org/article/when-students-are-traumatized-teachers-are-too), provides an overview on vicarious trauma and its impact on teachers and some simple steps to address it.\n\nThe Healing Justice Alliance brief entitled, [Best Practices For Supporting Front Line Intervention Workers](https://static1.squarespace.com/static/566b074fbfe87338d2021874/t/5c6c81599b747a015fb5e9d8/1550614981426/Brief_Three_HJA_V3.pdf), summarizes self-care, training, and support needs for staff working with victims of community violence.\n\nTo subscribe to this newsletter, send an email with the word SUBSCRIBE in the Subject line to:  \nLeslie.Cortez@Illinois.gov\n","title":"Illinois HEALS CONNECT: Issue 1","html":"<p>Welcome to the Illinois HEALS CONNECT Newsletter! The issue features an overview of the Illinois HEALS program, an innovative approach to service delivery, and a program demonstration project update.</p>\n<h2 id=\"illinois-heals-overview\">ILLINOIS HEALS OVERVIEW</h2>\n<p>Illinois Helping Everyone Access Linked Systems (Illinois HEALS) is a six-year <a href=\"https://icjia.illinois.gov\">Illinois Criminal Justice Information Authority</a> initiative supported by the U.S. Office for Victims of Crime bringing together experts, service providers, community groups, young people and their families, and other stakeholders to implement strategies to identify children, youth, and families impacted by violence in Illinois and connect and engage them with services to facilitate healing.</p>\n<p><a href=\"/\">Illinois HEALS</a> strives to alleviate the burden of finding services to address victimization by ensuring appropriate care and services are made available to all victims no matter whose door they first enter, whether it is their doctor's office, their school, or the local police station or sheriff's office.</p>\n<h2 id=\"program-goals\">PROGRAM GOALS</h2>\n<p>The project will meet the following goals that, together, address the needs of child and youth victims and their families:</p>\n<ul>\n<li>\n<p>Build a local System of Care (SOC) that meets the needs of individuals, families, and communities by convening local coordinating bodies, securing appropriate funding, and developing policies and practices that further the work.</p>\n</li>\n<li>\n<p>Strengthen the abilities of systems within the community to recognize child and youth victims by fostering community awareness and encouraging appropriate screening practices.</p>\n</li>\n<li>\n<p>Shore up how systems and the community at large connect young victims and their families to appropriate resources and services through a multidisciplinary team that supports care coordination and facilitates effective referral processes.</p>\n</li>\n<li>\n<p>Promote practices that engage young persons who have experienced victimization and their family members in an array of services that are culturally specific and humble, accessible, and relevant by developing the professional workforce and enhancing service capacity and quality.</p>\n</li>\n<li>\n<p>Establish a feedback loop between Illinois HEALS staff and SOC and multidisciplinary team members through research activities that explore community needs, inform best-practices, monitor progress and processes, and assess the fidelity of project implementation.</p>\n</li>\n<li>\n<p>Improve the statewide response to victimization of children and youth by raising awareness of the impact of victimization and influencing the policies and practices of agencies and organizations that work with children, youth, and their families.</p>\n</li>\n</ul>\n<h2 id=\"what-is-a-system-of-care\">WHAT IS A SYSTEM OF CARE?</h2>\n<p>A System of Care (SOC) offers a unique framework that connects youth and their families, patient advocates, and child-serving agencies at the local and state levels into a single coordinated system. SOCs coordinate care for children and youth who are involved in multiple systems and provide them with a broad array of services and supports. This coordination reduces the burden on the family, ensures non-duplication of services and facilitates engagement in services.</p>\n<p>The U.S. Substance Abuse and Mental Health Services Administration supports development of SOCs that focus on a variety of mental health and substance abuse issues.* System of Care guiding principles include:**</p>\n<ul>\n<li>\n<p>Youth-guided and family-driven.</p>\n</li>\n<li>\n<p>Home and community-based.</p>\n</li>\n<li>\n<p>Strengths-based and individualized</p>\n</li>\n<li>\n<p>Culturally and linguistically competent.</p>\n</li>\n<li>\n<p>Coordinated across systems and services.</p>\n</li>\n<li>\n<p>Connected to a natural helping network</p>\n</li>\n<li>\n<p>Data-driven and outcome-oriented.</p>\n</li>\n</ul>\n<p>The proven Systems of Care model has been replicated around the county at:</p>\n<ul>\n<li>\n<p><a href=\"http://www.performcarenj.org/index.aspx\">New Jersey Children's System of Care</a></p>\n</li>\n<li>\n<p><a href=\"http://wraparoundmke.com/\">Wraparound Milwaukee</a></p>\n</li>\n<li>\n<p><a href=\"https://www.mass.gov/service-details/learn-about-cbhi\">MassHealth's Children's Behavioral Health Initiative</a></p>\n</li>\n</ul>\n<h2 id=\"illinois-heals-demonstration-site\">ILLINOIS HEALS DEMONSTRATION SITE</h2>\n<p>Illinois HEALS Action Plan implementation will be tested and documented in a demonstration site. Criteria include, but are not limited to, high levels of victimization; ability to convene and maintain engagement of a broad array of community stakeholders, practitioners and survivors; experience implementing large community-wide planning processes; and experience managing grant funds.</p>\n<p>The first Illinois HEALS demonstration site, housed within <a href=\"https://egyptian.org/\">Egyptian Public &amp; Mental Health Department (EHD)</a> in Eldorado, will serve Franklin, Gallatin, Saline, White, and Williamson counties. EHD offers Project Connect 2.0, an existing SOC serving children with serious emotional disturbances. The demonstration project will expand services to children, youth, and families who have experienced violence and broaden the program's current service area, enhancing and linking systems of care. EHD's SOC is a national model of coordinated care reflecting the Illinois HEALS guiding principles.</p>\n<p>ICJIA and Illinois HEALS staff will provide the technical assistance and research support necessary to achieve the project goals and document lessons learned throughout the process. ICJIA and Illinois HEALS staff will gather information on the SOC model and develop a competitive solicitation to bring SoCs to other Illinois communities.</p>\n<p><em>Register for the ICJIA's e-mail list, <a href=\"https://visitor.r20.constantcontact.com/manage/optin?v=001MqUcqqvjwLCJXlLMSWbTe3zHHmEQgFeBuHvBcJWTbwgrxFbDSGx4HSUPpI6DJWMUPgbljtLxffqIcGFTgCnr-auak88ybvRxpoJlTMGPtZs%3D\">CJ Dispatch</a>, to receive all ICJIA notices of funding opportunity.</em></p>\n<h2 id=\"upcoming-webinar\">UPCOMING WEBINAR</h2>\n<p>The <a href=\"https://victimresearch.org/\">Office for Victims of Crime Center for Victim Research</a> will host a webinar, &quot;<a href=\"https://mailchi.mp/ncvc/cvr-webinar-showcase-799873?e=39af4785c7\">Intimate Partner Violence Experienced by Lesbian, Gay, and Bisexual Individuals: A Look at National Data,</a>&quot; Tuesday, April 30, from 3:00 p.m. to 4:00 p.m. CST.</p>\n<h2 id=\"other-materials-of-interest\">OTHER MATERIALS OF INTEREST</h2>\n<p>The Ohio Domestic Violence Network created a trauma-informed, self-support guide for domestic violence victims entitled <a href=\"https://www.odvn.org/resource-center/\">Just Breathe</a>. This collection of wellness and recovery resources was developed with the help of survivors in five domestic violence programs across Ohio, advocates and staff from the Ohio Domestic Violence Network, researchers from The Ohio State University, and funding from The Office for Victims of Crime.</p>\n<p><a href=\"https://www.researchgate.net/publication/327355473_Moving_from_the_Mainstream_to_the_Margins_Lessons_in_Culture_and_Power\">Moving from the Mainstream to the Margins: Lessons in Culture and Power</a>, by Ruby White Staff, provides a great overview of ways in which dominate systems and its players can reflect on past practices and commit to racial equity.</p>\n<p>This article, <a href=\"https://www.edutopia.org/article/when-students-are-traumatized-teachers-are-too\">When Students Are Traumatized, Teachers Are Too</a>, provides an overview on vicarious trauma and its impact on teachers and some simple steps to address it.</p>\n<p>The Healing Justice Alliance brief entitled, <a href=\"https://static1.squarespace.com/static/566b074fbfe87338d2021874/t/5c6c81599b747a015fb5e9d8/1550614981426/Brief_Three_HJA_V3.pdf\">Best Practices For Supporting Front Line Intervention Workers</a>, summarizes self-care, training, and support needs for staff working with victims of community violence.</p>\n<p>To subscribe to this newsletter, send an email with the word SUBSCRIBE in the Subject line to:<br>\n<a href=\"mailto:Leslie.Cortez@Illinois.gov\">Leslie.Cortez@Illinois.gov</a></p>\n","toc":[{"content":"ILLINOIS HEALS OVERVIEW","slug":"illinois-heals-overview","lvl":2,"i":0,"seen":0},{"content":"PROGRAM GOALS","slug":"program-goals","lvl":2,"i":1,"seen":0},{"content":"WHAT IS A SYSTEM OF CARE?","slug":"what-is-a-system-of-care","lvl":2,"i":2,"seen":0},{"content":"ILLINOIS HEALS DEMONSTRATION SITE","slug":"illinois-heals-demonstration-site","lvl":2,"i":3,"seen":0},{"content":"UPCOMING WEBINAR","slug":"upcoming-webinar","lvl":2,"i":4,"seen":0},{"content":"OTHER MATERIALS OF INTEREST","slug":"other-materials-of-interest","lvl":2,"i":5,"seen":0}],"description":"Welcome to the Illinois HEALS CONNECT Newsletter! The issue features an overview of the Illinois HEALS program, an innovative approach to service delivery, and a program demonstration project update.","url":"https://ilheals.com/publications/issue-01-heals-connect/"},{"route":"/publications/issue-02-heals-connect/","markdown":"\nWelcome to the Illinois HEALS CONNECT Newsletter! This issue features Illinois HEALS grant program updates, technical assistance news, new research, and resources notes.\n\n## NEW IL HEALS PROGRAMS\n\n[ICJIA](https://icjia.illinois.gov) set aside $2.7 million in FFY17 Victims of Crime Act funds to support cross-system projects based on the Illinois HEALS Action Plan. Seventeen applications were received with grant requests totaling $5.7 million. Seven programs were selected for funding totaling about \\$2.5 million. The following programs will implement cross-system IL HEALS projects to improve victim identification, connection, and engagement in services:\n\n### Chicago: Catholic Charities\n\nServing the Back of the Yards and Little Village neighborhoods-communities that are predominately Latinx and lack sufficient services-this program aims to increase service access to young children and their families by providing on-site case management and therapy at partner schools and community agencies. The proposed program also includes connections to other agencies that meet fundamental needs. Systems that are included in the collaboration include education, social services, and grassroots/faith-based groups. Law enforcement agencies and healthcare systems will be engaged when appropriate. Services will be designed to meet the cultural and language needs of the communities served.\n\n### Chicago: Erie Neighborhood House\n\nDirect services, including case management, therapy, and pro bono legal services, will be offered to more than 200 young people and their families through this proposed program. This program will primarily serve Chicago's Southwest Side and adjacent areas and will be staffed to meet the cultural and language needs of area residents. Systems formally engaged in the project include child welfare, education, and victim services. Erie Neighborhood House also will work closely with area health care providers to engage families who seek medical care following victimization.\n\n### Suburban Cook: University of Illinois at Chicago/Village of Park Forest Police Department\n\nThis project will bring together law enforcement, schools, and mental health services in the Park Forest community to increase the workforce's ability to recognize children and adolescents impacted by trauma and violence. The program includes an emphasis on developing policies and practices that promote integrated trauma-informed care and specific trainings to aid professionals in connecting youth to care.\n\n### Collar Counties: Lake County Crisis Center\n\nThe Lake County Crisis Center project will expand services to the Latinx community by creating a formal cross-system structure to coordinate recognition, connection, and service engagement for child and youth victims. Through expanded existing partnerships and an infusion of additional staff, outreach to five additional schools and community areas with significant Spanish-speaking populations will result in families receiving victim services, case management, therapy, and immigration services.\n\n### Northern: City of Rockford\n\nThis project will expand services offered at the Family Peace Center (based on the Family Justice Center model) to provide targeted and community-based case management to victims of crime and connect them to ongoing and intensive clinical therapeutic services and other healing modalities. Funds will enable the center to add a co-located clinical trauma specialist and a case manager to the project to serve child and youth victims and their families.\n\n### Central: Macon County\n\nThe project builds on existing Child 1st Center services in the Decatur area by adding therapy for child and youth victims and uses a coalition model to improve community awareness about victimization and resources for children, youth, and families. Law enforcement will be trained to better recognize child and youth victims and to connect them with the Macon County HEALS project for services and support that include active case management.\n\n### Southern: Egyptian Public and Mental Health Department\n\nServing a largely rural group of 16 counties in southern Illinois that experience disproportionately high rates of child abuse and neglect, the Early Childhood Systems of Care Program will focus on linking and expanding early childhood education and social service cross-system collaboration for child victims under five years old and their families. This collaboration will grow and expand co-location of services and multidisciplinary team approaches while increasing public awareness utilizing the framework of recognizing, connecting, and engaging individuals that have experienced victimization and their families.\n\nSubscribe to the [ICJIA email list](https://visitor.r20.constantcontact.com/manage/optin?v=001MqUcqqvjwLCJXlLMSWbTe3zHHmEQgFeBuHvBcJWTbwgrxFbDSGx4HSUPpI6DJWMUPgbljtLxffqIcGFTgCnr-auak88ybvRxpoJlTMGPtZs%3D) to be notified of all ICJIA grant opportunities.\n\n## NEW RESEARCH\n\nCheck out these two new ICJIA research briefs featuring assessment data findings of the Illinois HEALS survey and discussions with communities and service providers:\n\n- [How Illinois Service Providers Support Young Victims of Crime: Findings from an Illinois HEALS Survey](https://icjia.illinois.gov/researchhub/articles/how-illinois-service-providers-support-young-victims-of-crime-findings-from-an-illinois-heals-survey)\n\n- [Provider-Reported Challenges and Opportunities in Supporting Young Victims of Crime](https://icjia.illinois.gov/researchhub/articles/provider-reported-challenges-and-opportunities-in-supporting-young-victims-of-crime)\n\n## TECHNICAL ASSISTANCE PROVIDER PARTNERSHIP\n\nIL HEALS national technical assistance provider, the [National Council of Juvenile and Family Court Judges](https://www.ncjfcj.org/) (NCJFCJ), has broadened its pool of expertise with three strategic partner organizations.\n\n[Futures Without Violence](https://www.futureswithoutviolence.org/) is a national health and social justice nonprofit that develops groundbreaking programs, policies, and campaigns to empower individuals and organizations working to end violence against women and children. [The Center for the Study of Social Policy](https://cssp.org/) is a national, non-profit organization that connects community action, public system reform, and policy change to create a racially, economically, and socially just society in which all children, youth, and families thrive. [The Center for Court Innovation's](https://www.courtinnovation.org/) Gender and Family Justice team works with communities interested in creating or expanding civil and criminal legal system responses to violence and victimization, including crimes against children, children's exposure to domestic and community violence, teen dating violence, and commercial sexual exploitation, as well as trauma-informed responses to juvenile and adult defendants.\n\nThe Illinois HEALS team is eager to learn from these providers and bring lessons learned back to Illinois.\n\n## PROJECTS & MATERIALS OF INTEREST\n\n### Enhancing Family Court Capacity\n\nFunded by the U.S. Department of Justice Office on Violence Against Women, the [Family Court Enhancement Project](https://familycourtenhancementproject.org/) was designed to build the capacity of four court systems in Cook County, Illinois (Chicago), the State of Delaware (all three counties), Hennepin County, Minnesota (Minneapolis), and Multnomah County, Oregon (Portland), to improve custody decision-making in the context of domestic violence.\n\nThe NCJFCJ coordinates technical assistance to the four sites through dedicated teams composed of representatives from each of the project's partner organizations, including the Center for Court Innovation and Battered Women's Justice Project. These teams help court systems determine how their procedures, practices, and structures related to custody and visitation can reduce further violence and trauma and enhance victim and child resilience and well-being.\n\n### Trauma-Sensitive Schools Series\n\nEducation Week, an on-line weekly e-newsletter for educators, recently published a [five-part series on creating trauma-sensitive schools](https://www.edweek.org/ew/collections/trauma-sensitive-schools/index.html). Each part covers a unique aspect of the long-term process of becoming a trauma-sensitive school.\n\nTo subscribe to this newsletter, send an email with the word SUBSCRIBE in the Subject line to: Leslie.Cortez@Illinois.gov\n","title":"Illinois HEALS CONNECT: Issue 2","html":"<p>Welcome to the Illinois HEALS CONNECT Newsletter! This issue features Illinois HEALS grant program updates, technical assistance news, new research, and resources notes.</p>\n<h2 id=\"new-il-heals-programs\">NEW IL HEALS PROGRAMS</h2>\n<p><a href=\"https://icjia.illinois.gov\">ICJIA</a> set aside $2.7 million in FFY17 Victims of Crime Act funds to support cross-system projects based on the Illinois HEALS Action Plan. Seventeen applications were received with grant requests totaling $5.7 million. Seven programs were selected for funding totaling about $2.5 million. The following programs will implement cross-system IL HEALS projects to improve victim identification, connection, and engagement in services:</p>\n<h3 id=\"chicago-catholic-charities\">Chicago: Catholic Charities</h3>\n<p>Serving the Back of the Yards and Little Village neighborhoods-communities that are predominately Latinx and lack sufficient services-this program aims to increase service access to young children and their families by providing on-site case management and therapy at partner schools and community agencies. The proposed program also includes connections to other agencies that meet fundamental needs. Systems that are included in the collaboration include education, social services, and grassroots/faith-based groups. Law enforcement agencies and healthcare systems will be engaged when appropriate. Services will be designed to meet the cultural and language needs of the communities served.</p>\n<h3 id=\"chicago-erie-neighborhood-house\">Chicago: Erie Neighborhood House</h3>\n<p>Direct services, including case management, therapy, and pro bono legal services, will be offered to more than 200 young people and their families through this proposed program. This program will primarily serve Chicago's Southwest Side and adjacent areas and will be staffed to meet the cultural and language needs of area residents. Systems formally engaged in the project include child welfare, education, and victim services. Erie Neighborhood House also will work closely with area health care providers to engage families who seek medical care following victimization.</p>\n<h3 id=\"suburban-cook-university-of-illinois-at-chicagovillage-of-park-forest-police-department\">Suburban Cook: University of Illinois at Chicago/Village of Park Forest Police Department</h3>\n<p>This project will bring together law enforcement, schools, and mental health services in the Park Forest community to increase the workforce's ability to recognize children and adolescents impacted by trauma and violence. The program includes an emphasis on developing policies and practices that promote integrated trauma-informed care and specific trainings to aid professionals in connecting youth to care.</p>\n<h3 id=\"collar-counties-lake-county-crisis-center\">Collar Counties: Lake County Crisis Center</h3>\n<p>The Lake County Crisis Center project will expand services to the Latinx community by creating a formal cross-system structure to coordinate recognition, connection, and service engagement for child and youth victims. Through expanded existing partnerships and an infusion of additional staff, outreach to five additional schools and community areas with significant Spanish-speaking populations will result in families receiving victim services, case management, therapy, and immigration services.</p>\n<h3 id=\"northern-city-of-rockford\">Northern: City of Rockford</h3>\n<p>This project will expand services offered at the Family Peace Center (based on the Family Justice Center model) to provide targeted and community-based case management to victims of crime and connect them to ongoing and intensive clinical therapeutic services and other healing modalities. Funds will enable the center to add a co-located clinical trauma specialist and a case manager to the project to serve child and youth victims and their families.</p>\n<h3 id=\"central-macon-county\">Central: Macon County</h3>\n<p>The project builds on existing Child 1st Center services in the Decatur area by adding therapy for child and youth victims and uses a coalition model to improve community awareness about victimization and resources for children, youth, and families. Law enforcement will be trained to better recognize child and youth victims and to connect them with the Macon County HEALS project for services and support that include active case management.</p>\n<h3 id=\"southern-egyptian-public-and-mental-health-department\">Southern: Egyptian Public and Mental Health Department</h3>\n<p>Serving a largely rural group of 16 counties in southern Illinois that experience disproportionately high rates of child abuse and neglect, the Early Childhood Systems of Care Program will focus on linking and expanding early childhood education and social service cross-system collaboration for child victims under five years old and their families. This collaboration will grow and expand co-location of services and multidisciplinary team approaches while increasing public awareness utilizing the framework of recognizing, connecting, and engaging individuals that have experienced victimization and their families.</p>\n<p>Subscribe to the <a href=\"https://visitor.r20.constantcontact.com/manage/optin?v=001MqUcqqvjwLCJXlLMSWbTe3zHHmEQgFeBuHvBcJWTbwgrxFbDSGx4HSUPpI6DJWMUPgbljtLxffqIcGFTgCnr-auak88ybvRxpoJlTMGPtZs%3D\">ICJIA email list</a> to be notified of all ICJIA grant opportunities.</p>\n<h2 id=\"new-research\">NEW RESEARCH</h2>\n<p>Check out these two new ICJIA research briefs featuring assessment data findings of the Illinois HEALS survey and discussions with communities and service providers:</p>\n<ul>\n<li>\n<p><a href=\"https://icjia.illinois.gov/researchhub/articles/how-illinois-service-providers-support-young-victims-of-crime-findings-from-an-illinois-heals-survey\">How Illinois Service Providers Support Young Victims of Crime: Findings from an Illinois HEALS Survey</a></p>\n</li>\n<li>\n<p><a href=\"https://icjia.illinois.gov/researchhub/articles/provider-reported-challenges-and-opportunities-in-supporting-young-victims-of-crime\">Provider-Reported Challenges and Opportunities in Supporting Young Victims of Crime</a></p>\n</li>\n</ul>\n<h2 id=\"technical-assistance-provider-partnership\">TECHNICAL ASSISTANCE PROVIDER PARTNERSHIP</h2>\n<p>IL HEALS national technical assistance provider, the <a href=\"https://www.ncjfcj.org/\">National Council of Juvenile and Family Court Judges</a> (NCJFCJ), has broadened its pool of expertise with three strategic partner organizations.</p>\n<p><a href=\"https://www.futureswithoutviolence.org/\">Futures Without Violence</a> is a national health and social justice nonprofit that develops groundbreaking programs, policies, and campaigns to empower individuals and organizations working to end violence against women and children. <a href=\"https://cssp.org/\">The Center for the Study of Social Policy</a> is a national, non-profit organization that connects community action, public system reform, and policy change to create a racially, economically, and socially just society in which all children, youth, and families thrive. <a href=\"https://www.courtinnovation.org/\">The Center for Court Innovation's</a> Gender and Family Justice team works with communities interested in creating or expanding civil and criminal legal system responses to violence and victimization, including crimes against children, children's exposure to domestic and community violence, teen dating violence, and commercial sexual exploitation, as well as trauma-informed responses to juvenile and adult defendants.</p>\n<p>The Illinois HEALS team is eager to learn from these providers and bring lessons learned back to Illinois.</p>\n<h2 id=\"projects-materials-of-interest\">PROJECTS &amp; MATERIALS OF INTEREST</h2>\n<h3 id=\"enhancing-family-court-capacity\">Enhancing Family Court Capacity</h3>\n<p>Funded by the U.S. Department of Justice Office on Violence Against Women, the <a href=\"https://familycourtenhancementproject.org/\">Family Court Enhancement Project</a> was designed to build the capacity of four court systems in Cook County, Illinois (Chicago), the State of Delaware (all three counties), Hennepin County, Minnesota (Minneapolis), and Multnomah County, Oregon (Portland), to improve custody decision-making in the context of domestic violence.</p>\n<p>The NCJFCJ coordinates technical assistance to the four sites through dedicated teams composed of representatives from each of the project's partner organizations, including the Center for Court Innovation and Battered Women's Justice Project. These teams help court systems determine how their procedures, practices, and structures related to custody and visitation can reduce further violence and trauma and enhance victim and child resilience and well-being.</p>\n<h3 id=\"trauma-sensitive-schools-series\">Trauma-Sensitive Schools Series</h3>\n<p>Education Week, an on-line weekly e-newsletter for educators, recently published a <a href=\"https://www.edweek.org/ew/collections/trauma-sensitive-schools/index.html\">five-part series on creating trauma-sensitive schools</a>. Each part covers a unique aspect of the long-term process of becoming a trauma-sensitive school.</p>\n<p>To subscribe to this newsletter, send an email with the word SUBSCRIBE in the Subject line to: <a href=\"mailto:Leslie.Cortez@Illinois.gov\">Leslie.Cortez@Illinois.gov</a></p>\n","toc":[{"content":"NEW IL HEALS PROGRAMS","slug":"new-il-heals-programs","lvl":2,"i":0,"seen":0},{"content":"Chicago: Catholic Charities","slug":"chicago-catholic-charities","lvl":3,"i":1,"seen":0},{"content":"Chicago: Erie Neighborhood House","slug":"chicago-erie-neighborhood-house","lvl":3,"i":2,"seen":0},{"content":"Suburban Cook: University of Illinois at Chicago/Village of Park Forest Police Department","slug":"suburban-cook-university-of-illinois-at-chicagovillage-of-park-forest-police-department","lvl":3,"i":3,"seen":0},{"content":"Collar Counties: Lake County Crisis Center","slug":"collar-counties-lake-county-crisis-center","lvl":3,"i":4,"seen":0},{"content":"Northern: City of Rockford","slug":"northern-city-of-rockford","lvl":3,"i":5,"seen":0},{"content":"Central: Macon County","slug":"central-macon-county","lvl":3,"i":6,"seen":0},{"content":"Southern: Egyptian Public and Mental Health Department","slug":"southern-egyptian-public-and-mental-health-department","lvl":3,"i":7,"seen":0},{"content":"NEW RESEARCH","slug":"new-research","lvl":2,"i":8,"seen":0},{"content":"TECHNICAL ASSISTANCE PROVIDER PARTNERSHIP","slug":"technical-assistance-provider-partnership","lvl":2,"i":9,"seen":0},{"content":"PROJECTS & MATERIALS OF INTEREST","slug":"projects--materials-of-interest","lvl":2,"i":10,"seen":0},{"content":"Enhancing Family Court Capacity","slug":"enhancing-family-court-capacity","lvl":3,"i":11,"seen":0},{"content":"Trauma-Sensitive Schools Series","slug":"trauma-sensitive-schools-series","lvl":3,"i":12,"seen":0}],"description":"Welcome to the Illinois HEALS CONNECT Newsletter! This issue features Illinois HEALS grant program updates, technical assistance news, new research, and resources notes.","url":"https://ilheals.com/publications/issue-02-heals-connect/"},{"route":"/publications/issue-03-heals-connect/","markdown":"\nWelcome to the Illinois HEALS CONNECT Newsletter!\n\nThe issue features an Illinois HEALS demonstration project update, webinar news, and new resources for practitioners.\n\n## Program Update\n\nWithin the Illinois HEALS System of Care Framework, trained and supported natural helpers **Recognize** signs of victimization, knowledgeable and empathic staff **Connect** victims and their families to requested services, and service providers **Engage** victims and their families in trauma-informed and culturally relevant services. Many activities and competencies are required to fully actualize this framework.\n\nThe Illinois HEALS demonstration site, Egyptian Health Department, is using this system of care approach in its efforts to meet the needs of child and youth victims of violence and their families. Five resources coordinators will serve the five-county project area - Franklin, Gallatin, Saline, White, and Williamson. Resource coordinators are developing relationships with local schools and conducting scans of existing services for children, youth, and families. The scans will be used to develop and implement the [Integrated Referral and Intake System](https://connectwithiris.org/) (IRIS), a web-based application that eases warm hand-offs and improves communication among partners by streamlining the referral process. IRIS will close the communication loop for referring organizations and provide reliable measures of partner capacity to serve the community.\n\n<graphic img-file=\"connect-03-iris.png\" img-max-width=\"500px\" img-alt=\"IRIS image\"></graphic>\n\nIRIS also is being implemented in the [Governor's Office of Early Childhood Development Coordinated Intake and Referral Pilots](http://igrowillinois.org/) and several [AOK Networks](http://www.aoknetworks.org/illinois/).\n\n## Illinois HEALS Webinar Series\n\nThis winter, Illinois HEALS sponsored a webinar series to introduce approaches that can enhance the way practitioners work with parents. Experts emphasized that professionals are most effective when they enlist parents as partners.\n\nIn January, Katie Pohlman and Pattie Leppala of the Midwest PBIS Network presented on engaging families as partners through high-fidelity wraparound. The [Midwest PBIS Network](http://www.midwestpbis.org/materials/wraparound) supports the implementation of Positive Behavior Interventions and Supports in state, local, and community agencies throughout the Midwest.\n\nIn February, [National Federation of Families for Children's Mental Health's](https://www.ffcmh.org/) Lynda Gargan and Michelle Covington discussed engaging parents and caregivers in program leadership in ways that respect the lived experience and wisdom of families. Their organization offers certification for parents/family peers to provide support to other families who have children with emotional, behavioral, and mental health challenges.\n\nThis month's session was led by Deborah Gross and Amie Bettencourt of [The Chicago Parent Program](http://www.chicagoparentprogram.org/). They shared the history of their program, created specifically for and with input from families raising young children in low-income communities. The program is evidence-based, emphasizes positive parenting strategies, and supports parents as experts and the change agents for their families.\n\n## New Resources\n\n[National Child Traumatic Stress Network's New Resource: A Socio-Culturally, Linguistically-Responsive, and Trauma-Informed Approach to Mental Health Interpretation](https://www.nctsn.org/resources/a-socio-culturally-linguistically-responsive-and-trauma-informed-approach-to-mental-health-interpretation) provides mental health clinicians and professional interpreters with information about a trauma-informed approach to mental health interpretation that is socio-culturally and linguistically-responsive to the needs of children and families.\n\n[ECHO Resources](https://www.echotraining.org/resources/) can help educate survivors about trauma and resilience to promote survivor empowerment, resolve individual and community-level trauma, and create safe, stable, nurturing relationships that interrupt the cycle of generational trauma.\n\n<graphic img-file=\"connect-03-trauma.png\" img-alt=\"Trauma image\" img-caption=\"The above image as well as many others are available for download <a href='https://www.echotraining.org/infographics/' target='_blank' rel='noopener'>here</a>.\"></graphic>\n\n## Subscribe\n\nTo subscribe to the email version of this newsletter, send an email with the word SUBSCRIBE in the Subject line to: Leslie.Cortez@Illinois.gov\n","title":"Illinois HEALS CONNECT: Issue 3","html":"<p>Welcome to the Illinois HEALS CONNECT Newsletter!</p>\n<p>The issue features an Illinois HEALS demonstration project update, webinar news, and new resources for practitioners.</p>\n<h2 id=\"program-update\">Program Update</h2>\n<p>Within the Illinois HEALS System of Care Framework, trained and supported natural helpers <strong>Recognize</strong> signs of victimization, knowledgeable and empathic staff <strong>Connect</strong> victims and their families to requested services, and service providers <strong>Engage</strong> victims and their families in trauma-informed and culturally relevant services. Many activities and competencies are required to fully actualize this framework.</p>\n<p>The Illinois HEALS demonstration site, Egyptian Health Department, is using this system of care approach in its efforts to meet the needs of child and youth victims of violence and their families. Five resources coordinators will serve the five-county project area - Franklin, Gallatin, Saline, White, and Williamson. Resource coordinators are developing relationships with local schools and conducting scans of existing services for children, youth, and families. The scans will be used to develop and implement the <a href=\"https://connectwithiris.org/\">Integrated Referral and Intake System</a> (IRIS), a web-based application that eases warm hand-offs and improves communication among partners by streamlining the referral process. IRIS will close the communication loop for referring organizations and provide reliable measures of partner capacity to serve the community.</p>\n<p><graphic img-file=\"connect-03-iris.png\" img-max-width=\"500px\" img-alt=\"IRIS image\"></graphic></p>\n<p>IRIS also is being implemented in the <a href=\"http://igrowillinois.org/\">Governor's Office of Early Childhood Development Coordinated Intake and Referral Pilots</a> and several <a href=\"http://www.aoknetworks.org/illinois/\">AOK Networks</a>.</p>\n<h2 id=\"illinois-heals-webinar-series\">Illinois HEALS Webinar Series</h2>\n<p>This winter, Illinois HEALS sponsored a webinar series to introduce approaches that can enhance the way practitioners work with parents. Experts emphasized that professionals are most effective when they enlist parents as partners.</p>\n<p>In January, Katie Pohlman and Pattie Leppala of the Midwest PBIS Network presented on engaging families as partners through high-fidelity wraparound. The <a href=\"http://www.midwestpbis.org/materials/wraparound\">Midwest PBIS Network</a> supports the implementation of Positive Behavior Interventions and Supports in state, local, and community agencies throughout the Midwest.</p>\n<p>In February, <a href=\"https://www.ffcmh.org/\">National Federation of Families for Children's Mental Health's</a> Lynda Gargan and Michelle Covington discussed engaging parents and caregivers in program leadership in ways that respect the lived experience and wisdom of families. Their organization offers certification for parents/family peers to provide support to other families who have children with emotional, behavioral, and mental health challenges.</p>\n<p>This month's session was led by Deborah Gross and Amie Bettencourt of <a href=\"http://www.chicagoparentprogram.org/\">The Chicago Parent Program</a>. They shared the history of their program, created specifically for and with input from families raising young children in low-income communities. The program is evidence-based, emphasizes positive parenting strategies, and supports parents as experts and the change agents for their families.</p>\n<h2 id=\"new-resources\">New Resources</h2>\n<p><a href=\"https://www.nctsn.org/resources/a-socio-culturally-linguistically-responsive-and-trauma-informed-approach-to-mental-health-interpretation\">National Child Traumatic Stress Network's New Resource: A Socio-Culturally, Linguistically-Responsive, and Trauma-Informed Approach to Mental Health Interpretation</a> provides mental health clinicians and professional interpreters with information about a trauma-informed approach to mental health interpretation that is socio-culturally and linguistically-responsive to the needs of children and families.</p>\n<p><a href=\"https://www.echotraining.org/resources/\">ECHO Resources</a> can help educate survivors about trauma and resilience to promote survivor empowerment, resolve individual and community-level trauma, and create safe, stable, nurturing relationships that interrupt the cycle of generational trauma.</p>\n<p><graphic img-file=\"connect-03-trauma.png\" img-alt=\"Trauma image\" img-caption=\"The above image as well as many others are available for download <a href='https://www.echotraining.org/infographics/' target='_blank' rel='noopener'>here</a>.\"></graphic></p>\n<h2 id=\"subscribe\">Subscribe</h2>\n<p>To subscribe to the email version of this newsletter, send an email with the word SUBSCRIBE in the Subject line to: <a href=\"mailto:Leslie.Cortez@Illinois.gov\">Leslie.Cortez@Illinois.gov</a></p>\n","toc":[{"content":"Program Update","slug":"program-update","lvl":2,"i":0,"seen":0},{"content":"Illinois HEALS Webinar Series","slug":"illinois-heals-webinar-series","lvl":2,"i":1,"seen":0},{"content":"New Resources","slug":"new-resources","lvl":2,"i":2,"seen":0},{"content":"Subscribe","slug":"subscribe","lvl":2,"i":3,"seen":0}],"description":"This edition of HEALS CONNECT features an Illinois HEALS demonstration project update, webinar news, and new resources for practitioners.","url":"https://ilheals.com/publications/issue-03-heals-connect/"},{"route":"/publications/issue-04-heals-connect/","markdown":"\nWelcome to the Illinois HEALS CONNECT newsletter! This issue features Illinois HEALS program updates, an overview of the Virginia HEALS program, and new resources applicable to serving victims of crime.\n\n## Program Update\n\nIllinois HEALS researchers have been busy collecting and analyzing data, writing survey reports, revamping focus group protocols, and proposing new ways to understand how the Illinois HEALS demonstration site is implementing the Recognize, Connect, and Engage framework in its region. Three internal analyses have been distributed to the demonstration site on findings of the Illinois HEALS Advisory Council survey, program staff survey, and resource coordinator focus group. ICJIA Researchers are also updating the focus group protocol so that it remains informed by the ongoing process evaluation. In the next few months, researchers will meet with program staff, Advisory Council members, and community service providers to discuss programming for children, youth, and families impacted by violence. These conversations will be part of a new data collection effort which will allow HEALS researchers to connect with stakeholders at the demonstration site and garner insight from community members.\n\nICJIA’s Illinois HEALS Team has welcomed three new team members.\n\n**Leslie Cortez**\n\n<img src=\"/cortez.png\" alt=\"Leslie Cortez image\" style=\"float: left; max-width: 95px; padding-right: 10px;\"/>\n\n<p>Leslie Cortez is the IL HEALS project assistant. Prior to joining the IL HEALS team, Leslie provided dynamic programming for migrant and refugee children and youth as at Heartland Alliance. Leslie also worked with Step Up Women's network as a lead facilitator. In this role, they facilitated afterschool programming for 1st generation CPS students on college access and post-secondary success. Leslie is also an alumna of the Obama Foundation Leadership Corps. Leslie graduated from Concordia University Chicago with a bachelor’s degree in Sociology and a minor in Biology and is pursuing a master's degree in public policy and administration at Northwestern University.\n</p>\n\n**Anne Kirkner, Ph.D.**\n\n<img src=\"/kirkner.png\" alt=\"Anne Kirkner image\" style=\"float: left; max-width: 95px; padding-right: 10px;\"/>\n\nAnne Kirkner is the research manager of ICJIA’s Center for Victim Studies and supervises the Illinois HEALS Research staff. Prior to coming to ICJIA, Anne was a postdoctoral researcher at Rutgers University’s Center on Violence Against Women and Children. Prior to graduate school, she worked at a rape crisis center, overseeing community-based prevention education and working as an advocate. Her current research focuses on understanding the recovery outcomes of survivors of interpersonal violence and finding the best responses across the social ecology. She earned her doctorate in criminology, law, and justice from the University of Illinois at Chicago.\n\n**Erinne Smith**\n\n<img src=\"/smith.png\" alt=\"Erinne Smith image\" style=\"float: left; max-width: 95px; padding-right: 10px;\"/>\n\nErinne Smith joined Illinois HEALS as a Research Assistant in October 2020. Erinne’s background is in quantitative and qualitative analysis. Her research interests include human trafficking, reproductive rights, and social justice. Erinne Smith received a bachelor’s degree in sociology from Cornell College and a master’s degree in sociology from Middle Tennessee State University.\n\n<div style=\"margin-top: 100px\"></div>\n\n## Illinois HEALS Demonstration Site Enters Year 2\n\nAs the demonstration site begins its second funding cycle, the staff are collaborating with Illinois HEALS staff at ICJIA and the [National Council of Juvenile and Family Court Judges](https://www.linkingsystemsofcare.org/) to create 20-minute [Recognize, Connect and Engage](https://icjia.illinois.gov/researchhub/articles/illinois-helping-everyone-access-linked-systems-action-plan#a-relational-approach-to-linkages) modules to specifically address victimization and how to appropriately support a victim of a crime. The modules can be added to existing trauma trainings targeted at people and professionals in children’s lives. These models will be designed to enhance existing trauma trainings to give participants a basic understanding of how to recognize victimization and appropriately address it with their clients, how to thoughtfully connect their clients to service and how to engage them in culturally responsive and trauma informed services. The site will continue to serve individuals in downstate Franklin, Gallatin, Saline, White and Williamson counties.\n\n## Cross System Projects\n\nA unique aspect of Illinois HEALS is that ICJIA’s federal Victims of Crime Act (VOCA) funding supports local adaptation and implementation of the [Illinois HEALS Action Plan](https://icjia.illinois.gov/researchhub/articles/illinois-helping-everyone-access-linked-systems-action-plan). Seven grantees were selected through a competitive notice of funding opportunity. Each grantee is collaborating with at least two systems (e.g schools, law enforcement, social service agencies). [Click here for a list of funded projects](https://ilheals.com/publications/issue-02-heals-connect/) . The projects have adapted during the COVID-19 pandemic by meeting virtually with collaborating agencies and attending virtual trainings, as well as providing telehealth direct services to child, youth and family victims of violence.\n\n## National Partner: Virginia HEALS\n\n<img src=\"/virginia.png\" alt=\"Virginia HEALS image\" style=\"float: right; max-width: 150px; padding-left: 15px;\"/>\n\nIllinois HEALS is funded through a federal Office for Victims of Crime grant, entitled Linking Systems of Care for Children and Youth. It is part of a tremendously enriching four-state collaboration, which includes Virginia HEALS.\n\nFederal support for Virginia HEALS began in January 2015 and will conclude in March 2021. In addition to support provided via the cooperative agreement between the [Virginia Department of Social Services](https://www.dss.virginia.gov/) (funded agency) and the [U.S. Office for Victims of Crime](https://ovc.ojp.gov/about), extensive training and technical assistance is provided by the National Council of Juvenile and Family Court Judges.\n\nOver the last five years, Virginia HEALS has conducted extensive listening tours and resource mapping events across Virginia, using information collected to inform development of the [Screening for Experiences and Strengths (SEAS) tool](https://www.dss.virginia.gov/division/famserv/training/vahe1003/story_html5.html). The tool identifies trauma and victimization experiences and symptoms in children, youth, and transitioning young adults. The Virginia HEALS team then developed a Screening for Experiences and Strengths E-Learning Course on preparing to screen, how to access and administer SEAS, and how to respond to trauma disclosures. SEAS training completion is required to access the screening tool. This report describes the piloting and evaluation of the [screening tool](https://virginiaheals.com/wp-content/uploads/2020/07/The-Virginia-Victimization-Screen-Pilot-and-Evaluation-Report.pdf).\n\nTo implement SEAS, Virginia HEALS developed a [Referral and Response Protocol](https://documentcloud.adobe.com/link/review?uri=urn:aaid:scds:US:8fd822bc-ed8b-4289-bcb5-62617dd8734f) that provides guidance to agency/organizational leadership and multi-disciplinary teams on supporting successful referrals and referral responses and outlines a distinct process for frontline service providers on linking children, youth, and families to needed services and support. An e-Learning course is available to support the protocol. They have collected all this amazing work in this [Toolkit](https://virginiaheals.com/toolkit/).\n\nAs its federal funding comes to an end, Virginia HEALS now works with National Governors Association and the Virginia Office of the Secretary of Health & Human Resources on a new project: The Learning Collaborative, Improving Wellbeing and Success of Children & Families -Addressing Adverse Childhood Experiences (ACEs). The project aims to develop and sustain strategies to prevent and mitigate ACEs from a state-level, public policy perspective. With the onset of the COVID-19 pandemic, the goals and priorities of the collaborative, and of Virginia’s efforts, shifted to address the most pressing needs of Virginians. What emerged from a series of meetings between Virginia’s Trauma-informed Leadership Team and the NGA was the immediate need to share information across agencies and systems and ensure provision of trauma-informed COVID-responses that supported the many social-emotional and physical needs of children, youth, and frontline service providers.\n\nThe Illinois HEALS team has appreciated learning and growing with Virginia HEALS and wishes them the best of luck in their ongoing success.\n\n## Resources\n\nThese links are provided as they can help inform victim service programming.\n\n- [The National Resource Center For Reaching Victims (NRC)](https://reachingvictims.org/) recently shared several helpful resources as part of the Latinos United for Peace and Equity Initiative.\n\n- [Strategies to Recruit, Hire and Sustain Diversity in the Workforce](https://reachingvictims.org/resource/strategies-to-recruit-hire-and-sustain-diversity-in-the-workplace/), provides suggestions for a more comprehensive recruitment strategy and an interview and selection process that addresses biases perpetuated through existing hiring practices. More importantly, the resource provides a primer to think about and redesign the existing structures that impede inclusion and equity in the workplace and create the foundation needed to sustain diversity (National Resource Center).\n\n- [Building a Culture of Trust](https://reachingvictims.org/resource/building-a-culture-of-trust/) provides guidance to help organizations build connections that can foster trust; engage in the development of strong teams; and promote communication and development opportunities between and among staff when embarking on or building up their equity efforts.\n\n- [The Transformational Collaborations: Considerations](https://reachingvictims.org/resource/transformational-collaborations-considerations-to-apply-a-racial-equity-lens/) to Apply a Racial Equity Lens will help expose the subtle, yet insidious mechanisms that lead to the marginalization of people of color and culturally specific organizations, offer strategies to resist these mechanisms, and provide recommendations to transform collaborations into equitable partnerships.\n\n## Subscribe\n\nTo subscribe to the email version of this newsletter, send an email with the word SUBSCRIBE in the Subject line to: Leslie.Cortez@Illinois.gov\n\nSubscribe to the [ICJIA e-mail list](https://visitor.r20.constantcontact.com/manage/optin?v=001MqUcqqvjwLCJXlLMSWbTe3zHHmEQgFeBuHvBcJWTbwgrxFbDSGx4HSUPpI6DJWMUPgbljtLxffqIcGFTgCnr-auak88ybvRxpoJlTMGPtZs%3D) to be notified of all ICJIA grant opportunities.\n","title":"Illinois HEALS CONNECT: Issue 4","html":"<p>Welcome to the Illinois HEALS CONNECT newsletter! This issue features Illinois HEALS program updates, an overview of the Virginia HEALS program, and new resources applicable to serving victims of crime.</p>\n<h2 id=\"program-update\">Program Update</h2>\n<p>Illinois HEALS researchers have been busy collecting and analyzing data, writing survey reports, revamping focus group protocols, and proposing new ways to understand how the Illinois HEALS demonstration site is implementing the Recognize, Connect, and Engage framework in its region. Three internal analyses have been distributed to the demonstration site on findings of the Illinois HEALS Advisory Council survey, program staff survey, and resource coordinator focus group. ICJIA Researchers are also updating the focus group protocol so that it remains informed by the ongoing process evaluation. In the next few months, researchers will meet with program staff, Advisory Council members, and community service providers to discuss programming for children, youth, and families impacted by violence. These conversations will be part of a new data collection effort which will allow HEALS researchers to connect with stakeholders at the demonstration site and garner insight from community members.</p>\n<p>ICJIA’s Illinois HEALS Team has welcomed three new team members.</p>\n<p><strong>Leslie Cortez</strong></p>\n<img src=\"/cortez.png\" alt=\"Leslie Cortez image\" style=\"float: left; max-width: 95px; padding-right: 10px;\"/>\n<p>Leslie Cortez is the IL HEALS project assistant. Prior to joining the IL HEALS team, Leslie provided dynamic programming for migrant and refugee children and youth as at Heartland Alliance. Leslie also worked with Step Up Women's network as a lead facilitator. In this role, they facilitated afterschool programming for 1st generation CPS students on college access and post-secondary success. Leslie is also an alumna of the Obama Foundation Leadership Corps. Leslie graduated from Concordia University Chicago with a bachelor’s degree in Sociology and a minor in Biology and is pursuing a master's degree in public policy and administration at Northwestern University.\n</p>\n<p><strong>Anne Kirkner, Ph.D.</strong></p>\n<img src=\"/kirkner.png\" alt=\"Anne Kirkner image\" style=\"float: left; max-width: 95px; padding-right: 10px;\"/>\n<p>Anne Kirkner is the research manager of ICJIA’s Center for Victim Studies and supervises the Illinois HEALS Research staff. Prior to coming to ICJIA, Anne was a postdoctoral researcher at Rutgers University’s Center on Violence Against Women and Children. Prior to graduate school, she worked at a rape crisis center, overseeing community-based prevention education and working as an advocate. Her current research focuses on understanding the recovery outcomes of survivors of interpersonal violence and finding the best responses across the social ecology. She earned her doctorate in criminology, law, and justice from the University of Illinois at Chicago.</p>\n<p><strong>Erinne Smith</strong></p>\n<img src=\"/smith.png\" alt=\"Erinne Smith image\" style=\"float: left; max-width: 95px; padding-right: 10px;\"/>\n<p>Erinne Smith joined Illinois HEALS as a Research Assistant in October 2020. Erinne’s background is in quantitative and qualitative analysis. Her research interests include human trafficking, reproductive rights, and social justice. Erinne Smith received a bachelor’s degree in sociology from Cornell College and a master’s degree in sociology from Middle Tennessee State University.</p>\n<div style=\"margin-top: 100px\"></div>\n<h2 id=\"illinois-heals-demonstration-site-enters-year-2\">Illinois HEALS Demonstration Site Enters Year 2</h2>\n<p>As the demonstration site begins its second funding cycle, the staff are collaborating with Illinois HEALS staff at ICJIA and the <a href=\"https://www.linkingsystemsofcare.org/\">National Council of Juvenile and Family Court Judges</a> to create 20-minute <a href=\"https://icjia.illinois.gov/researchhub/articles/illinois-helping-everyone-access-linked-systems-action-plan#a-relational-approach-to-linkages\">Recognize, Connect and Engage</a> modules to specifically address victimization and how to appropriately support a victim of a crime. The modules can be added to existing trauma trainings targeted at people and professionals in children’s lives. These models will be designed to enhance existing trauma trainings to give participants a basic understanding of how to recognize victimization and appropriately address it with their clients, how to thoughtfully connect their clients to service and how to engage them in culturally responsive and trauma informed services. The site will continue to serve individuals in downstate Franklin, Gallatin, Saline, White and Williamson counties.</p>\n<h2 id=\"cross-system-projects\">Cross System Projects</h2>\n<p>A unique aspect of Illinois HEALS is that ICJIA’s federal Victims of Crime Act (VOCA) funding supports local adaptation and implementation of the <a href=\"https://icjia.illinois.gov/researchhub/articles/illinois-helping-everyone-access-linked-systems-action-plan\">Illinois HEALS Action Plan</a>. Seven grantees were selected through a competitive notice of funding opportunity. Each grantee is collaborating with at least two systems (e.g schools, law enforcement, social service agencies). <a href=\"https://ilheals.com/publications/issue-02-heals-connect/\">Click here for a list of funded projects</a> . The projects have adapted during the COVID-19 pandemic by meeting virtually with collaborating agencies and attending virtual trainings, as well as providing telehealth direct services to child, youth and family victims of violence.</p>\n<h2 id=\"national-partner-virginia-heals\">National Partner: Virginia HEALS</h2>\n<img src=\"/virginia.png\" alt=\"Virginia HEALS image\" style=\"float: right; max-width: 150px; padding-left: 15px;\"/>\n<p>Illinois HEALS is funded through a federal Office for Victims of Crime grant, entitled Linking Systems of Care for Children and Youth. It is part of a tremendously enriching four-state collaboration, which includes Virginia HEALS.</p>\n<p>Federal support for Virginia HEALS began in January 2015 and will conclude in March 2021. In addition to support provided via the cooperative agreement between the <a href=\"https://www.dss.virginia.gov/\">Virginia Department of Social Services</a> (funded agency) and the <a href=\"https://ovc.ojp.gov/about\">U.S. Office for Victims of Crime</a>, extensive training and technical assistance is provided by the National Council of Juvenile and Family Court Judges.</p>\n<p>Over the last five years, Virginia HEALS has conducted extensive listening tours and resource mapping events across Virginia, using information collected to inform development of the <a href=\"https://www.dss.virginia.gov/division/famserv/training/vahe1003/story_html5.html\">Screening for Experiences and Strengths (SEAS) tool</a>. The tool identifies trauma and victimization experiences and symptoms in children, youth, and transitioning young adults. The Virginia HEALS team then developed a Screening for Experiences and Strengths E-Learning Course on preparing to screen, how to access and administer SEAS, and how to respond to trauma disclosures. SEAS training completion is required to access the screening tool. This report describes the piloting and evaluation of the <a href=\"https://virginiaheals.com/wp-content/uploads/2020/07/The-Virginia-Victimization-Screen-Pilot-and-Evaluation-Report.pdf\">screening tool</a>.</p>\n<p>To implement SEAS, Virginia HEALS developed a <a href=\"https://documentcloud.adobe.com/link/review?uri=urn:aaid:scds:US:8fd822bc-ed8b-4289-bcb5-62617dd8734f\">Referral and Response Protocol</a> that provides guidance to agency/organizational leadership and multi-disciplinary teams on supporting successful referrals and referral responses and outlines a distinct process for frontline service providers on linking children, youth, and families to needed services and support. An e-Learning course is available to support the protocol. They have collected all this amazing work in this <a href=\"https://virginiaheals.com/toolkit/\">Toolkit</a>.</p>\n<p>As its federal funding comes to an end, Virginia HEALS now works with National Governors Association and the Virginia Office of the Secretary of Health &amp; Human Resources on a new project: The Learning Collaborative, Improving Wellbeing and Success of Children &amp; Families -Addressing Adverse Childhood Experiences (ACEs). The project aims to develop and sustain strategies to prevent and mitigate ACEs from a state-level, public policy perspective. With the onset of the COVID-19 pandemic, the goals and priorities of the collaborative, and of Virginia’s efforts, shifted to address the most pressing needs of Virginians. What emerged from a series of meetings between Virginia’s Trauma-informed Leadership Team and the NGA was the immediate need to share information across agencies and systems and ensure provision of trauma-informed COVID-responses that supported the many social-emotional and physical needs of children, youth, and frontline service providers.</p>\n<p>The Illinois HEALS team has appreciated learning and growing with Virginia HEALS and wishes them the best of luck in their ongoing success.</p>\n<h2 id=\"resources\">Resources</h2>\n<p>These links are provided as they can help inform victim service programming.</p>\n<ul>\n<li>\n<p><a href=\"https://reachingvictims.org/\">The National Resource Center For Reaching Victims (NRC)</a> recently shared several helpful resources as part of the Latinos United for Peace and Equity Initiative.</p>\n</li>\n<li>\n<p><a href=\"https://reachingvictims.org/resource/strategies-to-recruit-hire-and-sustain-diversity-in-the-workplace/\">Strategies to Recruit, Hire and Sustain Diversity in the Workforce</a>, provides suggestions for a more comprehensive recruitment strategy and an interview and selection process that addresses biases perpetuated through existing hiring practices. More importantly, the resource provides a primer to think about and redesign the existing structures that impede inclusion and equity in the workplace and create the foundation needed to sustain diversity (National Resource Center).</p>\n</li>\n<li>\n<p><a href=\"https://reachingvictims.org/resource/building-a-culture-of-trust/\">Building a Culture of Trust</a> provides guidance to help organizations build connections that can foster trust; engage in the development of strong teams; and promote communication and development opportunities between and among staff when embarking on or building up their equity efforts.</p>\n</li>\n<li>\n<p><a href=\"https://reachingvictims.org/resource/transformational-collaborations-considerations-to-apply-a-racial-equity-lens/\">The Transformational Collaborations: Considerations</a> to Apply a Racial Equity Lens will help expose the subtle, yet insidious mechanisms that lead to the marginalization of people of color and culturally specific organizations, offer strategies to resist these mechanisms, and provide recommendations to transform collaborations into equitable partnerships.</p>\n</li>\n</ul>\n<h2 id=\"subscribe\">Subscribe</h2>\n<p>To subscribe to the email version of this newsletter, send an email with the word SUBSCRIBE in the Subject line to: <a href=\"mailto:Leslie.Cortez@Illinois.gov\">Leslie.Cortez@Illinois.gov</a></p>\n<p>Subscribe to the <a href=\"https://visitor.r20.constantcontact.com/manage/optin?v=001MqUcqqvjwLCJXlLMSWbTe3zHHmEQgFeBuHvBcJWTbwgrxFbDSGx4HSUPpI6DJWMUPgbljtLxffqIcGFTgCnr-auak88ybvRxpoJlTMGPtZs%3D\">ICJIA e-mail list</a> to be notified of all ICJIA grant opportunities.</p>\n","toc":[{"content":"Program Update","slug":"program-update","lvl":2,"i":0,"seen":0},{"content":"Illinois HEALS Demonstration Site Enters Year 2","slug":"illinois-heals-demonstration-site-enters-year-2","lvl":2,"i":1,"seen":0},{"content":"Cross System Projects","slug":"cross-system-projects","lvl":2,"i":2,"seen":0},{"content":"National Partner: Virginia HEALS","slug":"national-partner-virginia-heals","lvl":2,"i":3,"seen":0},{"content":"Resources","slug":"resources","lvl":2,"i":4,"seen":0},{"content":"Subscribe","slug":"subscribe","lvl":2,"i":5,"seen":0}],"description":"Welcome to the Illinois HEALS CONNECT newsletter! This issue features Illinois HEALS program updates, an overview of the Virginia HEALS program, and new resources applicable to serving victims of crime.","url":"https://ilheals.com/publications/issue-04-heals-connect/"},{"route":"/publications/issue-09-heals-connect/","markdown":"\nWelcome to the Illinois HEALS CONNECT newsletter! This issue features Illinois program updates and new resources applicable for serving victims of crimes.\n\n## Download PDF\n\n[Illinois HEALS CONNECT: Issue 9](https://ilheals.com/ILHEALSFallWinter2022FINAL.pdf)&nbsp;&raquo;\n\n## Subscribe\n\nSubscribe to the [ICJIA e-mail list](https://visitor.r20.constantcontact.com/manage/optin?v=001MqUcqqvjwLCJXlLMSWbTe3zHHmEQgFeBuHvBcJWTbwgrxFbDSGx4HSUPpI6DJWMUPgbljtLxffqIcGFTgCnr-auak88ybvRxpoJlTMGPtZs%3D) to be notified of all ICJIA grant opportunities.\n","title":"Illinois HEALS CONNECT: Issue 9","html":"<p>Welcome to the Illinois HEALS CONNECT newsletter! This issue features Illinois program updates and new resources applicable for serving victims of crimes.</p>\n<h2 id=\"download-pdf\">Download PDF</h2>\n<p><a href=\"https://ilheals.com/ILHEALSFallWinter2022FINAL.pdf\">Illinois HEALS CONNECT: Issue 9</a> »</p>\n<h2 id=\"subscribe\">Subscribe</h2>\n<p>Subscribe to the <a href=\"https://visitor.r20.constantcontact.com/manage/optin?v=001MqUcqqvjwLCJXlLMSWbTe3zHHmEQgFeBuHvBcJWTbwgrxFbDSGx4HSUPpI6DJWMUPgbljtLxffqIcGFTgCnr-auak88ybvRxpoJlTMGPtZs%3D\">ICJIA e-mail list</a> to be notified of all ICJIA grant opportunities.</p>\n","toc":[{"content":"Download PDF","slug":"download-pdf","lvl":2,"i":0,"seen":0},{"content":"Subscribe","slug":"subscribe","lvl":2,"i":1,"seen":0}],"description":"Welcome to the Illinois HEALS CONNECT newsletter! This issue features Illinois program updates and new resources applicable for serving victims of crimes.","url":"https://ilheals.com/publications/issue-09-heals-connect/"},{"route":"/publications/self-care/","markdown":"\n## IL HEALS Demonstration Site: White Paper\n\n<graphic img-file=\"wp.png\" img-alt=\"Self Card Guide image\"></graphic>\n\n> The IL HEALS Demonstration Site developed a white paper the explores the effectiveness of self-care strategies and how they are beneficial for reducing unhealthy levels of stress, burnout, and compassion fatigue. The white paper dives into individual responses to self care as well as systemic responses for families, organizations and communities.\n\nTo read more [click here](https://ilheals.com/ILHEALSWhitePaperonSelf-Care.pdf)\n\n<div style=\"height: 50px\"></div>\n\n## IL HEALS Demonstration Site: Self Care Guide\n\n<graphic img-file=\"sc.png\" img-alt=\"Self Card Guide image\"></graphic>\n\n**Seasonal Series**\n\n> The Demonstration site observed a need for mental health professionals to acquire more self-care tools and resources. The IL HEALS team at the demonstration site developed a self-care guide for professionals who work directly with families and community members. The guide provides tips, tools, virtual trainings, and journal articles to read. This self-care guide will be updated seasonally.\n\nTo read the first guide [click here](https://ilheals.com/FinishedSelf-CareGuide.pdf) and to read the spring edition, [click here](https://ilheals.com/IllinoisHEALSSpring2021Self-CareGuideFinal.pdf)\n","title":"Self Care Guide and White Paper","html":"<h2 id=\"il-heals-demonstration-site-white-paper\">IL HEALS Demonstration Site: White Paper</h2>\n<p><graphic img-file=\"wp.png\" img-alt=\"Self Card Guide image\"></graphic></p>\n<blockquote>\n<p>The IL HEALS Demonstration Site developed a white paper the explores the effectiveness of self-care strategies and how they are beneficial for reducing unhealthy levels of stress, burnout, and compassion fatigue. The white paper dives into individual responses to self care as well as systemic responses for families, organizations and communities.</p>\n</blockquote>\n<p>To read more <a href=\"https://ilheals.com/ILHEALSWhitePaperonSelf-Care.pdf\">click here</a></p>\n<div style=\"height: 50px\"></div>\n<h2 id=\"il-heals-demonstration-site-self-care-guide\">IL HEALS Demonstration Site: Self Care Guide</h2>\n<p><graphic img-file=\"sc.png\" img-alt=\"Self Card Guide image\"></graphic></p>\n<p><strong>Seasonal Series</strong></p>\n<blockquote>\n<p>The Demonstration site observed a need for mental health professionals to acquire more self-care tools and resources. The IL HEALS team at the demonstration site developed a self-care guide for professionals who work directly with families and community members. The guide provides tips, tools, virtual trainings, and journal articles to read. This self-care guide will be updated seasonally.</p>\n</blockquote>\n<p>To read the first guide <a href=\"https://ilheals.com/FinishedSelf-CareGuide.pdf\">click here</a> and to read the spring edition, <a href=\"https://ilheals.com/IllinoisHEALSSpring2021Self-CareGuideFinal.pdf\">click here</a></p>\n","toc":[{"content":"IL HEALS Demonstration Site: White Paper","slug":"il-heals-demonstration-site-white-paper","lvl":2,"i":0,"seen":0},{"content":"IL HEALS Demonstration Site: Self Care Guide","slug":"il-heals-demonstration-site-self-care-guide","lvl":2,"i":1,"seen":0}],"description":"The IL HEALS Demonstration Site developed a white paper the explores the effectiveness of self-care strategies and how they are beneficial for reducing unhealthy levels of stress, burnout, and compassion fatigue.","url":"https://ilheals.com/publications/self-care/"},{"route":"/recent-publications/","markdown":"\n<PublicationList></PublicationList>\n","title":"Publications","menuTitle":"Publications","createdAt":"2020-11-03","html":"<p><PublicationList></PublicationList></p>\n","toc":[],"description":"Helping Everyone Access Linked Systems (Illinois HEALS) is multi-year initiative to address child and youth victimization.","url":"https://ilheals.com/recent-publications/"},{"route":"/resources/","markdown":"\n<style>\n\n    h2 ~ p {\n        margin-left: 20px;\n    }\n\n</style>\n\n## HEALS National Partners’ Resources\n\n[ICF](https://www.icf.com/)\n\nICF offers research, programmatic support, technology services, and other assistance in a number of markets, including social programs and criminal justice. This resource offers information about supporting survivors of trauma and victimization, including research, webinars, podcasts, and blog posts.\n\n[The National Council of Juvenile and Family Court Judges](http://www.ncjfcj.org/)\n\nThe National Council of Juvenile and Family Court Judges (NCJFCJ) provides communities with knowledge and skills to improve the lives of families and children who seek justice. Visit the NCJFCJ site to access webinars, publications, and resources related to family violence and domestic relations, juvenile justice, and child welfare and juvenile law.\n\n[U.S. Department of Justice National Institute of Justice](https://www.ojp.gov/)\n\nThe National Institute of Justice (NIJ) is the research, development, and evaluation agency of the U.S. Department of Justice. NIJ is dedicated to improving knowledge and understanding of crime and justice issues through science. NIJ provides objective and independent knowledge and tools to reduce crime and promote justice, particularly at the state and local levels. Read this NIJ article on childhood exposure to violence: https://nij.ojp.gov/topics/articles/children-exposed-violence\n\n[Office for Victims of Crime](https://ovc.ojp.gov/about)\n\nThe U.S. Department of Justice Office for Victims of Crime (OVC) is committed to enhancing the nation’s capacity to assist crime victims and to providing leadership in changing attitudes, policies, and practices to promote justice and healing for crime victims. OVC’s library is home to numerous resources, including training materials, webinars, and Frequently Asked Questions: https://ovc.ojp.gov/library#t0wwt\n\n## Linking Systems of Care State Resources\n\nMontana, Ohio, Virginia, and Illinois are home to HEALS projects with the support of this discretionary grant from the Office of Victims of Crime. Each state’s site houses numerous resources, such as sample documents, training videos, and implementation tools, to support communities working to strengthen linked services for children and families impacted by crime.\n\n- [Montana](https://www.linkingsystemsofcare.org/demonstration-sites/montana.html)\n- [Ohio](https://www.ohioheals.org/)\n- [Virginia](https://virginiaheals.com/)\n\n## Resources on Children & Trauma\n\n[National Child Traumatic Stress Network (NCTSN)](https://www.nctsn.org/)\n\nVisit NCTSN for information on the types and impacts of childhood trauma. Resources are available for children, families, and a variety of service providers.\n\n[The American Academy of Child and Adolescent Psychiatry’s Trauma and Child Abuse Resource Center](https://www.aacap.org/aacap/Families_and_Youth/Resource_Centers/Child_Abuse_Resource_Center/Home.aspx)\n\nThe Trauma and Child Abuse Resource Center offers resources for families and clinicians who support young people who have experienced abuse and trauma.\n\n[Futures Without Violence Defending Childhood Initiative](https://www.futureswithoutviolence.org/children-youth-teens/defending-childhood-initiative/)\n\nFutures Without Violence Defending Childhood Initiative offers resources and tools to support children and teens who have been impacted by trauma, violence, and victimization.\n\n[Substance Abuse and Mental Health Services Administration’s (SAMHSA’s) Resources for Child Trauma-Informed Care](https://www.samhsa.gov/childrens-awareness-day/child-traumatic-stress-resources)\n\nThis SAMSHA list includes resources, tools, and organizations that support children and families impacted by trauma and victimization and the professionals who serve them.\n\n## Self-Care Resources\n\n[Self-Care for Children & Families](https://www.nctsn.org/resources/taking-care-of-yourself)\n\nThe Taking Care of Yourself Checklist\nThis resource helps children, families, and professionals identify simple ways to practice self-care.\n\n[Anna Freud Centre’s Self-Care webpage](https://www.annafreud.org/on-my-mind/self-care/)\n\nInformed by young people ages 11 to 25, this interactive site list dozens of strategies to practice self-care and mindfulness. Options can be sorted by activity type.\n\n[Trying Together’s Self-Care: Resources for Families](https://tryingtogether.org/dap/parent-self-care/)\n\nView a list of resources for families who want to incorporate more self-care practices into their lives.\n\n[Action for Health Kids: Create a Self-Care Plan ](https://www.actionforhealthykids.org/activity/create-a-family-self-care-plan/)\n\nThis site outlines practical steps for developing a family self-care plan.\n\n[Grounding Tools](https://www.nsvrc.org/elearning/grounding-tools)\n\nThis interactive tool from the National Sexual Violence Resource Center offers simple relaxation activities for children.\n\n## Self-Care Resources for Professionals & Organizations\n\n[Self Care is a Mandate](https://ilheals.com/publications/self-care)\n\nThis IL HEALS white paper explores the effectiveness of self-care strategies and how they are beneficial for reducing unhealthy levels of stress, burnout, and compassion fatigue.\n\n[IL HEALS Demonstration Site's Self-Care Guide](https://ilheals.com/publications/self-care)\n\nThis self-care guide was written for professionals who work directly with families and community members. The guide provides tips, tools, virtual trainings, and journal articles.\n\n[Trauma-Informed Care in Behavioral Health Services by SAMSHA](https://www.ncbi.nlm.nih.gov/books/NBK207201/)\n\nThis resource provides an overview of trauma-informed care and discusses how to develop and institute a trauma-informed care framework within behavioral health organizations. With 16 strategies, tips, tools, and additional resources, this guide is relevant for a variety of organizations and settings striving to integrate trauma-informed care practices into their work.\n\n[NCTSN’s Resources on Secondary Traumatic Stress](https://www.nctsn.org/trauma-informed-care/secondary-traumatic-stress)\n\nBearing witness to the impact of trauma takes a toll on helping professionals. These tools and resources, including a trauma-informed organizational assessment, provide valuable information for individuals and organizations working to prevent and mitigate the impact of vicarious trauma.\n\n[Self-Care & Grounding Techniques for Professionals](https://pcar.org/resource/self-care-grounding-techniques-professionals)\n\nThis resource provides simple, practical strategies for mitigating the impacts of work-related stress and trauma at work.\n\nFind IL HEALS Connect newsletters and other products [here](https://ilheals.com/recent-publications/).\n","title":"Resources","menuTitle":"Resources","createdAt":"2020-11-03","html":"<style>\n\n    h2 ~ p {\n        margin-left: 20px;\n    }\n\n</style>\n<h2 id=\"heals-national-partners-resources\">HEALS National Partners’ Resources</h2>\n<p><a href=\"https://www.icf.com/\">ICF</a></p>\n<p>ICF offers research, programmatic support, technology services, and other assistance in a number of markets, including social programs and criminal justice. This resource offers information about supporting survivors of trauma and victimization, including research, webinars, podcasts, and blog posts.</p>\n<p><a href=\"http://www.ncjfcj.org/\">The National Council of Juvenile and Family Court Judges</a></p>\n<p>The National Council of Juvenile and Family Court Judges (NCJFCJ) provides communities with knowledge and skills to improve the lives of families and children who seek justice. Visit the NCJFCJ site to access webinars, publications, and resources related to family violence and domestic relations, juvenile justice, and child welfare and juvenile law.</p>\n<p><a href=\"https://www.ojp.gov/\">U.S. Department of Justice National Institute of Justice</a></p>\n<p>The National Institute of Justice (NIJ) is the research, development, and evaluation agency of the U.S. Department of Justice. NIJ is dedicated to improving knowledge and understanding of crime and justice issues through science. NIJ provides objective and independent knowledge and tools to reduce crime and promote justice, particularly at the state and local levels. Read this NIJ article on childhood exposure to violence: <a href=\"https://nij.ojp.gov/topics/articles/children-exposed-violence\">https://nij.ojp.gov/topics/articles/children-exposed-violence</a></p>\n<p><a href=\"https://ovc.ojp.gov/about\">Office for Victims of Crime</a></p>\n<p>The U.S. Department of Justice Office for Victims of Crime (OVC) is committed to enhancing the nation’s capacity to assist crime victims and to providing leadership in changing attitudes, policies, and practices to promote justice and healing for crime victims. OVC’s library is home to numerous resources, including training materials, webinars, and Frequently Asked Questions: <a href=\"https://ovc.ojp.gov/library#t0wwt\">https://ovc.ojp.gov/library#t0wwt</a></p>\n<h2 id=\"linking-systems-of-care-state-resources\">Linking Systems of Care State Resources</h2>\n<p>Montana, Ohio, Virginia, and Illinois are home to HEALS projects with the support of this discretionary grant from the Office of Victims of Crime. Each state’s site houses numerous resources, such as sample documents, training videos, and implementation tools, to support communities working to strengthen linked services for children and families impacted by crime.</p>\n<ul>\n<li><a href=\"https://www.linkingsystemsofcare.org/demonstration-sites/montana.html\">Montana</a></li>\n<li><a href=\"https://www.ohioheals.org/\">Ohio</a></li>\n<li><a href=\"https://virginiaheals.com/\">Virginia</a></li>\n</ul>\n<h2 id=\"resources-on-children-trauma\">Resources on Children &amp; Trauma</h2>\n<p><a href=\"https://www.nctsn.org/\">National Child Traumatic Stress Network (NCTSN)</a></p>\n<p>Visit NCTSN for information on the types and impacts of childhood trauma. Resources are available for children, families, and a variety of service providers.</p>\n<p><a href=\"https://www.aacap.org/aacap/Families_and_Youth/Resource_Centers/Child_Abuse_Resource_Center/Home.aspx\">The American Academy of Child and Adolescent Psychiatry’s Trauma and Child Abuse Resource Center</a></p>\n<p>The Trauma and Child Abuse Resource Center offers resources for families and clinicians who support young people who have experienced abuse and trauma.</p>\n<p><a href=\"https://www.futureswithoutviolence.org/children-youth-teens/defending-childhood-initiative/\">Futures Without Violence Defending Childhood Initiative</a></p>\n<p>Futures Without Violence Defending Childhood Initiative offers resources and tools to support children and teens who have been impacted by trauma, violence, and victimization.</p>\n<p><a href=\"https://www.samhsa.gov/childrens-awareness-day/child-traumatic-stress-resources\">Substance Abuse and Mental Health Services Administration’s (SAMHSA’s) Resources for Child Trauma-Informed Care</a></p>\n<p>This SAMSHA list includes resources, tools, and organizations that support children and families impacted by trauma and victimization and the professionals who serve them.</p>\n<h2 id=\"self-care-resources\">Self-Care Resources</h2>\n<p><a href=\"https://www.nctsn.org/resources/taking-care-of-yourself\">Self-Care for Children &amp; Families</a></p>\n<p>The Taking Care of Yourself Checklist\nThis resource helps children, families, and professionals identify simple ways to practice self-care.</p>\n<p><a href=\"https://www.annafreud.org/on-my-mind/self-care/\">Anna Freud Centre’s Self-Care webpage</a></p>\n<p>Informed by young people ages 11 to 25, this interactive site list dozens of strategies to practice self-care and mindfulness. Options can be sorted by activity type.</p>\n<p><a href=\"https://tryingtogether.org/dap/parent-self-care/\">Trying Together’s Self-Care: Resources for Families</a></p>\n<p>View a list of resources for families who want to incorporate more self-care practices into their lives.</p>\n<p><a href=\"https://www.actionforhealthykids.org/activity/create-a-family-self-care-plan/\">Action for Health Kids: Create a Self-Care Plan </a></p>\n<p>This site outlines practical steps for developing a family self-care plan.</p>\n<p><a href=\"https://www.nsvrc.org/elearning/grounding-tools\">Grounding Tools</a></p>\n<p>This interactive tool from the National Sexual Violence Resource Center offers simple relaxation activities for children.</p>\n<h2 id=\"self-care-resources-for-professionals-organizations\">Self-Care Resources for Professionals &amp; Organizations</h2>\n<p><a href=\"https://ilheals.com/publications/self-care\">Self Care is a Mandate</a></p>\n<p>This IL HEALS white paper explores the effectiveness of self-care strategies and how they are beneficial for reducing unhealthy levels of stress, burnout, and compassion fatigue.</p>\n<p><a href=\"https://ilheals.com/publications/self-care\">IL HEALS Demonstration Site's Self-Care Guide</a></p>\n<p>This self-care guide was written for professionals who work directly with families and community members. The guide provides tips, tools, virtual trainings, and journal articles.</p>\n<p><a href=\"https://www.ncbi.nlm.nih.gov/books/NBK207201/\">Trauma-Informed Care in Behavioral Health Services by SAMSHA</a></p>\n<p>This resource provides an overview of trauma-informed care and discusses how to develop and institute a trauma-informed care framework within behavioral health organizations. With 16 strategies, tips, tools, and additional resources, this guide is relevant for a variety of organizations and settings striving to integrate trauma-informed care practices into their work.</p>\n<p><a href=\"https://www.nctsn.org/trauma-informed-care/secondary-traumatic-stress\">NCTSN’s Resources on Secondary Traumatic Stress</a></p>\n<p>Bearing witness to the impact of trauma takes a toll on helping professionals. These tools and resources, including a trauma-informed organizational assessment, provide valuable information for individuals and organizations working to prevent and mitigate the impact of vicarious trauma.</p>\n<p><a href=\"https://pcar.org/resource/self-care-grounding-techniques-professionals\">Self-Care &amp; Grounding Techniques for Professionals</a></p>\n<p>This resource provides simple, practical strategies for mitigating the impacts of work-related stress and trauma at work.</p>\n<p>Find IL HEALS Connect newsletters and other products <a href=\"https://ilheals.com/recent-publications/\">here</a>.</p>\n","toc":[{"content":"HEALS National Partners’ Resources","slug":"heals-national-partners-resources","lvl":2,"i":0,"seen":0},{"content":"Linking Systems of Care State Resources","slug":"linking-systems-of-care-state-resources","lvl":2,"i":1,"seen":0},{"content":"Resources on Children & Trauma","slug":"resources-on-children--trauma","lvl":2,"i":2,"seen":0},{"content":"Self-Care Resources","slug":"self-care-resources","lvl":2,"i":3,"seen":0},{"content":"Self-Care Resources for Professionals & Organizations","slug":"self-care-resources-for-professionals--organizations","lvl":2,"i":4,"seen":0}],"description":"Helping Everyone Access Linked Systems (Illinois HEALS) is multi-year initiative to address child and youth victimization.","url":"https://ilheals.com/resources/"},{"route":"/survey/","markdown":"\nThe survey is now closed. Thank you for your interest in the Illinois HEALS project.\n","title":"Survey","createdAt":"2020-11-03","html":"<p>The survey is now closed. Thank you for your interest in the Illinois HEALS project.</p>\n","toc":[],"description":"Helping Everyone Access Linked Systems (Illinois HEALS) is multi-year initiative to address child and youth victimization.","url":"https://ilheals.com/survey/"},{"route":"/toolkit/additional-resources/","markdown":"\n- **Linking Systems of Care/HEALS Toolkits**\n\n  - Linking Systems of Care for Children and Youth Project Toolkit:\n\n    https://www.linkingsystemsofcare.org/toolkit.html\n\n  - NCJFCJ Linking Systems of Care Demonstration Initiative Coordinator Toolkit:\n\n    https://www.ncjfcj.org/linking-systems-of-care/toolkit/\n\n  - Virginia HEALS:\n\n    https://virginiaheals.com/toolkit/\n\n  - Ohio HEALS:\n\n    https://www.ohioheals.org/for-professionals\n\n- **SOC Toolkits**\n\n  - Georgetown Toolkit for Expanding SOC:\n\n    https://gucchd.georgetown.edu/products/Toolkit_SOC.pdf\n\n  - System of Care: A Comprehensive Toolkit for County Implementation from Pennsylvania Care Partnership and the Office of Mental Health and Substance Abuse Services:\n\n    https://www.pacarepartnership.org/uploads/PA_Care_Partnership_Toolkit_-_ELECTRONIC_VERSION_FINAL.pdf\n\n  - Systems of Care Policy Toolkit from the National Child Welfare Workforce Institute:\n\n    https://ncwwi.org/slug/systems-of-care-policy-toolkit/\n\n  - Build Systems of Care in Your Community from the Child Welfare Information Gateway:\n\n    https://www.childwelfare.gov/topics/management/reform/soc/build/\n\n  - Building a Trauma Informed System of Care from Tennessee:\n\n    https://www.tn.gov/content/dam/tn/dcs/documents/for-providers/procurement/Building%20a%20Trauma%20Informed%20System%20of%20Care%20Toolkit.pdf\n\n  - Building a System of Care to Address Emerging Threats to Infants and Children from the American Academy of Pediatrics:\n\n    https://www.aap.org/en/patient-care/disasters-and-children/resources-for-communities/building-an-effective-system-of-care-to-address-emerging-threats-to-infants-and-children/\n\n- **Community Collaboration Toolkits**\n\n  - The Community Tool Box from the University of Kansas:\n\n    https://ctb.ku.edu/en/toolkits\n\n  - Community Collaboration Toolkit from Communities of Opportunity:\n\n    https://www.coopartnerships.org/comm-collab-toolkit\n\n  - Connected Community: A Trauma-Informed Community Engagement Toolkit:\n\n    https://www.traumainformedcommunity.org/\n\n  - Building a Multi-System Trauma-Informed Collaborative from Chapin Hall, University at the University of Chicago and American Institutes for Research:\n\n    https://www.chapinhall.org/wp-content/uploads/PDF/Multi-System-Trauma-Informed-Care-MSTIC-Guide.pdf\n","title":"Additional Resources","html":"<ul>\n<li>\n<p><strong>Linking Systems of Care/HEALS Toolkits</strong></p>\n<ul>\n<li>\n<p>Linking Systems of Care for Children and Youth Project Toolkit:</p>\n<p><a href=\"https://www.linkingsystemsofcare.org/toolkit.html\">https://www.linkingsystemsofcare.org/toolkit.html</a></p>\n</li>\n<li>\n<p>NCJFCJ Linking Systems of Care Demonstration Initiative Coordinator Toolkit:</p>\n<p><a href=\"https://www.ncjfcj.org/linking-systems-of-care/toolkit/\">https://www.ncjfcj.org/linking-systems-of-care/toolkit/</a></p>\n</li>\n<li>\n<p>Virginia HEALS:</p>\n<p><a href=\"https://virginiaheals.com/toolkit/\">https://virginiaheals.com/toolkit/</a></p>\n</li>\n<li>\n<p>Ohio HEALS:</p>\n<p><a href=\"https://www.ohioheals.org/for-professionals\">https://www.ohioheals.org/for-professionals</a></p>\n</li>\n</ul>\n</li>\n<li>\n<p><strong>SOC Toolkits</strong></p>\n<ul>\n<li>\n<p>Georgetown Toolkit for Expanding SOC:</p>\n<p><a href=\"https://gucchd.georgetown.edu/products/Toolkit_SOC.pdf\">https://gucchd.georgetown.edu/products/Toolkit_SOC.pdf</a></p>\n</li>\n<li>\n<p>System of Care: A Comprehensive Toolkit for County Implementation from Pennsylvania Care Partnership and the Office of Mental Health and Substance Abuse Services:</p>\n<p><a href=\"https://www.pacarepartnership.org/uploads/PA_Care_Partnership_Toolkit_-_ELECTRONIC_VERSION_FINAL.pdf\">https://www.pacarepartnership.org/uploads/PA_Care_Partnership_Toolkit_-_ELECTRONIC_VERSION_FINAL.pdf</a></p>\n</li>\n<li>\n<p>Systems of Care Policy Toolkit from the National Child Welfare Workforce Institute:</p>\n<p><a href=\"https://ncwwi.org/slug/systems-of-care-policy-toolkit/\">https://ncwwi.org/slug/systems-of-care-policy-toolkit/</a></p>\n</li>\n<li>\n<p>Build Systems of Care in Your Community from the Child Welfare Information Gateway:</p>\n<p><a href=\"https://www.childwelfare.gov/topics/management/reform/soc/build/\">https://www.childwelfare.gov/topics/management/reform/soc/build/</a></p>\n</li>\n<li>\n<p>Building a Trauma Informed System of Care from Tennessee:</p>\n<p><a href=\"https://www.tn.gov/content/dam/tn/dcs/documents/for-providers/procurement/Building%20a%20Trauma%20Informed%20System%20of%20Care%20Toolkit.pdf\">https://www.tn.gov/content/dam/tn/dcs/documents/for-providers/procurement/Building a Trauma Informed System of Care Toolkit.pdf</a></p>\n</li>\n<li>\n<p>Building a System of Care to Address Emerging Threats to Infants and Children from the American Academy of Pediatrics:</p>\n<p><a href=\"https://www.aap.org/en/patient-care/disasters-and-children/resources-for-communities/building-an-effective-system-of-care-to-address-emerging-threats-to-infants-and-children/\">https://www.aap.org/en/patient-care/disasters-and-children/resources-for-communities/building-an-effective-system-of-care-to-address-emerging-threats-to-infants-and-children/</a></p>\n</li>\n</ul>\n</li>\n<li>\n<p><strong>Community Collaboration Toolkits</strong></p>\n<ul>\n<li>\n<p>The Community Tool Box from the University of Kansas:</p>\n<p><a href=\"https://ctb.ku.edu/en/toolkits\">https://ctb.ku.edu/en/toolkits</a></p>\n</li>\n<li>\n<p>Community Collaboration Toolkit from Communities of Opportunity:</p>\n<p><a href=\"https://www.coopartnerships.org/comm-collab-toolkit\">https://www.coopartnerships.org/comm-collab-toolkit</a></p>\n</li>\n<li>\n<p>Connected Community: A Trauma-Informed Community Engagement Toolkit:</p>\n<p><a href=\"https://www.traumainformedcommunity.org/\">https://www.traumainformedcommunity.org/</a></p>\n</li>\n<li>\n<p>Building a Multi-System Trauma-Informed Collaborative from Chapin Hall, University at the University of Chicago and American Institutes for Research:</p>\n<p><a href=\"https://www.chapinhall.org/wp-content/uploads/PDF/Multi-System-Trauma-Informed-Care-MSTIC-Guide.pdf\">https://www.chapinhall.org/wp-content/uploads/PDF/Multi-System-Trauma-Informed-Care-MSTIC-Guide.pdf</a></p>\n</li>\n</ul>\n</li>\n</ul>\n","toc":[],"description":"Welcome to the Illinois HEALS CONNECT Newsletter! The issue features an overview of the Illinois HEALS program, an innovative approach to service delivery, and a program demonstration project update.","url":"https://ilheals.com/toolkit/additional-resources/"},{"route":"/toolkit/building-a-strong-structure/","markdown":"\nNow that you’ve identified people to help you build the SOC and determined the resources your community has and will need, it is time to plan and create the structure of your SOC to support children and youth impacted by victimization and trauma.\n\nSOC coordination takes time and effort. For the SOC to be successful, identifying or hiring a coordinator, or multiple coordinators, is essential. Identifying someone who has the time, energy, and agency support to dedicate to keeping the work going is vital.\n\nAdditionally, formalizing how the stakeholders will engage with each other and support the initiative is imperative. Fostering commitment and buy-in requires making participants feel respected and that their time is valued. From facilitating effective meetings to fostering a shared vision and mission, this module will help you build and strengthen the framework for your SOC. Start by setting clear expectations of how your team will work together toward the larger goal of supporting children and youth who have experienced victimization and trauma.\n\n- **Hiring coordinators**\n\n  - IL HEALS sample job descriptions – create links.\n\n    1. Service Coordinator\n\n       Toolshed pdfs/Job Descriptions/IL_HEALS_Service_Coordinator\n\n    2. Volunteer Coordinator\n\n       Toolshed pdfs/Job Descriptions/IL_HEALS_Volunteer_Corodinator\n\n    3. Resource Coordinator\n\n       Toolshed pdfs/Job Descriptions/IL*HEALS*/IL HEALS_Resource Coordinator\n\n  - North Carolina Collaborative for Children, Youth, and Families Job Description Sample:\n\n    https://nccollaborative.org/wp-content/uploads/2017/SOC-Coordinator-Functions-in-MCO-revised-11-21-16-trg.pdf\n\n  - Durham County System of Care Job Description Sample:\n\n    https://www.childwelfare.gov/pubPDFs/NC_ManagerJobDescription.pdf\n\n- **Enhancing Team Functioning**\n\n  - Linking Systems of Care Demonstration Initiative Coordinator Toolkit’s Coalition Building Overview:\n\n    https://www.ncjfcj.org/wp-content/uploads/2021/11/Coalition-Building.pdf\n\n  - Linking Systems of Care Demonstration Initiative Coordinator Toolkit’s Critical Conversations with Stakeholders:\n\n    https://www.ncjfcj.org/wp-content/uploads/2021/11/Critical-Conversations-with-Stakeholders.pdf\n\n  - Project Management Essentials from Linking Systems of Care Demonstration Initiative Coordinator Toolkit:\n\n    https://www.ncjfcj.org/wp-content/uploads/2021/11/Project-Management-Essentials.pdf\n\n  - Maintaining Stakeholder Involvement from Linking Systems of Care Demonstration Initiative Coordinator Toolkit:\n\n    https://www.ncjfcj.org/wp-content/uploads/2021/11/Maintaining-Stakeholder-Involvement.pdf\n\n- **Hosting and Facilitating Meetings**\n\n  - Meeting Planning from Linking Systems of Care Demonstration Initiative Coordinator Toolkit:\n\n    https://www.ncjfcj.org/wp-content/uploads/2021/11/Meeting-Planning.pdf\n\n  - Linking Systems of Care for Children and Youth Project Toolkit Module Hosting Productive Meetings:\n\n    https://www.linkingsystemsofcare.org/toolkit-topics/meeting-planning.html\n\n  - Group Facilitation and Problem Solving from the Community Tool Box, University of Kansas:\n\n    https://ctb.ku.edu/en/table-of-contents/leadership/group-facilitation\n\n- **Developing Your Vision and Mission**\n\n  - Developing a mission statement from Linking Systems of Care Demonstration Initiative Coordinator Toolkit:\n\n    https://www.ncjfcj.org/wp-content/uploads/2021/11/Developing-a-Mission-Statement.pdf\n\n  - Linking Systems of Care for Children and Youth Project Toolkit Module on Mission Statements:\n\n    https://www.linkingsystemsofcare.org/toolkit-topics/mission-statement.html\n\n  - Linking Systems of Care for Children and Youth Project Toolkit Module on Guiding Principles:\n\n    https://www.linkingsystemsofcare.org/toolkit-topics/guiding-principles.html\n\n- **Creating a Resource and Referral Network**\n\n  - Linking Systems of Care for Children and Youth Project Toolkit Resource Directory Overview and worksheet:\n\n    https://www.linkingsystemsofcare.org/toolkit-topics/resource-directory.html\n\n  - Resource Directory Overview and Template from Linking Systems of Care Demonstration Initiative Coordinator Toolkit:\n\n    https://www.ncjfcj.org/wp-content/uploads/2021/11/Resource-Directory.pdf\n\n  - Ohio HEALS' Professional’s Guide to Finding Service Providers:\n\n    https://www.ohioheals.org/professional-guide-to-finding-service-providers\n\n  - Ohio HEALS’ Resource Directory:\n\n    https://www.ohioheals.org/directory\n\n  - Sample: IL HEALS’ Demonstration Site’s Resource Guide:\n\n    Toolshed Final Drafts/IL_HEALS_Demonstration_Site’s_Resource_Guide\n\n- **Establishing Agreements through MOUs**\n\n  - Linking Systems of Care for Children and Youth Project Toolkit Module on MOUs:\n\n    https://www.linkingsystemsofcare.org/toolkit-topics/mous.html\n\n  - Memorandum of Understanding from Linking Systems of Care Demonstration Initiative Coordinator Toolkit:\n\n    https://www.ncjfcj.org/wp-content/uploads/2021/11/Memorandum-of-Understanding.pdf\n\n  - Linking Systems of Care Sample MOU:\n\n    https://www.linkingsystemsofcare.org/images/toolkit/MOU_Template_Final.pdf\n","title":"Building a Strong Structure","html":"<p>Now that you’ve identified people to help you build the SOC and determined the resources your community has and will need, it is time to plan and create the structure of your SOC to support children and youth impacted by victimization and trauma.</p>\n<p>SOC coordination takes time and effort. For the SOC to be successful, identifying or hiring a coordinator, or multiple coordinators, is essential. Identifying someone who has the time, energy, and agency support to dedicate to keeping the work going is vital.</p>\n<p>Additionally, formalizing how the stakeholders will engage with each other and support the initiative is imperative. Fostering commitment and buy-in requires making participants feel respected and that their time is valued. From facilitating effective meetings to fostering a shared vision and mission, this module will help you build and strengthen the framework for your SOC. Start by setting clear expectations of how your team will work together toward the larger goal of supporting children and youth who have experienced victimization and trauma.</p>\n<ul>\n<li>\n<p><strong>Hiring coordinators</strong></p>\n<ul>\n<li>\n<p>IL HEALS sample job descriptions – create links.</p>\n<ol>\n<li>\n<p>Service Coordinator</p>\n<p>Toolshed pdfs/Job Descriptions/IL_HEALS_Service_Coordinator</p>\n</li>\n<li>\n<p>Volunteer Coordinator</p>\n<p>Toolshed pdfs/Job Descriptions/IL_HEALS_Volunteer_Corodinator</p>\n</li>\n<li>\n<p>Resource Coordinator</p>\n<p>Toolshed pdfs/Job Descriptions/IL<em>HEALS</em>/IL HEALS_Resource Coordinator</p>\n</li>\n</ol>\n</li>\n<li>\n<p>North Carolina Collaborative for Children, Youth, and Families Job Description Sample:</p>\n<p><a href=\"https://nccollaborative.org/wp-content/uploads/2017/SOC-Coordinator-Functions-in-MCO-revised-11-21-16-trg.pdf\">https://nccollaborative.org/wp-content/uploads/2017/SOC-Coordinator-Functions-in-MCO-revised-11-21-16-trg.pdf</a></p>\n</li>\n<li>\n<p>Durham County System of Care Job Description Sample:</p>\n<p><a href=\"https://www.childwelfare.gov/pubPDFs/NC_ManagerJobDescription.pdf\">https://www.childwelfare.gov/pubPDFs/NC_ManagerJobDescription.pdf</a></p>\n</li>\n</ul>\n</li>\n<li>\n<p><strong>Enhancing Team Functioning</strong></p>\n<ul>\n<li>\n<p>Linking Systems of Care Demonstration Initiative Coordinator Toolkit’s Coalition Building Overview:</p>\n<p><a href=\"https://www.ncjfcj.org/wp-content/uploads/2021/11/Coalition-Building.pdf\">https://www.ncjfcj.org/wp-content/uploads/2021/11/Coalition-Building.pdf</a></p>\n</li>\n<li>\n<p>Linking Systems of Care Demonstration Initiative Coordinator Toolkit’s Critical Conversations with Stakeholders:</p>\n<p><a href=\"https://www.ncjfcj.org/wp-content/uploads/2021/11/Critical-Conversations-with-Stakeholders.pdf\">https://www.ncjfcj.org/wp-content/uploads/2021/11/Critical-Conversations-with-Stakeholders.pdf</a></p>\n</li>\n<li>\n<p>Project Management Essentials from Linking Systems of Care Demonstration Initiative Coordinator Toolkit:</p>\n<p><a href=\"https://www.ncjfcj.org/wp-content/uploads/2021/11/Project-Management-Essentials.pdf\">https://www.ncjfcj.org/wp-content/uploads/2021/11/Project-Management-Essentials.pdf</a></p>\n</li>\n<li>\n<p>Maintaining Stakeholder Involvement from Linking Systems of Care Demonstration Initiative Coordinator Toolkit:</p>\n<p><a href=\"https://www.ncjfcj.org/wp-content/uploads/2021/11/Maintaining-Stakeholder-Involvement.pdf\">https://www.ncjfcj.org/wp-content/uploads/2021/11/Maintaining-Stakeholder-Involvement.pdf</a></p>\n</li>\n</ul>\n</li>\n<li>\n<p><strong>Hosting and Facilitating Meetings</strong></p>\n<ul>\n<li>\n<p>Meeting Planning from Linking Systems of Care Demonstration Initiative Coordinator Toolkit:</p>\n<p><a href=\"https://www.ncjfcj.org/wp-content/uploads/2021/11/Meeting-Planning.pdf\">https://www.ncjfcj.org/wp-content/uploads/2021/11/Meeting-Planning.pdf</a></p>\n</li>\n<li>\n<p>Linking Systems of Care for Children and Youth Project Toolkit Module Hosting Productive Meetings:</p>\n<p><a href=\"https://www.linkingsystemsofcare.org/toolkit-topics/meeting-planning.html\">https://www.linkingsystemsofcare.org/toolkit-topics/meeting-planning.html</a></p>\n</li>\n<li>\n<p>Group Facilitation and Problem Solving from the Community Tool Box, University of Kansas:</p>\n<p><a href=\"https://ctb.ku.edu/en/table-of-contents/leadership/group-facilitation\">https://ctb.ku.edu/en/table-of-contents/leadership/group-facilitation</a></p>\n</li>\n</ul>\n</li>\n<li>\n<p><strong>Developing Your Vision and Mission</strong></p>\n<ul>\n<li>\n<p>Developing a mission statement from Linking Systems of Care Demonstration Initiative Coordinator Toolkit:</p>\n<p><a href=\"https://www.ncjfcj.org/wp-content/uploads/2021/11/Developing-a-Mission-Statement.pdf\">https://www.ncjfcj.org/wp-content/uploads/2021/11/Developing-a-Mission-Statement.pdf</a></p>\n</li>\n<li>\n<p>Linking Systems of Care for Children and Youth Project Toolkit Module on Mission Statements:</p>\n<p><a href=\"https://www.linkingsystemsofcare.org/toolkit-topics/mission-statement.html\">https://www.linkingsystemsofcare.org/toolkit-topics/mission-statement.html</a></p>\n</li>\n<li>\n<p>Linking Systems of Care for Children and Youth Project Toolkit Module on Guiding Principles:</p>\n<p><a href=\"https://www.linkingsystemsofcare.org/toolkit-topics/guiding-principles.html\">https://www.linkingsystemsofcare.org/toolkit-topics/guiding-principles.html</a></p>\n</li>\n</ul>\n</li>\n<li>\n<p><strong>Creating a Resource and Referral Network</strong></p>\n<ul>\n<li>\n<p>Linking Systems of Care for Children and Youth Project Toolkit Resource Directory Overview and worksheet:</p>\n<p><a href=\"https://www.linkingsystemsofcare.org/toolkit-topics/resource-directory.html\">https://www.linkingsystemsofcare.org/toolkit-topics/resource-directory.html</a></p>\n</li>\n<li>\n<p>Resource Directory Overview and Template from Linking Systems of Care Demonstration Initiative Coordinator Toolkit:</p>\n<p><a href=\"https://www.ncjfcj.org/wp-content/uploads/2021/11/Resource-Directory.pdf\">https://www.ncjfcj.org/wp-content/uploads/2021/11/Resource-Directory.pdf</a></p>\n</li>\n<li>\n<p>Ohio HEALS' Professional’s Guide to Finding Service Providers:</p>\n<p><a href=\"https://www.ohioheals.org/professional-guide-to-finding-service-providers\">https://www.ohioheals.org/professional-guide-to-finding-service-providers</a></p>\n</li>\n<li>\n<p>Ohio HEALS’ Resource Directory:</p>\n<p><a href=\"https://www.ohioheals.org/directory\">https://www.ohioheals.org/directory</a></p>\n</li>\n<li>\n<p>Sample: IL HEALS’ Demonstration Site’s Resource Guide:</p>\n<p>Toolshed Final Drafts/IL_HEALS_Demonstration_Site’s_Resource_Guide</p>\n</li>\n</ul>\n</li>\n<li>\n<p><strong>Establishing Agreements through MOUs</strong></p>\n<ul>\n<li>\n<p>Linking Systems of Care for Children and Youth Project Toolkit Module on MOUs:</p>\n<p><a href=\"https://www.linkingsystemsofcare.org/toolkit-topics/mous.html\">https://www.linkingsystemsofcare.org/toolkit-topics/mous.html</a></p>\n</li>\n<li>\n<p>Memorandum of Understanding from Linking Systems of Care Demonstration Initiative Coordinator Toolkit:</p>\n<p><a href=\"https://www.ncjfcj.org/wp-content/uploads/2021/11/Memorandum-of-Understanding.pdf\">https://www.ncjfcj.org/wp-content/uploads/2021/11/Memorandum-of-Understanding.pdf</a></p>\n</li>\n<li>\n<p>Linking Systems of Care Sample MOU:</p>\n<p><a href=\"https://www.linkingsystemsofcare.org/images/toolkit/MOU_Template_Final.pdf\">https://www.linkingsystemsofcare.org/images/toolkit/MOU_Template_Final.pdf</a></p>\n</li>\n</ul>\n</li>\n</ul>\n","toc":[],"description":"ILHEALS Toolkit: Building a Strong Structure.","url":"https://ilheals.com/toolkit/building-a-strong-structure/"},{"route":"/toolkit/fundamental-tools/","markdown":"\nOnce you’ve built the foundation of your SOC, it’s time to add the components that will take your project from your team’s vision to your community’s reality. By carefully and thoughtfully implementing the use of screening tools and protocols, enhancing your network’s capacity to offer quality services for children, you, and young adults who have experienced victimization and trauma, and implementing strategies to prevent revictimization and staff burnout, you will add the final touches to the SOC structure. Prepare to invite the community to connect with the new SOC!\n\nThe fundamental approach of IL HEALS is to Recognize, Connect, and Engage. Recognize the need to ask about victimization and notice behavioral cues. Connect by building relationships and linking people to available resources and support. Lastly, engage survivors and their families through culturally-specific, humble, accessible, and relevant services. The tools in this module will help your team develop strategies for implementing your plan and preparing to launch your SOC within this framework.\n\n## Considerations for Implementing the Use of a Screening Tool:\n\n- Screening and Assessment Considerations for Implementation from the National Child Traumatic Stress Network:\n\n  https://www.nctsn.org/sites/default/files/resources/fact-sheet/screening_and_assessment_considerations_for_implementation.pdf\n\n- Linking Systems of Care for Children and Youth Project Toolkit’s Screening Tools and Protocols Module:\n\n  https://www.linkingsystemsofcare.org/toolkit-topics/screening-tools-protocols.html\n\n- Differences between Screening and Assessment from Linking Systems of Care Demonstration Initiative Coordinator Toolkit:\n\n  https://www.ncjfcj.org/wp-content/uploads/2021/11/Differences-between-screening-and-assessment.pdf\n\n- Screening Tools and Protocols Overview from Linking Systems of Care Demonstration Initiative Coordinator Toolkit:\n\n  https://www.ncjfcj.org/wp-content/uploads/2021/11/Screening-Tools-and-Protocols.pdf\n\n- Screening Children & Youth FAQs from Linking Systems of Care Demonstration Initiative Coordinator Toolkit:\n\n  https://www.ncjfcj.org/wp-content/uploads/2021/11/FAQs-Screening-Children-and-Youth.pdf\n\n- Trauma-informed Screening E-Learning Course from VA HEALS:\n\n  https://www.dss.virginia.gov/division/famserv/training/vahe1002/story.html\n\n- Universal Screening and Education from Linking Systems of Care Demonstration Initiative Coordinator Toolkit:\n\n  https://www.ncjfcj.org/wp-content/uploads/2021/11/Universal-Screening-and-Education.pdf\n\n- Montana HEALS’ Experiences and Expressions Screening Tool Overview and Videos:\n\n  https://www.umt.edu/criminology-research-group/linking-systems-care/screener/default.php\n\n- Virginia HEALS’ Screening for Experiences and Strengths (SEAS) Screening Tool E-learning Course:\n\n  https://www.dss.virginia.gov/division/famserv/training/vahe1003/story.html\n\n- Center for Victim Research Screening and Assessment:\n\n  https://victimresearch.org/tools-training/screening-assessment/\n\n## Developing Protocols\n\n- Referral and Response Protocol from VA HEALS:\n\n  http://virginiaheals.com/wp-content/uploads/2019/07/referral_and_response_protocol_FINAL.pdf\n\n- IL HEALS Protocols:\n\n  - Connection Protocol\n\n    Toolshed pdfs/Protocols/Updated_Connection_Protocol\n\n  - Recognition Protocol\n\n    Toolshed pdfs/Protocols/Updated_Recognition_Protocol\n\n  - Engagement Protocol\n\n    Toolshed pdfs/Protocols/Updated_Engagement_Protocol\n\n  - Not Eligible Protocol\n\n    Toolshed pdfs/Protocols/Updated_Not_Eligible_Protocol\n\n## Building Capacity with Training & Resources\n\n- Trauma, Children, and Youth\n\n  - Youth Mental Health First Aid Training:\n\n    https://www.mentalhealthfirstaid.org/population-focused-modules/youth/\n\n  - National Child Traumatic Stress Network:\n\n    https://www.nctsn.org/resources/training\n\n  - Illinois Collaboration on Youth:\n\n    https://www.icoyouth.org/capacity-building/trauma-informed-care/\n\n  - Adverse Childhood Experiences from the Centers on Disease Control and Prevention:\n\n    https://www.cdc.gov/violenceprevention/aces/index.html\n\n  - Futures Without Violence Resources and Webinars:\n\n    https://www.futureswithoutviolence.org/children-youth-teens/\n\n- Providing Training and Technical Assistance from the Community Tool Box, University of Kansas:\n\n  https://ctb.ku.edu/en/table-of-contents/structure/training-and-technical-assistance\n\n- IL HEALS Respond, Connect, and Engage Training Tools\n\n  - Training Plan\n\n    insert link Toolshed pdfs/RCE Training Materials and Case Studies/Training_Plan.pdf\n\n  - Facilitators’ Guide\n\n    insert link Toolshed pdfs/RCE Training Materials and Case Studies/Facilitator’s_Guide.pdf\n\n  - Training Slides\n\n    insert link Toolshed pdfs/RCE Training Materials and Case Studies/Training_Slides.pdf\n\n  - Case studies:\n\n    - Case Study 1\n\n      Toolshed pdfs/RCE Training Materials and Case Studies/Law_Enforcement_Officer\n\n    - Case Study 2\n\n      Toolshed pdfs/RCE Training Materials and Case Studies/Teacher\n\n    - Case Study 3\n\n      Toolshed pdfs/RCE Training Materials and Case Studies/Neighbor\n\n    - Case Study 4\n\n      Toolshed pdfs/RCE Training Materials and Case Studies/Pastor_Chavez\n\n    - Case Study 5\n\n      Toolshed pdfs/RCE Training Materials and Case Studies/Cafeteria_Worker\n\n  - Case Study Framework – insert link\n\n    Toolshed pdfs/RCE Training Materials and Case Studies/Case_Study_Framework.pdf\n\n  - Training Program Resource Page Handout – insert link\n\n    Toolshed pdfs/RCE Training Materials and Case Studies/Training_Program_Resource_Page_Handout\n\n- Understanding and Reporting Child Abuse and Neglect\n\n  - Child Welfare Information Gateway’s What Is Child Abuse and Neglect? Recognizing the Signs and Symptoms Resource:\n\n    https://www.childwelfare.gov/pubPDFs/whatiscan.pdf\n\n  - Reporting Child Abuse and Neglect in Illinois:\n\n    https://dcfs.illinois.gov/safe-kids/reporting.html\n\n  - Illinois Mandated Reporter Training:\n\n    https://mr.dcfstraining.org/UserAuth/Login!loginPage.action;jsessionid=A87CE70AF65F1EE33B8AAD89AE419E2D\n\n## Conducting Outreach\n\n- IL HEALS Resource Coordinator Postcard Sample: insert link.\n\n  Toolshed pdfs/IL_Resource_Coordinator_Postcard_Sample.png\n\n- Emerging Strategies for Engaging Young People in Systems of Care from Portland State University:\n\n  https://www.pathwaysrtc.pdx.edu/pdf/emerging-strategies-for-engaging-young-people.pdf\n\n- Best Practices for Violence Prevention and Trauma Intervention from University of Illinois at Chicago’s Urban Youth Trauma Center:\n\n  https://www.psych.uic.edu/research/urban-youth-trauma-center/public-awareness/best-practices/best-practices-for-violence-prevention-and-trauma-intervention\n\n- Using Outreach to Increase Access:\n\n  https://ctb.ku.edu/en/table-of-contents/implement/access-barriers-opportunities/outreach-to-increase-access/main\n\n## Attending to Equity and Inclusion\n\n- Working Together for Racial Justice and Inclusion:\n\n  https://ctb.ku.edu/en/table-of-contents/culture/racial-injustice-and-inclusion\n\n- A Guide to Centering Equity in Community Collaborative Work from the Wisconsin Evaluation Collaborative:\n\n  http://wec.wceruw.org/documents/Guide-Centering-Equity.pdf\n\n- Confronting Power Dynamics and Engaging the Community's Voice in Collective Impact webinar from the Minnesota Department of Health:\n\n  https://www.health.state.mn.us/communities/practice/resources/equitylibrary/collectiveimpact-voice.html\n\n- Culturally Responsive Services from Michigan Victim Advocacy Network:\n\n  https://mivan.org/advocacy-skills/culturally-responsive-resources/\n\n- Measuring Capacity to Serve Survivors with Disabilities from the Vera Institute:\n\n  https://www.vera.org/publications/measuring-capacity-to-serve-survivors-with-disabilities\n\n- Outreach to Underserved Teen Victims of Crime from the National Center for Victims of Crime:\n\n  https://victimsofcrime.org/doc/outreach-to-underserved-teen-victims-of-crime.pdf\n\n## Supporting Self-care and Resiliency for Staff\n\n- OVC’s Vicarious Trauma Toolkit:\n\n  https://ovc.ojp.gov/program/vtt/about-the-toolkit\n\n- University at Buffalo’s Self Care Starter Kit:\n\n  https://socialwork.buffalo.edu/resources/self-care-starter-kit.html\n","title":"Fundamental Tools","html":"<p>Once you’ve built the foundation of your SOC, it’s time to add the components that will take your project from your team’s vision to your community’s reality. By carefully and thoughtfully implementing the use of screening tools and protocols, enhancing your network’s capacity to offer quality services for children, you, and young adults who have experienced victimization and trauma, and implementing strategies to prevent revictimization and staff burnout, you will add the final touches to the SOC structure. Prepare to invite the community to connect with the new SOC!</p>\n<p>The fundamental approach of IL HEALS is to Recognize, Connect, and Engage. Recognize the need to ask about victimization and notice behavioral cues. Connect by building relationships and linking people to available resources and support. Lastly, engage survivors and their families through culturally-specific, humble, accessible, and relevant services. The tools in this module will help your team develop strategies for implementing your plan and preparing to launch your SOC within this framework.</p>\n<h2 id=\"considerations-for-implementing-the-use-of-a-screening-tool\">Considerations for Implementing the Use of a Screening Tool:</h2>\n<ul>\n<li>\n<p>Screening and Assessment Considerations for Implementation from the National Child Traumatic Stress Network:</p>\n<p><a href=\"https://www.nctsn.org/sites/default/files/resources/fact-sheet/screening_and_assessment_considerations_for_implementation.pdf\">https://www.nctsn.org/sites/default/files/resources/fact-sheet/screening_and_assessment_considerations_for_implementation.pdf</a></p>\n</li>\n<li>\n<p>Linking Systems of Care for Children and Youth Project Toolkit’s Screening Tools and Protocols Module:</p>\n<p><a href=\"https://www.linkingsystemsofcare.org/toolkit-topics/screening-tools-protocols.html\">https://www.linkingsystemsofcare.org/toolkit-topics/screening-tools-protocols.html</a></p>\n</li>\n<li>\n<p>Differences between Screening and Assessment from Linking Systems of Care Demonstration Initiative Coordinator Toolkit:</p>\n<p><a href=\"https://www.ncjfcj.org/wp-content/uploads/2021/11/Differences-between-screening-and-assessment.pdf\">https://www.ncjfcj.org/wp-content/uploads/2021/11/Differences-between-screening-and-assessment.pdf</a></p>\n</li>\n<li>\n<p>Screening Tools and Protocols Overview from Linking Systems of Care Demonstration Initiative Coordinator Toolkit:</p>\n<p><a href=\"https://www.ncjfcj.org/wp-content/uploads/2021/11/Screening-Tools-and-Protocols.pdf\">https://www.ncjfcj.org/wp-content/uploads/2021/11/Screening-Tools-and-Protocols.pdf</a></p>\n</li>\n<li>\n<p>Screening Children &amp; Youth FAQs from Linking Systems of Care Demonstration Initiative Coordinator Toolkit:</p>\n<p><a href=\"https://www.ncjfcj.org/wp-content/uploads/2021/11/FAQs-Screening-Children-and-Youth.pdf\">https://www.ncjfcj.org/wp-content/uploads/2021/11/FAQs-Screening-Children-and-Youth.pdf</a></p>\n</li>\n<li>\n<p>Trauma-informed Screening E-Learning Course from VA HEALS:</p>\n<p><a href=\"https://www.dss.virginia.gov/division/famserv/training/vahe1002/story.html\">https://www.dss.virginia.gov/division/famserv/training/vahe1002/story.html</a></p>\n</li>\n<li>\n<p>Universal Screening and Education from Linking Systems of Care Demonstration Initiative Coordinator Toolkit:</p>\n<p><a href=\"https://www.ncjfcj.org/wp-content/uploads/2021/11/Universal-Screening-and-Education.pdf\">https://www.ncjfcj.org/wp-content/uploads/2021/11/Universal-Screening-and-Education.pdf</a></p>\n</li>\n<li>\n<p>Montana HEALS’ Experiences and Expressions Screening Tool Overview and Videos:</p>\n<p><a href=\"https://www.umt.edu/criminology-research-group/linking-systems-care/screener/default.php\">https://www.umt.edu/criminology-research-group/linking-systems-care/screener/default.php</a></p>\n</li>\n<li>\n<p>Virginia HEALS’ Screening for Experiences and Strengths (SEAS) Screening Tool E-learning Course:</p>\n<p><a href=\"https://www.dss.virginia.gov/division/famserv/training/vahe1003/story.html\">https://www.dss.virginia.gov/division/famserv/training/vahe1003/story.html</a></p>\n</li>\n<li>\n<p>Center for Victim Research Screening and Assessment:</p>\n<p><a href=\"https://victimresearch.org/tools-training/screening-assessment/\">https://victimresearch.org/tools-training/screening-assessment/</a></p>\n</li>\n</ul>\n<h2 id=\"developing-protocols\">Developing Protocols</h2>\n<ul>\n<li>\n<p>Referral and Response Protocol from VA HEALS:</p>\n<p><a href=\"http://virginiaheals.com/wp-content/uploads/2019/07/referral_and_response_protocol_FINAL.pdf\">http://virginiaheals.com/wp-content/uploads/2019/07/referral_and_response_protocol_FINAL.pdf</a></p>\n</li>\n<li>\n<p>IL HEALS Protocols:</p>\n<ul>\n<li>\n<p>Connection Protocol</p>\n<p>Toolshed pdfs/Protocols/Updated_Connection_Protocol</p>\n</li>\n<li>\n<p>Recognition Protocol</p>\n<p>Toolshed pdfs/Protocols/Updated_Recognition_Protocol</p>\n</li>\n<li>\n<p>Engagement Protocol</p>\n<p>Toolshed pdfs/Protocols/Updated_Engagement_Protocol</p>\n</li>\n<li>\n<p>Not Eligible Protocol</p>\n<p>Toolshed pdfs/Protocols/Updated_Not_Eligible_Protocol</p>\n</li>\n</ul>\n</li>\n</ul>\n<h2 id=\"building-capacity-with-training-resources\">Building Capacity with Training &amp; Resources</h2>\n<ul>\n<li>\n<p>Trauma, Children, and Youth</p>\n<ul>\n<li>\n<p>Youth Mental Health First Aid Training:</p>\n<p><a href=\"https://www.mentalhealthfirstaid.org/population-focused-modules/youth/\">https://www.mentalhealthfirstaid.org/population-focused-modules/youth/</a></p>\n</li>\n<li>\n<p>National Child Traumatic Stress Network:</p>\n<p><a href=\"https://www.nctsn.org/resources/training\">https://www.nctsn.org/resources/training</a></p>\n</li>\n<li>\n<p>Illinois Collaboration on Youth:</p>\n<p><a href=\"https://www.icoyouth.org/capacity-building/trauma-informed-care/\">https://www.icoyouth.org/capacity-building/trauma-informed-care/</a></p>\n</li>\n<li>\n<p>Adverse Childhood Experiences from the Centers on Disease Control and Prevention:</p>\n<p><a href=\"https://www.cdc.gov/violenceprevention/aces/index.html\">https://www.cdc.gov/violenceprevention/aces/index.html</a></p>\n</li>\n<li>\n<p>Futures Without Violence Resources and Webinars:</p>\n<p><a href=\"https://www.futureswithoutviolence.org/children-youth-teens/\">https://www.futureswithoutviolence.org/children-youth-teens/</a></p>\n</li>\n</ul>\n</li>\n<li>\n<p>Providing Training and Technical Assistance from the Community Tool Box, University of Kansas:</p>\n<p><a href=\"https://ctb.ku.edu/en/table-of-contents/structure/training-and-technical-assistance\">https://ctb.ku.edu/en/table-of-contents/structure/training-and-technical-assistance</a></p>\n</li>\n<li>\n<p>IL HEALS Respond, Connect, and Engage Training Tools</p>\n<ul>\n<li>\n<p>Training Plan</p>\n<p>insert link Toolshed pdfs/RCE Training Materials and Case Studies/Training_Plan.pdf</p>\n</li>\n<li>\n<p>Facilitators’ Guide</p>\n<p>insert link Toolshed pdfs/RCE Training Materials and Case Studies/Facilitator’s_Guide.pdf</p>\n</li>\n<li>\n<p>Training Slides</p>\n<p>insert link Toolshed pdfs/RCE Training Materials and Case Studies/Training_Slides.pdf</p>\n</li>\n<li>\n<p>Case studies:</p>\n<ul>\n<li>\n<p>Case Study 1</p>\n<p>Toolshed pdfs/RCE Training Materials and Case Studies/Law_Enforcement_Officer</p>\n</li>\n<li>\n<p>Case Study 2</p>\n<p>Toolshed pdfs/RCE Training Materials and Case Studies/Teacher</p>\n</li>\n<li>\n<p>Case Study 3</p>\n<p>Toolshed pdfs/RCE Training Materials and Case Studies/Neighbor</p>\n</li>\n<li>\n<p>Case Study 4</p>\n<p>Toolshed pdfs/RCE Training Materials and Case Studies/Pastor_Chavez</p>\n</li>\n<li>\n<p>Case Study 5</p>\n<p>Toolshed pdfs/RCE Training Materials and Case Studies/Cafeteria_Worker</p>\n</li>\n</ul>\n</li>\n<li>\n<p>Case Study Framework – insert link</p>\n<p>Toolshed pdfs/RCE Training Materials and Case Studies/Case_Study_Framework.pdf</p>\n</li>\n<li>\n<p>Training Program Resource Page Handout – insert link</p>\n<p>Toolshed pdfs/RCE Training Materials and Case Studies/Training_Program_Resource_Page_Handout</p>\n</li>\n</ul>\n</li>\n<li>\n<p>Understanding and Reporting Child Abuse and Neglect</p>\n<ul>\n<li>\n<p>Child Welfare Information Gateway’s What Is Child Abuse and Neglect? Recognizing the Signs and Symptoms Resource:</p>\n<p><a href=\"https://www.childwelfare.gov/pubPDFs/whatiscan.pdf\">https://www.childwelfare.gov/pubPDFs/whatiscan.pdf</a></p>\n</li>\n<li>\n<p>Reporting Child Abuse and Neglect in Illinois:</p>\n<p><a href=\"https://dcfs.illinois.gov/safe-kids/reporting.html\">https://dcfs.illinois.gov/safe-kids/reporting.html</a></p>\n</li>\n<li>\n<p>Illinois Mandated Reporter Training:</p>\n<p><a href=\"https://mr.dcfstraining.org/UserAuth/Login!loginPage.action;jsessionid=A87CE70AF65F1EE33B8AAD89AE419E2D\">https://mr.dcfstraining.org/UserAuth/Login!loginPage.action;jsessionid=A87CE70AF65F1EE33B8AAD89AE419E2D</a></p>\n</li>\n</ul>\n</li>\n</ul>\n<h2 id=\"conducting-outreach\">Conducting Outreach</h2>\n<ul>\n<li>\n<p>IL HEALS Resource Coordinator Postcard Sample: insert link.</p>\n<p>Toolshed pdfs/IL_Resource_Coordinator_Postcard_Sample.png</p>\n</li>\n<li>\n<p>Emerging Strategies for Engaging Young People in Systems of Care from Portland State University:</p>\n<p><a href=\"https://www.pathwaysrtc.pdx.edu/pdf/emerging-strategies-for-engaging-young-people.pdf\">https://www.pathwaysrtc.pdx.edu/pdf/emerging-strategies-for-engaging-young-people.pdf</a></p>\n</li>\n<li>\n<p>Best Practices for Violence Prevention and Trauma Intervention from University of Illinois at Chicago’s Urban Youth Trauma Center:</p>\n<p><a href=\"https://www.psych.uic.edu/research/urban-youth-trauma-center/public-awareness/best-practices/best-practices-for-violence-prevention-and-trauma-intervention\">https://www.psych.uic.edu/research/urban-youth-trauma-center/public-awareness/best-practices/best-practices-for-violence-prevention-and-trauma-intervention</a></p>\n</li>\n<li>\n<p>Using Outreach to Increase Access:</p>\n<p><a href=\"https://ctb.ku.edu/en/table-of-contents/implement/access-barriers-opportunities/outreach-to-increase-access/main\">https://ctb.ku.edu/en/table-of-contents/implement/access-barriers-opportunities/outreach-to-increase-access/main</a></p>\n</li>\n</ul>\n<h2 id=\"attending-to-equity-and-inclusion\">Attending to Equity and Inclusion</h2>\n<ul>\n<li>\n<p>Working Together for Racial Justice and Inclusion:</p>\n<p><a href=\"https://ctb.ku.edu/en/table-of-contents/culture/racial-injustice-and-inclusion\">https://ctb.ku.edu/en/table-of-contents/culture/racial-injustice-and-inclusion</a></p>\n</li>\n<li>\n<p>A Guide to Centering Equity in Community Collaborative Work from the Wisconsin Evaluation Collaborative:</p>\n<p><a href=\"http://wec.wceruw.org/documents/Guide-Centering-Equity.pdf\">http://wec.wceruw.org/documents/Guide-Centering-Equity.pdf</a></p>\n</li>\n<li>\n<p>Confronting Power Dynamics and Engaging the Community's Voice in Collective Impact webinar from the Minnesota Department of Health:</p>\n<p><a href=\"https://www.health.state.mn.us/communities/practice/resources/equitylibrary/collectiveimpact-voice.html\">https://www.health.state.mn.us/communities/practice/resources/equitylibrary/collectiveimpact-voice.html</a></p>\n</li>\n<li>\n<p>Culturally Responsive Services from Michigan Victim Advocacy Network:</p>\n<p><a href=\"https://mivan.org/advocacy-skills/culturally-responsive-resources/\">https://mivan.org/advocacy-skills/culturally-responsive-resources/</a></p>\n</li>\n<li>\n<p>Measuring Capacity to Serve Survivors with Disabilities from the Vera Institute:</p>\n<p><a href=\"https://www.vera.org/publications/measuring-capacity-to-serve-survivors-with-disabilities\">https://www.vera.org/publications/measuring-capacity-to-serve-survivors-with-disabilities</a></p>\n</li>\n<li>\n<p>Outreach to Underserved Teen Victims of Crime from the National Center for Victims of Crime:</p>\n<p><a href=\"https://victimsofcrime.org/doc/outreach-to-underserved-teen-victims-of-crime.pdf\">https://victimsofcrime.org/doc/outreach-to-underserved-teen-victims-of-crime.pdf</a></p>\n</li>\n</ul>\n<h2 id=\"supporting-self-care-and-resiliency-for-staff\">Supporting Self-care and Resiliency for Staff</h2>\n<ul>\n<li>\n<p>OVC’s Vicarious Trauma Toolkit:</p>\n<p><a href=\"https://ovc.ojp.gov/program/vtt/about-the-toolkit\">https://ovc.ojp.gov/program/vtt/about-the-toolkit</a></p>\n</li>\n<li>\n<p>University at Buffalo’s Self Care Starter Kit:</p>\n<p><a href=\"https://socialwork.buffalo.edu/resources/self-care-starter-kit.html\">https://socialwork.buffalo.edu/resources/self-care-starter-kit.html</a></p>\n</li>\n</ul>\n","toc":[{"content":"Considerations for Implementing the Use of a Screening Tool:","slug":"considerations-for-implementing-the-use-of-a-screening-tool","lvl":2,"i":0,"seen":0},{"content":"Developing Protocols","slug":"developing-protocols","lvl":2,"i":1,"seen":0},{"content":"Building Capacity with Training & Resources","slug":"building-capacity-with-training--resources","lvl":2,"i":2,"seen":0},{"content":"Conducting Outreach","slug":"conducting-outreach","lvl":2,"i":3,"seen":0},{"content":"Attending to Equity and Inclusion","slug":"attending-to-equity-and-inclusion","lvl":2,"i":4,"seen":0},{"content":"Supporting Self-care and Resiliency for Staff","slug":"supporting-self-care-and-resiliency-for-staff","lvl":2,"i":5,"seen":0}],"description":"ILHEALS Toolkit: Fundamental Tools","url":"https://ilheals.com/toolkit/fundamental-tools/"},{"route":"/toolkit/renovation-and-growth/","markdown":"\nAs with any project, it is important to take inventory of the successes and missteps that occur during planning and implementation. For example:\n\n- Did the project turn out as expected?\n\n- Has it been more or less successful than we imagined it would be?\n\n- Are there things we should have done differently? Are there things we should start doing differently? Are there things that should be continued or replicated?\n\n- Are there opportunities to expand the project? Opportunities to streamline the project?\n\n- What have we learned that would be helpful to share with others?\n\nAfter the SOC is created and launched, it is essential for stakeholders and partners to continue to reflect, evaluate, and adjust to ensure that the SOC is continuing to meet the needs of survivors, families, communities, and service providers.\n\nIn this section of the Toolshed, you will find resources and tools to conduct research-based needs assessments methods that will allow you continue learning from partners, colleagues, and your community how to best meet the needs of children, youth, and families who have experienced victimization and trauma.\n\n- **Evaluating your Project**\n\n  - Planning Long-term Evaluation and Assessment Activities from Linking Systems of Care Demonstration Initiative Coordinator Toolkit:\n\n    https://www.ncjfcj.org/wp-content/uploads/2021/11/Planning-Long-Term-Evaluation-and-Assessment-Activities.pdf\n\n  - Evaluation of Systems of Care from Child Welfare Information Gateway:\n\n    https://www.childwelfare.gov/topics/management/reform/soc/build/evaluation/\n\n  - Centering Racial Equity in Measurement and Evaluation from the Urban Institute:\n\n    https://www.urban.org/sites/default/files/publication/104487/centering-racial-equity-in-measurement-and-evaluation_0.pdf\n\n  - Evaluation Plan Template from the CDC:\n\n    https://www.cdc.gov/tb/programs/evaluation/guide/pdf/evaluation_plan_template.pdf\n\n- **Engaging in Research**\n\n  - IL HEALS Research Tools\n\n    - Focus Group & Interview Protocols\n\n      - Resource Coordinator Focus Group Protocol\n\n        pdfs/Research Protocols Surveys, & Slides/Resource_Coordinator_Focus_Group_Protocol.pdf\n\n      - Program Staff Interview Protocol\n\n        pdfs/Research Protocols Surveys, & Slides/Program_Staff_Interview_Protocol.pdf\n\n      - Advisory Council Interview Protocol\n\n        pdfs/Research Protocols Surveys, & Slides/Advisory_Council_Interview_Protocol\n\n      - Clinical Supervisor Interview Protocol\n\n        pdfs/Research Protocols Surveys, & Slides/Clinical_Supervisor_Interview_Protocol.pdf\n\n      - Clinician Interview Protocol\n\n        pdfs/Research Protocols Surveys, & Slides/Clinician_Interview_Protocol.pdf\n\n      - Caregiver Interview Protocol\n\n        pdfs/Research Protocols Surveys, & Slides/Caregiver_Interview_Protocol.pdf\n\n      - Survivor Interview Protocol\n\n        pdfs/Research Protocols Surveys, & Slides/Survivor_Interview_Protocol.pdf\n\n    - Surveys\n\n      - Program Staff Survey\n\n        pdfs/Research Protocols Surveys, & Slides/Program_Staff_Survey.pdf\n\n      - Advisory Council Survey\n\n        pdfs/Research Protocols Surveys, & Slides/Advisory_Council_Survey.pdf\n\n      - Resource Team Meeting Survey\n\n        pdfs/Research Protocols Surveys, & Slides/Resource_Team_Meeting_Survey.pdf\n\n    - Trauma-Informed Research Webinar Slides: insert link\n\n      pdfs/Research Protocols Surveys, & Slides/Trauma-Informed_Research_Webinar_Slides.pdf\n\n- IL HEALS-related ICJIA Publications and Resources:\n\n  https://ilheals.com/publications/icjia-publications\n","title":"Renovation and Growth","html":"<p>As with any project, it is important to take inventory of the successes and missteps that occur during planning and implementation. For example:</p>\n<ul>\n<li>\n<p>Did the project turn out as expected?</p>\n</li>\n<li>\n<p>Has it been more or less successful than we imagined it would be?</p>\n</li>\n<li>\n<p>Are there things we should have done differently? Are there things we should start doing differently? Are there things that should be continued or replicated?</p>\n</li>\n<li>\n<p>Are there opportunities to expand the project? Opportunities to streamline the project?</p>\n</li>\n<li>\n<p>What have we learned that would be helpful to share with others?</p>\n</li>\n</ul>\n<p>After the SOC is created and launched, it is essential for stakeholders and partners to continue to reflect, evaluate, and adjust to ensure that the SOC is continuing to meet the needs of survivors, families, communities, and service providers.</p>\n<p>In this section of the Toolshed, you will find resources and tools to conduct research-based needs assessments methods that will allow you continue learning from partners, colleagues, and your community how to best meet the needs of children, youth, and families who have experienced victimization and trauma.</p>\n<ul>\n<li>\n<p><strong>Evaluating your Project</strong></p>\n<ul>\n<li>\n<p>Planning Long-term Evaluation and Assessment Activities from Linking Systems of Care Demonstration Initiative Coordinator Toolkit:</p>\n<p><a href=\"https://www.ncjfcj.org/wp-content/uploads/2021/11/Planning-Long-Term-Evaluation-and-Assessment-Activities.pdf\">https://www.ncjfcj.org/wp-content/uploads/2021/11/Planning-Long-Term-Evaluation-and-Assessment-Activities.pdf</a></p>\n</li>\n<li>\n<p>Evaluation of Systems of Care from Child Welfare Information Gateway:</p>\n<p><a href=\"https://www.childwelfare.gov/topics/management/reform/soc/build/evaluation/\">https://www.childwelfare.gov/topics/management/reform/soc/build/evaluation/</a></p>\n</li>\n<li>\n<p>Centering Racial Equity in Measurement and Evaluation from the Urban Institute:</p>\n<p><a href=\"https://www.urban.org/sites/default/files/publication/104487/centering-racial-equity-in-measurement-and-evaluation_0.pdf\">https://www.urban.org/sites/default/files/publication/104487/centering-racial-equity-in-measurement-and-evaluation_0.pdf</a></p>\n</li>\n<li>\n<p>Evaluation Plan Template from the CDC:</p>\n<p><a href=\"https://www.cdc.gov/tb/programs/evaluation/guide/pdf/evaluation_plan_template.pdf\">https://www.cdc.gov/tb/programs/evaluation/guide/pdf/evaluation_plan_template.pdf</a></p>\n</li>\n</ul>\n</li>\n<li>\n<p><strong>Engaging in Research</strong></p>\n<ul>\n<li>\n<p>IL HEALS Research Tools</p>\n<ul>\n<li>\n<p>Focus Group &amp; Interview Protocols</p>\n<ul>\n<li>\n<p>Resource Coordinator Focus Group Protocol</p>\n<p>pdfs/Research Protocols Surveys, &amp; Slides/Resource_Coordinator_Focus_Group_Protocol.pdf</p>\n</li>\n<li>\n<p>Program Staff Interview Protocol</p>\n<p>pdfs/Research Protocols Surveys, &amp; Slides/Program_Staff_Interview_Protocol.pdf</p>\n</li>\n<li>\n<p>Advisory Council Interview Protocol</p>\n<p>pdfs/Research Protocols Surveys, &amp; Slides/Advisory_Council_Interview_Protocol</p>\n</li>\n<li>\n<p>Clinical Supervisor Interview Protocol</p>\n<p>pdfs/Research Protocols Surveys, &amp; Slides/Clinical_Supervisor_Interview_Protocol.pdf</p>\n</li>\n<li>\n<p>Clinician Interview Protocol</p>\n<p>pdfs/Research Protocols Surveys, &amp; Slides/Clinician_Interview_Protocol.pdf</p>\n</li>\n<li>\n<p>Caregiver Interview Protocol</p>\n<p>pdfs/Research Protocols Surveys, &amp; Slides/Caregiver_Interview_Protocol.pdf</p>\n</li>\n<li>\n<p>Survivor Interview Protocol</p>\n<p>pdfs/Research Protocols Surveys, &amp; Slides/Survivor_Interview_Protocol.pdf</p>\n</li>\n</ul>\n</li>\n<li>\n<p>Surveys</p>\n<ul>\n<li>\n<p>Program Staff Survey</p>\n<p>pdfs/Research Protocols Surveys, &amp; Slides/Program_Staff_Survey.pdf</p>\n</li>\n<li>\n<p>Advisory Council Survey</p>\n<p>pdfs/Research Protocols Surveys, &amp; Slides/Advisory_Council_Survey.pdf</p>\n</li>\n<li>\n<p>Resource Team Meeting Survey</p>\n<p>pdfs/Research Protocols Surveys, &amp; Slides/Resource_Team_Meeting_Survey.pdf</p>\n</li>\n</ul>\n</li>\n<li>\n<p>Trauma-Informed Research Webinar Slides: insert link</p>\n<p>pdfs/Research Protocols Surveys, &amp; Slides/Trauma-Informed_Research_Webinar_Slides.pdf</p>\n</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>\n<p>IL HEALS-related ICJIA Publications and Resources:</p>\n<p><a href=\"https://ilheals.com/publications/icjia-publications\">https://ilheals.com/publications/icjia-publications</a></p>\n</li>\n</ul>\n","toc":[],"description":"Welcome to the Illinois HEALS CONNECT Newsletter! The issue features an overview of the Illinois HEALS program, an innovative approach to service delivery, and a program demonstration project update.","url":"https://ilheals.com/toolkit/renovation-and-growth/"},{"route":"/toolkit/tools-for-maintenance/","markdown":"\nOnce your SOC has launched, it is time to move into the next phase: maintaining and sustaining. Your SOC will need ongoing attention to survive and thrive.\n\nIn this module, you will find information and resources that will help you share your SOC’s successes, explore funding opportunities, strengthen your network, and cultivate new leaders to ensure that your SOC can continue to serve children, youth, and families who have been impacted by victimization and trauma.\n\n- **Demonstrating Impact**\n\n  - Showcasing Your Success from Linking Systems of Care Demonstration Initiative Coordinator Toolkit:\n\n    https://www.ncjfcj.org/wp-content/uploads/2021/11/Showcasing-Your-Success.pdf\n\n  - Sustainability Opportunities Storytelling Technical Assistance Bulletin from Linking Systems of Care Demonstration Initiative Coordinator Toolkit:\n\n    https://www.ncjfcj.org/wp-content/uploads/2021/11/Sustainability-Opportunities-Storytelling-TAB.pdf\n\n- **Exploring Funding & Grant Opportunities**\n\n  - Cultivating Funding and Financial Stability from Linking Systems of Care Demonstration Initiative Coordinator Toolkit:\n\n    https://www.ncjfcj.org/wp-content/uploads/2021/11/Cultivating-Funding-and-Financial-Stability.pdf\n\n  - Getting Grants and Financial Resources from the Community Tool Box, University of Kansas:\n\n    https://ctb.ku.edu/en/table-of-contents/finances/grants-and-financial-resources\n\n  - Grant Application Development Menu from VA HEALS:\n\n    http://virginiaheals.com/wp-content/uploads/2019/01/virginia_heals_toolkit_grant_application.pdf\n\n  - Inclusive and Equitable Grant Writing from PCAR:\n\n    https://pcar.org/resource/inclusive-equitable-grant-writing\n\n- **Planning for Training & Leadership Development**\n\n  - Developing a Plan for Building Leadership from the Community Tool Box, University of Kansas:\n\n    https://ctb.ku.edu/en/table-of-contents/leadership/leadership-ideas/plan-for-building-leadership/main\n\n  - Youth Involvement in Systems of Care: A Guide to Empowerment from Portland State University:\n\n    https://nwi.pdx.edu/NWI-book/Chapters/App-6e.3-Youth-Involvement-In-Systems-Of-Care.pdf\n\n- **Strengthening Collaboration**\n\n  - Building and Sustaining Commitment from the Community Tool Box, University of Kansas:\n\n    https://ctb.ku.edu/en/table-of-contents/leadership/leadership-functions/build-sustain-commitment/main\n","title":"Tools for Maintenance and Sustainability","html":"<p>Once your SOC has launched, it is time to move into the next phase: maintaining and sustaining. Your SOC will need ongoing attention to survive and thrive.</p>\n<p>In this module, you will find information and resources that will help you share your SOC’s successes, explore funding opportunities, strengthen your network, and cultivate new leaders to ensure that your SOC can continue to serve children, youth, and families who have been impacted by victimization and trauma.</p>\n<ul>\n<li>\n<p><strong>Demonstrating Impact</strong></p>\n<ul>\n<li>\n<p>Showcasing Your Success from Linking Systems of Care Demonstration Initiative Coordinator Toolkit:</p>\n<p><a href=\"https://www.ncjfcj.org/wp-content/uploads/2021/11/Showcasing-Your-Success.pdf\">https://www.ncjfcj.org/wp-content/uploads/2021/11/Showcasing-Your-Success.pdf</a></p>\n</li>\n<li>\n<p>Sustainability Opportunities Storytelling Technical Assistance Bulletin from Linking Systems of Care Demonstration Initiative Coordinator Toolkit:</p>\n<p><a href=\"https://www.ncjfcj.org/wp-content/uploads/2021/11/Sustainability-Opportunities-Storytelling-TAB.pdf\">https://www.ncjfcj.org/wp-content/uploads/2021/11/Sustainability-Opportunities-Storytelling-TAB.pdf</a></p>\n</li>\n</ul>\n</li>\n<li>\n<p><strong>Exploring Funding &amp; Grant Opportunities</strong></p>\n<ul>\n<li>\n<p>Cultivating Funding and Financial Stability from Linking Systems of Care Demonstration Initiative Coordinator Toolkit:</p>\n<p><a href=\"https://www.ncjfcj.org/wp-content/uploads/2021/11/Cultivating-Funding-and-Financial-Stability.pdf\">https://www.ncjfcj.org/wp-content/uploads/2021/11/Cultivating-Funding-and-Financial-Stability.pdf</a></p>\n</li>\n<li>\n<p>Getting Grants and Financial Resources from the Community Tool Box, University of Kansas:</p>\n<p><a href=\"https://ctb.ku.edu/en/table-of-contents/finances/grants-and-financial-resources\">https://ctb.ku.edu/en/table-of-contents/finances/grants-and-financial-resources</a></p>\n</li>\n<li>\n<p>Grant Application Development Menu from VA HEALS:</p>\n<p><a href=\"http://virginiaheals.com/wp-content/uploads/2019/01/virginia_heals_toolkit_grant_application.pdf\">http://virginiaheals.com/wp-content/uploads/2019/01/virginia_heals_toolkit_grant_application.pdf</a></p>\n</li>\n<li>\n<p>Inclusive and Equitable Grant Writing from PCAR:</p>\n<p><a href=\"https://pcar.org/resource/inclusive-equitable-grant-writing\">https://pcar.org/resource/inclusive-equitable-grant-writing</a></p>\n</li>\n</ul>\n</li>\n<li>\n<p><strong>Planning for Training &amp; Leadership Development</strong></p>\n<ul>\n<li>\n<p>Developing a Plan for Building Leadership from the Community Tool Box, University of Kansas:</p>\n<p><a href=\"https://ctb.ku.edu/en/table-of-contents/leadership/leadership-ideas/plan-for-building-leadership/main\">https://ctb.ku.edu/en/table-of-contents/leadership/leadership-ideas/plan-for-building-leadership/main</a></p>\n</li>\n<li>\n<p>Youth Involvement in Systems of Care: A Guide to Empowerment from Portland State University:</p>\n<p><a href=\"https://nwi.pdx.edu/NWI-book/Chapters/App-6e.3-Youth-Involvement-In-Systems-Of-Care.pdf\">https://nwi.pdx.edu/NWI-book/Chapters/App-6e.3-Youth-Involvement-In-Systems-Of-Care.pdf</a></p>\n</li>\n</ul>\n</li>\n<li>\n<p><strong>Strengthening Collaboration</strong></p>\n<ul>\n<li>\n<p>Building and Sustaining Commitment from the Community Tool Box, University of Kansas:</p>\n<p><a href=\"https://ctb.ku.edu/en/table-of-contents/leadership/leadership-functions/build-sustain-commitment/main\">https://ctb.ku.edu/en/table-of-contents/leadership/leadership-functions/build-sustain-commitment/main</a></p>\n</li>\n</ul>\n</li>\n</ul>\n","toc":[],"description":"Welcome to the Illinois HEALS CONNECT Newsletter! The issue features an overview of the Illinois HEALS program, an innovative approach to service delivery, and a program demonstration project update.","url":"https://ilheals.com/toolkit/tools-for-maintenance/"},{"route":"/toolkit/understanding-the-environment/","markdown":"\nAs with any building project, before you begin, you must answer three key questions:\n\n- Who can help me?\n\n- What supplies do I already have?\n\n- What supplies do I need?\n\n  When planning to build a SOC, engage stakeholders and partners to support and inform the initiative, determine which services currently exist to support children and youth impacted by victimization and trauma, and identify current service gaps. Gathering this preliminary information will help guide your next steps and will prevent duplicating efforts and services.\n  As you are determining who can and should be part of your SOC, consider the unique strengths and skills stakeholders can offer and how partners can be engaged throughout the course of the project. For example, some stakeholders may have the skills and interest in serving on an advisory committee, while others may prefer to be part of the referral network. Regardless of a stakeholder’s preference, you can tap into their skills and knowledge through effective engagement. The resources provided in this module offer tools and activities that can help you identify stakeholders and engage them in meaningful planning conversations.\n\n  Collectively, you and your partners have a wealth of information about services available for children and youth who have experienced victimization and trauma in your area. Discussions prompted by these resources and activities provide opportunities for collaborators to learn about and share information on their programs and services. The resources in this section will help you to gather and document important information about your community that will be essential for planning next steps.\n\n- **Who are the Stakeholders?**\n\n  - Linking Systems of Care for Children and Youth Project Toolkit Identifying Stakeholders Module and Worksheet:\n\n    https://www.linkingsystemsofcare.org/toolkit-topics/stakeholder-engagement.html\n\n  - Linking Systems of Care for Children and Youth Project Toolkit Engaging New Partners Module:\n\n    https://www.linkingsystemsofcare.org/toolkit-topics/recruiting-new-partners-stakeholders.html\n\n  - Linking Systems of Care Demonstration Initiative Coordinator Toolkit’s Stakeholder Engagement:\n\n    https://www.ncjfcj.org/wp-content/uploads/2021/11/Stakeholder-Engagement.pdf\n\n  - People with lived experience and/or service recipients\n\n    1. Methods and Emerging Strategies to Engage People with Lived Experience Guide from the U.S. Department of Health and Human Services:\n\n       https://aspe.hhs.gov/sites/default/files/documents/47f62cae96710d1fa13b0f590f2d1b03/lived-experience-brief.pdf\n\n    2. Engaging People with Lived Experience Toolkit from Community Commons:\n\n       https://www.communitycommons.org/collections/Engaging-Lived-Experience-Toolkit\n\n    3. IL HEALS Recruitment Flyer:\n\n       https://www.linkingsystemsofcare.org/images/toolkit/recruiting_stakeholders_sample.pdf\n\n  - Who’s missing? Building an inclusive and diverse SOC\n\n    1. Multicultural Collaboration from the Community Tool Box, University of Kansas:\n\n       https://ctb.ku.edu/en/table-of-contents/culture/cultural-competence/multicultural-collaboration/main\n\n    2. Working Together for Racial Justice and Inclusion from The Community Tool Box, University of Kansas:\n\n       https://ctb.ku.edu/en/table-of-contents/culture/racial-injustice-and-inclusion\n\n  - Forming an Advisory Committee\n\n    1. Best Practices for Forming a Community Advisory Board, Center for Healthcare Strategies:\n\n       https://www.chcs.org/resource/best-practices-for-convening-a-community-advisory-board/\n\n    2. Tools and Resources for Project-Based Community Advisory Boards from the Urban Institute:\n\n       https://www.urban.org/sites/default/files/publication/104938/tools-and-resources-for-project-based-community-advisory-boards_0.pdf\n\n- **Assessing the Community**\n\n  - Conducting Resource Mapping\n\n    1. Linking Systems of Care Demonstration Initiative Coordinator Toolkit’s Community Resource Mapping Overview:\n\n       https://www.ncjfcj.org/wp-content/uploads/2021/11/Community-Resource-Mapping.pdf\n\n    2. Linking Systems of Care for Children and Youth Project Toolkit Community Resource Mapping Module and Activity:\n\n       https://www.linkingsystemsofcare.org/toolkit-topics/community-resource-mapping.html\n\n    3. Resource Mapping guides from the Virginia HEALS Toolkit:\n\n       a. Guide:\n\n       http://virginiaheals.com/wp-content/uploads/2019/07/Community-Resource-Mapping-Facilitators-Guide.pdf\n\n       b. E-learning Course:\n\n       https://www.dss.virginia.gov/division/famserv/training/vahe1001/story.html\n\n    4. Developing a Plan for Assessing Local Needs and Resources from the Community Tool Box, University of Kansas:\n\n       https://ctb.ku.edu/en/table-of-contents/assessment/assessing-community-needs-and-resources/develop-a-plan/main\n\n  - Analyzing Community Needs\n\n    1. Linking Systems of Care Demonstration Initiative Coordinator Toolkit’s Gap Analysis Overview:\n\n       https://www.ncjfcj.org/wp-content/uploads/2021/11/Gap-Analysis.pdf\n\n    2. Linking Systems of Care for Children and Youth Project Toolkit Gap Analysis Module:\n\n       https://www.linkingsystemsofcare.org/toolkit-topics/gap-analysis.html 3. IL HEALS Provider Scan Tool: create link –\n\n       Toolshed pdfs/Research Protocols, Surveys, & Guides/HEALS_Provider_Survey_Tool.pdf\n\n    3. IL HEALS Provider Scan Sample:\n\n       https://www.linkingsystemsofcare.org/images/toolkit/gap_analysis_sample_2.pdf\n\n- **Planning Project Inputs and Outputs**\n\n  - Linking Systems of Care Demonstration Initiative Coordinator Toolkit’s Logic Model Primer:\n\n    https://www.ncjfcj.org/wp-content/uploads/2021/11/Logic-Model-Primer.pdf\n\n  - Linking Systems of Care for Children and Youth Project Toolkit Logic Model Module and Worksheet:\n\n    https://www.linkingsystemsofcare.org/toolkit-topics/logic-models.html\n\n  - IL HEALS Sample Logic Model:\n\n    https://www.linkingsystemsofcare.org/images/toolkit/logic_model_sample_2.pdf\n","title":"Understanding the Environment & Planning","html":"<p>As with any building project, before you begin, you must answer three key questions:</p>\n<ul>\n<li>\n<p>Who can help me?</p>\n</li>\n<li>\n<p>What supplies do I already have?</p>\n</li>\n<li>\n<p>What supplies do I need?</p>\n<p>When planning to build a SOC, engage stakeholders and partners to support and inform the initiative, determine which services currently exist to support children and youth impacted by victimization and trauma, and identify current service gaps. Gathering this preliminary information will help guide your next steps and will prevent duplicating efforts and services.\nAs you are determining who can and should be part of your SOC, consider the unique strengths and skills stakeholders can offer and how partners can be engaged throughout the course of the project. For example, some stakeholders may have the skills and interest in serving on an advisory committee, while others may prefer to be part of the referral network. Regardless of a stakeholder’s preference, you can tap into their skills and knowledge through effective engagement. The resources provided in this module offer tools and activities that can help you identify stakeholders and engage them in meaningful planning conversations.</p>\n<p>Collectively, you and your partners have a wealth of information about services available for children and youth who have experienced victimization and trauma in your area. Discussions prompted by these resources and activities provide opportunities for collaborators to learn about and share information on their programs and services. The resources in this section will help you to gather and document important information about your community that will be essential for planning next steps.</p>\n</li>\n<li>\n<p><strong>Who are the Stakeholders?</strong></p>\n<ul>\n<li>\n<p>Linking Systems of Care for Children and Youth Project Toolkit Identifying Stakeholders Module and Worksheet:</p>\n<p><a href=\"https://www.linkingsystemsofcare.org/toolkit-topics/stakeholder-engagement.html\">https://www.linkingsystemsofcare.org/toolkit-topics/stakeholder-engagement.html</a></p>\n</li>\n<li>\n<p>Linking Systems of Care for Children and Youth Project Toolkit Engaging New Partners Module:</p>\n<p><a href=\"https://www.linkingsystemsofcare.org/toolkit-topics/recruiting-new-partners-stakeholders.html\">https://www.linkingsystemsofcare.org/toolkit-topics/recruiting-new-partners-stakeholders.html</a></p>\n</li>\n<li>\n<p>Linking Systems of Care Demonstration Initiative Coordinator Toolkit’s Stakeholder Engagement:</p>\n<p><a href=\"https://www.ncjfcj.org/wp-content/uploads/2021/11/Stakeholder-Engagement.pdf\">https://www.ncjfcj.org/wp-content/uploads/2021/11/Stakeholder-Engagement.pdf</a></p>\n</li>\n<li>\n<p>People with lived experience and/or service recipients</p>\n<ol>\n<li>\n<p>Methods and Emerging Strategies to Engage People with Lived Experience Guide from the U.S. Department of Health and Human Services:</p>\n<p><a href=\"https://aspe.hhs.gov/sites/default/files/documents/47f62cae96710d1fa13b0f590f2d1b03/lived-experience-brief.pdf\">https://aspe.hhs.gov/sites/default/files/documents/47f62cae96710d1fa13b0f590f2d1b03/lived-experience-brief.pdf</a></p>\n</li>\n<li>\n<p>Engaging People with Lived Experience Toolkit from Community Commons:</p>\n<p><a href=\"https://www.communitycommons.org/collections/Engaging-Lived-Experience-Toolkit\">https://www.communitycommons.org/collections/Engaging-Lived-Experience-Toolkit</a></p>\n</li>\n<li>\n<p>IL HEALS Recruitment Flyer:</p>\n<p><a href=\"https://www.linkingsystemsofcare.org/images/toolkit/recruiting_stakeholders_sample.pdf\">https://www.linkingsystemsofcare.org/images/toolkit/recruiting_stakeholders_sample.pdf</a></p>\n</li>\n</ol>\n</li>\n<li>\n<p>Who’s missing? Building an inclusive and diverse SOC</p>\n<ol>\n<li>\n<p>Multicultural Collaboration from the Community Tool Box, University of Kansas:</p>\n<p><a href=\"https://ctb.ku.edu/en/table-of-contents/culture/cultural-competence/multicultural-collaboration/main\">https://ctb.ku.edu/en/table-of-contents/culture/cultural-competence/multicultural-collaboration/main</a></p>\n</li>\n<li>\n<p>Working Together for Racial Justice and Inclusion from The Community Tool Box, University of Kansas:</p>\n<p><a href=\"https://ctb.ku.edu/en/table-of-contents/culture/racial-injustice-and-inclusion\">https://ctb.ku.edu/en/table-of-contents/culture/racial-injustice-and-inclusion</a></p>\n</li>\n</ol>\n</li>\n<li>\n<p>Forming an Advisory Committee</p>\n<ol>\n<li>\n<p>Best Practices for Forming a Community Advisory Board, Center for Healthcare Strategies:</p>\n<p><a href=\"https://www.chcs.org/resource/best-practices-for-convening-a-community-advisory-board/\">https://www.chcs.org/resource/best-practices-for-convening-a-community-advisory-board/</a></p>\n</li>\n<li>\n<p>Tools and Resources for Project-Based Community Advisory Boards from the Urban Institute:</p>\n<p><a href=\"https://www.urban.org/sites/default/files/publication/104938/tools-and-resources-for-project-based-community-advisory-boards_0.pdf\">https://www.urban.org/sites/default/files/publication/104938/tools-and-resources-for-project-based-community-advisory-boards_0.pdf</a></p>\n</li>\n</ol>\n</li>\n</ul>\n</li>\n<li>\n<p><strong>Assessing the Community</strong></p>\n<ul>\n<li>\n<p>Conducting Resource Mapping</p>\n<ol>\n<li>\n<p>Linking Systems of Care Demonstration Initiative Coordinator Toolkit’s Community Resource Mapping Overview:</p>\n<p><a href=\"https://www.ncjfcj.org/wp-content/uploads/2021/11/Community-Resource-Mapping.pdf\">https://www.ncjfcj.org/wp-content/uploads/2021/11/Community-Resource-Mapping.pdf</a></p>\n</li>\n<li>\n<p>Linking Systems of Care for Children and Youth Project Toolkit Community Resource Mapping Module and Activity:</p>\n<p><a href=\"https://www.linkingsystemsofcare.org/toolkit-topics/community-resource-mapping.html\">https://www.linkingsystemsofcare.org/toolkit-topics/community-resource-mapping.html</a></p>\n</li>\n<li>\n<p>Resource Mapping guides from the Virginia HEALS Toolkit:</p>\n<p>a. Guide:</p>\n<p><a href=\"http://virginiaheals.com/wp-content/uploads/2019/07/Community-Resource-Mapping-Facilitators-Guide.pdf\">http://virginiaheals.com/wp-content/uploads/2019/07/Community-Resource-Mapping-Facilitators-Guide.pdf</a></p>\n<p>b. E-learning Course:</p>\n<p><a href=\"https://www.dss.virginia.gov/division/famserv/training/vahe1001/story.html\">https://www.dss.virginia.gov/division/famserv/training/vahe1001/story.html</a></p>\n</li>\n<li>\n<p>Developing a Plan for Assessing Local Needs and Resources from the Community Tool Box, University of Kansas:</p>\n<p><a href=\"https://ctb.ku.edu/en/table-of-contents/assessment/assessing-community-needs-and-resources/develop-a-plan/main\">https://ctb.ku.edu/en/table-of-contents/assessment/assessing-community-needs-and-resources/develop-a-plan/main</a></p>\n</li>\n</ol>\n</li>\n<li>\n<p>Analyzing Community Needs</p>\n<ol>\n<li>\n<p>Linking Systems of Care Demonstration Initiative Coordinator Toolkit’s Gap Analysis Overview:</p>\n<p><a href=\"https://www.ncjfcj.org/wp-content/uploads/2021/11/Gap-Analysis.pdf\">https://www.ncjfcj.org/wp-content/uploads/2021/11/Gap-Analysis.pdf</a></p>\n</li>\n<li>\n<p>Linking Systems of Care for Children and Youth Project Toolkit Gap Analysis Module:</p>\n<p><a href=\"https://www.linkingsystemsofcare.org/toolkit-topics/gap-analysis.html\">https://www.linkingsystemsofcare.org/toolkit-topics/gap-analysis.html</a> 3. IL HEALS Provider Scan Tool: create link –</p>\n<p>Toolshed pdfs/Research Protocols, Surveys, &amp; Guides/HEALS_Provider_Survey_Tool.pdf</p>\n</li>\n<li>\n<p>IL HEALS Provider Scan Sample:</p>\n<p><a href=\"https://www.linkingsystemsofcare.org/images/toolkit/gap_analysis_sample_2.pdf\">https://www.linkingsystemsofcare.org/images/toolkit/gap_analysis_sample_2.pdf</a></p>\n</li>\n</ol>\n</li>\n</ul>\n</li>\n<li>\n<p><strong>Planning Project Inputs and Outputs</strong></p>\n<ul>\n<li>\n<p>Linking Systems of Care Demonstration Initiative Coordinator Toolkit’s Logic Model Primer:</p>\n<p><a href=\"https://www.ncjfcj.org/wp-content/uploads/2021/11/Logic-Model-Primer.pdf\">https://www.ncjfcj.org/wp-content/uploads/2021/11/Logic-Model-Primer.pdf</a></p>\n</li>\n<li>\n<p>Linking Systems of Care for Children and Youth Project Toolkit Logic Model Module and Worksheet:</p>\n<p><a href=\"https://www.linkingsystemsofcare.org/toolkit-topics/logic-models.html\">https://www.linkingsystemsofcare.org/toolkit-topics/logic-models.html</a></p>\n</li>\n<li>\n<p>IL HEALS Sample Logic Model:</p>\n<p><a href=\"https://www.linkingsystemsofcare.org/images/toolkit/logic_model_sample_2.pdf\">https://www.linkingsystemsofcare.org/images/toolkit/logic_model_sample_2.pdf</a></p>\n</li>\n</ul>\n</li>\n</ul>\n","toc":[],"description":"ILHEALS Toolkit: Understanding the Environment & Planning.","url":"https://ilheals.com/toolkit/understanding-the-environment/"},{"route":"/toolkit-home/","markdown":"\n## What is a systems of care toolshed versus a toolkit?\n\nIL HEALS Implementation Site Coordinators suggest building on what already exists when creating a [system of care (SOC)](https://ovc.ojp.gov/news/grantee-news/linking-systems-care-children-and-youth). This toolshed guide aims to follow that advice.\n\nWhen beginning a do-it-yourself project, you may not have all the tools in one toolkit needed to complete the project. You may utilize tools from other toolboxes in your shed or rely on friends, neighbors, or colleagues to lend you the right tool for the job. Or, you may need to invest in a new tool to fit your project’s unique circumstances.\n\nHEALS Toolshed Guide, is informed by lessons learned through the IL HEALS project. The toolshed houses a compilation of tools that have been created by IL HEALS and shares links to resources and toolkits developed by national partners and allied organizations that are experts in creating systems of care and building community collaborations.\n\nThe sections of the IL HEALS Toolshed include:\n\n<div class=\"px-0\">\n\n## Understanding the Environment & Planning\n\n<div class=\"px-1\">\n\n[Click for full details](/toolkit/understanding-the-environment/)&nbsp;&raquo;\n\n</div>\n\n<div class=\"px-3\">\n\n- Who are the Stakeholders?\n\n- Assessing the Community\n\n- Planning Your Project’s Inputs and Outputs\n\n</div>\n\n## Building a Strong Structure for Your System of Care\n\n<div class=\"px-1\">\n\n[Click for full details](/toolkit/building-a-strong-structure/)&nbsp;&raquo;\n\n</div>\n\n<div class=\"px-3\">\n\n- Hiring Coordinators\n\n- Enhancing Team Functioning\n\n- Hosting and Facilitating Meetings\n\n- Developing Your Vision and Mission\n\n- Creating a Resource and Referral Network\n\n- Establishing Agreements through MOUs\n\n</div>\n\n## Fundamental Tools\n\n<div class=\"px-1\">\n\n[Click for full details](/toolkit/fundamental-tools/)&nbsp;&raquo;\n\n</div>\n\n<div class=\"px-3\">\n\n- Considerations for Implementing the Use of a Screening Tool\n\n- Developing Protocols\n\n- Building Capacity with Training & Resources\n\n- Conducting Outreach\n\n- Supporting Self-care and Resiliency for Staff\n\n</div>\n\n## Tools for Maintenance and Sustainability\n\n<div class=\"px-1\">\n\n[Click for full details](/toolkit/tools-for-maintenance/)&nbsp;&raquo;\n\n</div>\n\n<div class=\"px-3\">\n\n- Demonstrating Impact\n\n- Exploring Funding & Grant Opportunities\n\n- Planning for Training & Leadership Development\n\n- Strengthening Collaboration\n\n- Attending to Equity and Inclusion\n\n</div>\n\n## Renovation and Growth\n\n<div class=\"px-1\">\n\n[Click for full details](/toolkit/renovation-and-growth/)&nbsp;&raquo;\n\n</div>\n\n<div class=\"px-3\">\n\n- Evaluating your Project\n\n- Engaging in Research\n\n</div>\n\n## Additional Toolkit Resources\n\n<div class=\"px-1\">\n\n[Click for full details](/toolkit/additional-resources/)&nbsp;&raquo;\n\n</div>\n\n<div class=\"px-3\">\n\n- Linking Systems of Care/HEALS Toolkits from other states\n\n- SOC Toolkits\n\n- Community Collaboration Toolkits\n\n</div>\n\n<div style=\"margin-bottom: 175px\"></div>\n","title":"Toolkit Home","menuTitle":"Toolkit","createdAt":"2023-05-12","html":"<h2 id=\"what-is-a-systems-of-care-toolshed-versus-a-toolkit\">What is a systems of care toolshed versus a toolkit?</h2>\n<p>IL HEALS Implementation Site Coordinators suggest building on what already exists when creating a <a href=\"https://ovc.ojp.gov/news/grantee-news/linking-systems-care-children-and-youth\">system of care (SOC)</a>. This toolshed guide aims to follow that advice.</p>\n<p>When beginning a do-it-yourself project, you may not have all the tools in one toolkit needed to complete the project. You may utilize tools from other toolboxes in your shed or rely on friends, neighbors, or colleagues to lend you the right tool for the job. Or, you may need to invest in a new tool to fit your project’s unique circumstances.</p>\n<p>HEALS Toolshed Guide, is informed by lessons learned through the IL HEALS project. The toolshed houses a compilation of tools that have been created by IL HEALS and shares links to resources and toolkits developed by national partners and allied organizations that are experts in creating systems of care and building community collaborations.</p>\n<p>The sections of the IL HEALS Toolshed include:</p>\n<div class=\"px-0\">\n<h2 id=\"understanding-the-environment-planning\">Understanding the Environment &amp; Planning</h2>\n<div class=\"px-1\">\n<p><a href=\"/toolkit/understanding-the-environment/\">Click for full details</a> »</p>\n</div>\n<div class=\"px-3\">\n<ul>\n<li>\n<p>Who are the Stakeholders?</p>\n</li>\n<li>\n<p>Assessing the Community</p>\n</li>\n<li>\n<p>Planning Your Project’s Inputs and Outputs</p>\n</li>\n</ul>\n</div>\n<h2 id=\"building-a-strong-structure-for-your-system-of-care\">Building a Strong Structure for Your System of Care</h2>\n<div class=\"px-1\">\n<p><a href=\"/toolkit/building-a-strong-structure/\">Click for full details</a> »</p>\n</div>\n<div class=\"px-3\">\n<ul>\n<li>\n<p>Hiring Coordinators</p>\n</li>\n<li>\n<p>Enhancing Team Functioning</p>\n</li>\n<li>\n<p>Hosting and Facilitating Meetings</p>\n</li>\n<li>\n<p>Developing Your Vision and Mission</p>\n</li>\n<li>\n<p>Creating a Resource and Referral Network</p>\n</li>\n<li>\n<p>Establishing Agreements through MOUs</p>\n</li>\n</ul>\n</div>\n<h2 id=\"fundamental-tools\">Fundamental Tools</h2>\n<div class=\"px-1\">\n<p><a href=\"/toolkit/fundamental-tools/\">Click for full details</a> »</p>\n</div>\n<div class=\"px-3\">\n<ul>\n<li>\n<p>Considerations for Implementing the Use of a Screening Tool</p>\n</li>\n<li>\n<p>Developing Protocols</p>\n</li>\n<li>\n<p>Building Capacity with Training &amp; Resources</p>\n</li>\n<li>\n<p>Conducting Outreach</p>\n</li>\n<li>\n<p>Supporting Self-care and Resiliency for Staff</p>\n</li>\n</ul>\n</div>\n<h2 id=\"tools-for-maintenance-and-sustainability\">Tools for Maintenance and Sustainability</h2>\n<div class=\"px-1\">\n<p><a href=\"/toolkit/tools-for-maintenance/\">Click for full details</a> »</p>\n</div>\n<div class=\"px-3\">\n<ul>\n<li>\n<p>Demonstrating Impact</p>\n</li>\n<li>\n<p>Exploring Funding &amp; Grant Opportunities</p>\n</li>\n<li>\n<p>Planning for Training &amp; Leadership Development</p>\n</li>\n<li>\n<p>Strengthening Collaboration</p>\n</li>\n<li>\n<p>Attending to Equity and Inclusion</p>\n</li>\n</ul>\n</div>\n<h2 id=\"renovation-and-growth\">Renovation and Growth</h2>\n<div class=\"px-1\">\n<p><a href=\"/toolkit/renovation-and-growth/\">Click for full details</a> »</p>\n</div>\n<div class=\"px-3\">\n<ul>\n<li>\n<p>Evaluating your Project</p>\n</li>\n<li>\n<p>Engaging in Research</p>\n</li>\n</ul>\n</div>\n<h2 id=\"additional-toolkit-resources\">Additional Toolkit Resources</h2>\n<div class=\"px-1\">\n<p><a href=\"/toolkit/additional-resources/\">Click for full details</a> »</p>\n</div>\n<div class=\"px-3\">\n<ul>\n<li>\n<p>Linking Systems of Care/HEALS Toolkits from other states</p>\n</li>\n<li>\n<p>SOC Toolkits</p>\n</li>\n<li>\n<p>Community Collaboration Toolkits</p>\n</li>\n</ul>\n</div>\n<div style=\"margin-bottom: 175px\"></div>\n","toc":[{"content":"What is a systems of care toolshed versus a toolkit?","slug":"what-is-a-systems-of-care-toolshed-versus-a-toolkit","lvl":2,"i":0,"seen":0},{"content":"Understanding the Environment & Planning","slug":"understanding-the-environment--planning","lvl":2,"i":1,"seen":0},{"content":"Building a Strong Structure for Your System of Care","slug":"building-a-strong-structure-for-your-system-of-care","lvl":2,"i":2,"seen":0},{"content":"Fundamental Tools","slug":"fundamental-tools","lvl":2,"i":3,"seen":0},{"content":"Tools for Maintenance and Sustainability","slug":"tools-for-maintenance-and-sustainability","lvl":2,"i":4,"seen":0},{"content":"Renovation and Growth","slug":"renovation-and-growth","lvl":2,"i":5,"seen":0},{"content":"Additional Toolkit Resources","slug":"additional-toolkit-resources","lvl":2,"i":6,"seen":0}],"description":"Helping Everyone Access Linked Systems (Illinois HEALS) is multi-year initiative to address child and youth victimization.","url":"https://ilheals.com/toolkit-home/"},{"route":"/webinars/","markdown":"\n<style>\nh2 {margin-top: 35px !important;}\nh2 ~ p, h3 ~ p{\n  margin-left: 25px !important;\n}\nh3 {margin-top: 35px !important; margin-left: 25px;}\nh2 ~ ul {margin-left: 25px; margin-bottom: 45px !important}\n</style>\n\n## Webinar Series\n\nProfessionals serving children continually seek improved strategies to engage parents and support families. This past winter, the Illinois HEALS initiative sponsored a series of one-hour webinars that introduced practitioners to approaches that can enhance the way they work with parents.\n\n### Wraparound: Engaging Families in Planning and Intervention\n\nSheri Luecking, Director of Programming\nMidwest PBIS Network\n\n<div class=\"text-center mt-5 mb-5 embed\" >\n  <div class=\"videoWrapper\" style=\"width: 100%; \">\n           <iframe height=\"315\" width=\"560\" src=\"https://www.youtube.com/embed/amo4I3OIWIg\" style=\"border: none  !important;\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen title=\"Engaging Families in Planning and Intervention Thumbnail\">\n           </iframe>\n   </div>\n</div>\n\n### **Family Engagement in Program Leadership**\n\nLynda Gargan, Executive Director and Michelle Covington, Project Manager\nNational Federation of Families for Children’s Mental Health\n\n- [Download Presentation Slides PDF](../Family+Engagement+IL+Heals.pdf)\n\n- [Download Worksheet](../Family-Readiness-Worksheet.pdf)\n\n<div class=\"text-center mt-5 mb-5 embed\" >\n   <div class=\"videoWrapper\" style=\"width: 100%; \">\n           <iframe src=\"https://www.youtube.com/embed/oe0XrrQHkuQ\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen title=\"Family Engagement in Program Leadership Thumbnail\" style=\"border: none  !important;\">\n           </iframe>\n   </div>\n</div>\n\n### **Engaging Parents in Parenting Skills Training: An Overview of the Chicago Parent Program**\n\nDeborah Gross, DNSc, Johns Hopkins University School of Nursing\nSusan Breitenstein, PhD., The Ohio State University School of Nursing\nThe Chicago Parent Program\n\n<div class=\"text-center mt-5 mb-5 embed\" >\n   <div class=\"videoWrapper\" style=\"width: 100%; \">\n           <iframe src=\"https://www.youtube.com/embed/L6MMMccSUMk\" style=\"border: none !important\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen title=\"Engaging Parents in Parenting Skills Training: An Overview of the Chicago Parent Program Thumbnail\">\n           </iframe>\n   </div>\n</div>\n\n## Research Findings\n\n### Webinar: Victim Informed Strategies for Responding to Young Victims and Families\n\nAs part of a 15-month planning process, Illinois HEALS researchers interviewed young adults and caregivers of children and youth impacted by violence to better understand their experiences with service providers and their recommendations for improving responses to facilitate healing. Presenters provide an overview of critical activities during the planning phase, interview findings, and the action plan, all of which can inform researchers and practitioners seeking to develop similar partnerships and those working to strengthen their response to young victims and their families.\n\n<div class=\"text-center mt-5 mb-5 embed\" >\n   <div class=\"videoWrapper\" style=\"width: 100%; \">\n           <iframe height=\"315\" width=\"560\" src=\"https://www.youtube.com/embed/O87SVzBFbk8\" style=\"border: none  !important;\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen title=\"Victim Informed Strategies for Responding to Young Victims and Families Thumbnail\">\n           </iframe>\n   </div>\n</div>\n\n## For Future Webinars\n\nIf you would like to subscribe to the Illinois HEALS newsletter to learn about new webinars, please send an email to Leslie.Cortez@illinois.gov with “subscribe” in the Subject line.\n","title":"Webinars","menuTitle":"Webinars","createdAt":"2020-11-03","html":"<style>\nh2 {margin-top: 35px !important;}\nh2 ~ p, h3 ~ p{\n  margin-left: 25px !important;\n}\nh3 {margin-top: 35px !important; margin-left: 25px;}\nh2 ~ ul {margin-left: 25px; margin-bottom: 45px !important}\n</style>\n<h2 id=\"webinar-series\">Webinar Series</h2>\n<p>Professionals serving children continually seek improved strategies to engage parents and support families. This past winter, the Illinois HEALS initiative sponsored a series of one-hour webinars that introduced practitioners to approaches that can enhance the way they work with parents.</p>\n<h3 id=\"wraparound-engaging-families-in-planning-and-intervention\">Wraparound: Engaging Families in Planning and Intervention</h3>\n<p>Sheri Luecking, Director of Programming\nMidwest PBIS Network</p>\n<div class=\"text-center mt-5 mb-5 embed\" >\n  <div class=\"videoWrapper\" style=\"width: 100%; \">\n           <iframe height=\"315\" width=\"560\" src=\"https://www.youtube.com/embed/amo4I3OIWIg\" style=\"border: none  !important;\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen title=\"Engaging Families in Planning and Intervention Thumbnail\">\n           </iframe>\n   </div>\n</div>\n<h3 id=\"family-engagement-in-program-leadership\"><strong>Family Engagement in Program Leadership</strong></h3>\n<p>Lynda Gargan, Executive Director and Michelle Covington, Project Manager\nNational Federation of Families for Children’s Mental Health</p>\n<ul>\n<li>\n<p><a href=\"../Family+Engagement+IL+Heals.pdf\">Download Presentation Slides PDF</a></p>\n</li>\n<li>\n<p><a href=\"../Family-Readiness-Worksheet.pdf\">Download Worksheet</a></p>\n</li>\n</ul>\n<div class=\"text-center mt-5 mb-5 embed\" >\n   <div class=\"videoWrapper\" style=\"width: 100%; \">\n           <iframe src=\"https://www.youtube.com/embed/oe0XrrQHkuQ\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen title=\"Family Engagement in Program Leadership Thumbnail\" style=\"border: none  !important;\">\n           </iframe>\n   </div>\n</div>\n<h3 id=\"engaging-parents-in-parenting-skills-training-an-overview-of-the-chicago-parent-program\"><strong>Engaging Parents in Parenting Skills Training: An Overview of the Chicago Parent Program</strong></h3>\n<p>Deborah Gross, DNSc, Johns Hopkins University School of Nursing\nSusan Breitenstein, PhD., The Ohio State University School of Nursing\nThe Chicago Parent Program</p>\n<div class=\"text-center mt-5 mb-5 embed\" >\n   <div class=\"videoWrapper\" style=\"width: 100%; \">\n           <iframe src=\"https://www.youtube.com/embed/L6MMMccSUMk\" style=\"border: none !important\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen title=\"Engaging Parents in Parenting Skills Training: An Overview of the Chicago Parent Program Thumbnail\">\n           </iframe>\n   </div>\n</div>\n<h2 id=\"research-findings\">Research Findings</h2>\n<h3 id=\"webinar-victim-informed-strategies-for-responding-to-young-victims-and-families\">Webinar: Victim Informed Strategies for Responding to Young Victims and Families</h3>\n<p>As part of a 15-month planning process, Illinois HEALS researchers interviewed young adults and caregivers of children and youth impacted by violence to better understand their experiences with service providers and their recommendations for improving responses to facilitate healing. Presenters provide an overview of critical activities during the planning phase, interview findings, and the action plan, all of which can inform researchers and practitioners seeking to develop similar partnerships and those working to strengthen their response to young victims and their families.</p>\n<div class=\"text-center mt-5 mb-5 embed\" >\n   <div class=\"videoWrapper\" style=\"width: 100%; \">\n           <iframe height=\"315\" width=\"560\" src=\"https://www.youtube.com/embed/O87SVzBFbk8\" style=\"border: none  !important;\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen title=\"Victim Informed Strategies for Responding to Young Victims and Families Thumbnail\">\n           </iframe>\n   </div>\n</div>\n<h2 id=\"for-future-webinars\">For Future Webinars</h2>\n<p>If you would like to subscribe to the Illinois HEALS newsletter to learn about new webinars, please send an email to <a href=\"mailto:Leslie.Cortez@illinois.gov\">Leslie.Cortez@illinois.gov</a> with “subscribe” in the Subject line.</p>\n","toc":[{"content":"Webinar Series","slug":"webinar-series","lvl":2,"i":0,"seen":0},{"content":"Wraparound: Engaging Families in Planning and Intervention","slug":"wraparound-engaging-families-in-planning-and-intervention","lvl":3,"i":1,"seen":0},{"content":"**Family Engagement in Program Leadership**","slug":"family-engagement-in-program-leadership","lvl":3,"i":2,"seen":0},{"content":"**Engaging Parents in Parenting Skills Training: An Overview of the Chicago Parent Program**","slug":"engaging-parents-in-parenting-skills-training-an-overview-of-the-chicago-parent-program","lvl":3,"i":3,"seen":0},{"content":"Research Findings","slug":"research-findings","lvl":2,"i":4,"seen":0},{"content":"Webinar: Victim Informed Strategies for Responding to Young Victims and Families","slug":"webinar-victim-informed-strategies-for-responding-to-young-victims-and-families","lvl":3,"i":5,"seen":0},{"content":"For Future Webinars","slug":"for-future-webinars","lvl":2,"i":6,"seen":0}],"description":"Helping Everyone Access Linked Systems (Illinois HEALS) is multi-year initiative to address child and youth victimization.","url":"https://ilheals.com/webinars/"}]